module.exports = {
  188: `
微信广告投放平台介绍
微信广告投放平台
是微信公众平台为广大广告主提供的广告投放系统。广告主通过广告投放系统可自助投放、管理广告并衡量效果，实现多种营销推广目标。

微信广告投放平台的核心功能
标准化规则，全自助广告投放
集中管理广告投放计划，高效便捷地帮助客户投放广告
全面数据统计，自定义个性化数据报表
依托平台大数据智能分析，帮助广告主优化广告投放效果
通过模板化推广页工具，提升广告创意创作效率
  `,
  90: `
投放微信广告首先需要进行广告主的开户操作，开户操作总共分为以下 4 步：
1. 申请公众号/小程序
进入
微信公众平台
，点击右上角”立即注册”，按照流程填写资料，申请开通公众号/小程序并等待审核。
公众号详细注册流程
小程序详细注册流程
2. 申请微信认证
公众号认证
公众号申请成功以后，登录微信公众平台后台。选择左侧面板“设置”中的“微信认证”页面，然后提交微信认证申请。详细流程，请查看 
公众号微信认证流程
小程序认证
小程序申请成功后，登录微信公众平台后台。选择左侧面板“设置”，点击“基本设置”，找到”微信认证“，点击”详情“进入；若是政府、媒体、其他组织类账号，也可以从小程序发布流程页进入。详细流程，请查看 
微信小程序认证指引

认证通过取决于用户提交（补交）材料是否完整、及时，腾讯会在 15 个工作日内展开资质审核工作，用户应积极配合腾讯及第三方审核公司的审核需求。
3. 申请广告主
公众号/小程序认证完成以后，就可以正式进行广告主开户。登录微信公众平台后台后，选择左侧面板“推广”中的“广告主”，提交开通广告主功能申请，申请开通时需要关注微信广告的开放政策，具体请查看 
微信广告开放行业分类及资质
4. 开通完成
微信广告平台一般会在 2 个工作日内完成广告主开通审核与反馈，审核通过即可进入广告主功能的操作界面，开户成功。
  `,
  99: `
一个完整的投放计划由投放计划信息、对应的广告设置（如投放时间、人群定向）和广告创意组成。主要有以下 4 步：

创建投放计划
选择推广目标明确你的广告投放的营销目标，选择正确的推广目标，从而可以使用微信广告针对不同目标提供的投放解决方案。

目前微信广告提供 8
 
种推广目标，分别为：推广品牌活动、推广门店、收集销售线索、推广商品、推广应用、推广公众号、推广小游戏、推广视频号。

选择投放位置选择对应推广目标下，希望展现广告的位置。首先选择投放于朋友圈信息流或公众平台流量。

选择公众平台流量，则提供“按形态投放”和“按广告位投放”两种方式。
其中按广告位投放支持 8 个广告位，分别为公众号文章底部广告、公众号视频贴片广告、公众号文章中部广告、小程序Banner广告、小程序激励广告、小程序插屏广告、小程序封面广告、支付订单详情页广告。

不同的推广目标目前可支持的广告位对应关系如下：
推广目标
广告位
推广品牌活动
朋友圈信息流 

公众号文章底部

公众号文章视频贴片 

公众号互选广告 

公众号文章中部广告

小程序banner广告 

小程序插屏广告 

激励式广告

小程序封面广告

支付订单详情页

订阅号消息列表广告
推广门店
朋友圈信息流

公众号文章底部

支付订单详情页

订阅号消息列表广告收集销售线索
朋友圈信息流 

公众号文章底部

公众号文章视频贴片 

公众号互选广告 

公众号文章中部广告

小程序banner广告 

小程序插屏广告 

激励式广告

小程序封面广告

支付订单详情页

订阅号消息列表广告

推广商品
朋友圈信息流 

公众号文章底部

公众号文章视频贴片 

公众号文章中部广告

小程序banner广告 

小程序插屏广告 

激励式广告

小程序封面广告

支付订单详情页

订阅号消息列表广告推广应用
朋友圈信息流 

公众号文章底部

公众号文章视频贴片 

公众号文章中部广告

小程序banner广告 

小程序插屏广告 

激励式广告

小程序封面广告

支付订单详情页

订阅号消息列表广告

派发优惠券
朋友圈信息流 

公众号文章底部

小程序封面广告推广公众号
朋友圈信息流 

公众号文章底部

公众号文章视频贴片 

公众号互选广告 

公众号文章中部广告

小程序banner广告 

小程序插屏广告 

激励式广告

小程序封面广告

支付订单详情页

订阅号消息列表广告

推广小游戏
朋友圈信息流 

公众号文章底部

公众号文章视频贴片 

公众号互选广告 

公众号文章中部广告

小程序banner广告 

小程序插屏广告 

激励式广告

小程序封面广告

支付订单详情页

订阅号消息列表广告
推广视频号
朋友圈信息流 
此外按形态投放支持 4 个形态，分别为展示Banner图片、优雅横版大图、沉浸式横版视频、横版聚合格子。

选择购买方式根据你的实际情况，选择合适的购买方式。不同广告位，提供对应的购买方式和售卖策略。

命名投放计划投放计划名称旁边输入自定义投放计划名称，或使用系统默认名称。

设置广告
选择广告定向投放人群按照地域、年龄、性别、兴趣行为等标签选择定向投放广告的人群。
设置广告投放时间控制广告投放时间，与广告计划设置的购买方式有关，按曝光排期购买、按点击竞价购买、按曝光竞价购买 3 种模式下，对应不同的广告投放时间控制策略。
点击了解不同购买方式的排期时间范围

设置广告预算出价与广告计划设置的购买方式有关，按曝光排期购买、按点击竞价购买、按曝光竞价购买 3 种模式对应的广告预算及出价操作有所差异。
点击了解不同购买方式的广告预算出价详情
命名广告广告名称支持输入自定义名称或使用系统默认名称。
设置创意
选择广告样式，并填写广告样式对应所需的内容。 不同广告位所需填写的信息有所差异。
预览并提交审核
设置完成，进行广告预览，预览无误后，提交广告计划进入审核，审核通过后，即可按相应投放设置上线广告。
  `,
  100: `
  目前，微信广告提供 
  8 
  个推广目标，帮助实现你的市场营销活动。
  推广品牌活动推广你的品牌活动，扩大品牌影响力，让更多用户参与活动。支持的广告位和广告形式是：
  可投放广告位
  支持广告样式
  
  
  朋友圈信息流
  常规广告
  
  组合式卡片广告
  
  全幅广告
  
  全景广告
  
  轮播广告
  
  摇动广告
  
  滑动广告
  
  长按广告
  
  公众号文章底部
  视频式卡片
  
  大图式卡片
  
  图文式卡片
  
  图片式banner
  
  图文式banner
  
  公众号文章中部
  图片式卡片
  
  图文式卡片
  
  公众号文章视频贴片
  图片型
  
  视频型
  
  公众号互选广告
  图片型
  
  视频型
  
  小程序banner广告
  图片式banner
  
  图片名片式banner
  
  小程序激励式广告
  横屏视频
  
  竖屏视频
  
  激励浏览
  小程序插屏广告
  图片型
  小程序格子广告
  聚合格子
  推广门店推广你的本地门店，吸引周边用户到店消费。支持的广告位和广告形式有：
  可投放广告位
  支持广告样式
  
  朋友圈信息流
  常规广告
  
  组合式卡片广告
  
  公众号文章底部
  视频式卡片
  
  大图式卡片
  
  图文式卡片
  收集销售线索为用户了解你的业务提供便利，同时高效收集意向客户商机，开发潜在客户。支持的广告位和广告形式是：
  可投放广告位
  支持广告样式
  
  朋友圈信息流
  常规广告
  
  组合式卡片广告
  
  
  公众号文章底部
  视频式卡片
  
  大图式卡片
  
  图文式卡片
  
  图片式banner
  
  图文式banner
  
  公众号文章中部
  图片式卡片
  
  图文式卡片
  
  公众号文章视频贴片
  图片型
  
  视频型
  
  公众号互选广告
  图片型
  
  视频型
  小程序banner广告
  图片式banner
  
  图片名片式banner
  
  小程序激励式广告
  横屏视频
  
  竖屏视频
  
  激励浏览
  小程序插屏广告
  图片型
  小程序格子广告
  聚合格子
  推广商品推广你的线上商品，带来更多客户和订单。支持的广告位和广告形式是：
  可投放广告位
  支持广告样式
  
  朋友圈信息流
  常规广告
  
  组合式卡片广告
  
  公众号文章底部
  视频式卡片
  
  大图式卡片
  
  图片式banner
  
  标签式banner
  
  商品式banner
  
  公众号文章中部
  图片式卡片
  
  图文式卡片
  
  公众号文章视频贴片
  图片型
  
  视频型
  小程序banner广告
  图片式banner
  
  图片名片式banner
  
  小程序激励式广告
  横屏视频
  
  竖屏视频
  
  激励浏览
  小程序插屏广告
  图片型
  小程序格子广告
  聚合格子
  推广应用推广你在App Store的iOS应用或者腾讯开放平台的Android应用，吸引更多的下载、安装、激活。支持的广告位和广告形式位有：
  可投放广告位
  支持广告样式
  
  朋友圈信息流
  常规广告
  
  组合式卡片广告
  
  公众号文章底部
  视频式卡片
  
  大图式卡片
  
  图片式banner
  
  图片名片式banner
  
  文案式banner
  
  公众号文章中部
  图片式卡片
  
  图文式卡片
  
  公众号文章视频贴片
  5 秒图片广告
  
  6 秒视频广告
  
  15 秒视频广告
  
  小程序激励式广告
  横屏视频
  
  竖屏视频
  
  激励浏览
  小程序插屏广告
  图片型
  小程序格子广告
  聚合格子
  推广公众号推广你的公众号，吸引更多的关注。支持的广告位和广告形式有：
  可投放广告位
  支持广告样式
  
  朋友圈信息流
  常规广告
  
  组合式卡片广告
  
  
  公众号文章底部
  视频式卡片
  
  大图式卡片
  
  图片式banner
  
  图片名片式banner
  
  名片式banner
  
  公众号文章中部
  图片式卡片
  
  图文式卡片
  
  公众号文章视频贴片
  图片型
  
  视频型
  
  公众号互选广告
  图片型
  
  视频型
  
  小程序banner广告
  图片式banner
  
  图片名片式banner
  
  小程序激励式广告
  横屏视频
  
  竖屏视频
  
  激励浏览
  小程序插屏广告
  图片型
  小程序格子广告
  聚合格子
  推广小游戏推广你的微信小游戏，让更多用户参与活动。支持的广告位和广告形式是：
  可投放广告位
  支持广告样式
  
  朋友圈信息流
  常规广告
  
  组合式卡片广告
  
  公众号文章底部
  视频式卡片
  
  大图式卡片
  
  图文式banner
  
  图片式banner
  
  聚合格子
  
  公众号文章中部
  图片式卡片
  
  图文式卡片
  
  公众号文章视频贴片
  图片型
  
  视频型
  
  公众号互选广告
  图片型
  
  视频型
  
  小程序banner广告
  图片式banner
  
  图片名片式banner
  
  小程序激励式广告
  横屏视频
  
  竖屏视频
  
  激励浏览
  小程序插屏广告
  图片型
  小程序格子广告
  聚合格子
  推广视频号推广你的视频号，吸引更多关注、或宣传搭载于视频号上的内容、活动，让更多用户参与。目前推广视频号支持推广的类型：动态、直播、直播预约。
  推广视频号推广目标内测中，合约/竞价均可支持，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。
  推广视频号动态支持的广告位和广告形式有：
  可投放广告位
  合约支持广告样式
  竞价支持广告样式
  
  朋友圈广告
  全幅广告
  
  组合式卡片广告
  组合式卡片广告
   2.  推广视频号直播支持的广告位和广告形式有：
  可投放广告位
  合约支持广告样式
  竞价支持广告样式
  
  朋友圈广告
  全幅式卡片广告
  
  卡片式广告
  卡片式广告
  3.  推广视频号直播预约支持的广告位和广告形式有：
  可投放广告位
  合约支持广告样式
  竞价支持广告样式
  朋友圈广告
  卡片式广告
  卡片式广告
  
  
  
  
  
  本文主要介绍如何获得或创建应用的渠道包
  如何获得优量汇 Android 应用包1. 登录微信广告投放平台（mp.weixin.qq.com），进入广告主页面，找到“工具箱 - 优量汇 Android 应用包上传”
  2. 点击“优量汇 Android 应用包上传”，进入APP自助上传工具页面
  
  
  3. 阅读《腾讯广告联盟安卓应用包上传服务协议》，并点击同意进入下一步：
  
  
  4. 输入配置相关信息
  注意：投放微信广告流量，应用包名务必含有 weixin 作为名称
  
  
  5. 投放时，输入应用ID即可投放
  针对Android 应用的广告商品类型，如何获取腾讯开放平台ID1、如果你的应用已在腾讯开放平台上架，可直接登录开放平台管理系统，获取APPID
  腾讯开放平台官网：
  http://open.qq.com
  i.登录腾讯开放平台
  
  
  ii.进入“应用开放平台”- “管理中心”，查看移动应用菜单，点击需要获取的应用进入详情
  
  
  iii.进入详情后APPID如下图展示，即获取成功
  
  
  此过程遇到任何问题，可以联系开放平台的企业QQ客服：
  http://open.qq.com/support
  2、如果你的应用还未在腾讯开放平台上架，需要先进行注册并创建应用后才能获取
  腾讯开放平台官网：http://wiki.open.qq.com/wiki/%E5%88%9B%E5%BB%BA%E6%96%B0%E5%BA%94%E7%94%A8
  i. 创建应用
  若已在QQ互联创建过应用，可在创建应用时选择关联QQ互联，输入在QQ互联创建的网页应用APPID、APPKEY即可完成关联。 若未在QQ互联创建过应用，直接在此页面选择“创建应用”即可，请勿选择关联QQ互联。
  
  
  ii. 完善应用信息
  创建应用需根据应用实际，完善应用基本信息、安装包、图标素材、适配信息等，版权证明为可选项（即开发者提交的应用审核涉及需要提供相关版权证明的情况，可上传至此）
  
  iii. 提交审核
  完善应用信息并确定无误后，点击保存并提交审核，首次创建应用的开发者资质和应用信息会同步提交审核，24小时内会完成审核，审核结果请留意注册验证的邮箱和站内信消息。
  （如上传的应用不对外注册使用，则需要在应用后台的版权证明处上传测试账号和密码的截图，截图内备注：“测试账号：和密码：，即可；如应用是对外开放的，则无需填写）
  
  
  此过程遇到任何问题，可以联系开放平台的企业QQ客服：
  http://open.qq.com/support
  如何创建应用渠道包若需创建渠道包投放广告，需你的应用已在腾讯开放平台上架。
  登录腾讯开放平台官网：
  http://open.qq.com
  
  进入管理中心，查看系统支持类别，点击广告投放
  
  进入广告投放后，查看推广移动应用菜单，点击上传渠道包的上传按钮
  
  进入管理中心后，查看所需要创建渠道包的应用，点击查看按钮。
  点击会打开渠道包管理浮层，再点击添加渠道包按钮。
  填写渠道包名称、上传渠道包创建渠道包。
  *渠道包名称命名规则为应用名称-渠道，例如腾讯新闻-微信，若名称中不带有微信，将无法在广告投放时选择该渠道包投放。
  *上传渠道包建议使用Chrome浏览器，避免使用其他浏览器导致上传失败。
  
  提交后渠道包后，将会进入审核状态，审核时间约2个小时内审核完毕。
  
  渠道包审核完毕将自动上线，上线后即可在投放广告时选择投放。
  注意：若你投放渠道包广告后，在腾讯开放平台对渠道包进行更新，需要新建广告投放新更新的渠道包，否则投放的渠道包可能为旧版本。  
`,
  101: `
微信广告支持按曝光排期购买、按曝光竞价购买、按点击竞价购买和按单篇文章购买四种购买方式。
朋友圈信息流广告位和公众号文章视频贴片广告位支持曝光竞价购买，订阅号消息列表广告支持曝光竞价/曝光排期/点击竞价购买，公众号底部广告支持曝光竞价/曝光排期/点击竞价购买，公众号互选广告按照单篇文章计费，公众号文中广告支持曝光排期/点击竞价购买，小程序Banner广告支持点击竞价购买，小程序激励式广告和小程序插屏广告按曝光竞价购买，视频号原生广告支持曝光竞价/曝光排期购买。
其中，朋友圈信息流广告位，
电商推广广告（即推广目标为：推广我的商品）仅支持 按曝光竞价购买
。除电商推广广告外，其他朋友圈图文/视频广告均支持排期购买和竞价购买。
四种购买方式所对应的曝光单价与服务标准如下：
1. 按曝光排期购买
提前预定未来目标人群的广告展现机会，冻结对应广告金额，最终按照实际曝光情况结算广告费用。
目前
朋友圈信息流、订阅号消息列表、公众号文章底部、公众号文章视频贴片、公众号文章中部、小程序Banner、小程序插屏、支付订单详情页、视频号原生广告 
8个广告位支持按曝光量排期购买。详细售卖策略如下：
  广告位
售卖门槛
售卖定价
排期时间范围



朋友圈信息流



单次广告投放预算 
5
 万元起
按千次曝光定价，由投放地域和广告创意外层媒体类型共同决定

外层视频创意

核心城市：180 元/千次曝光

重点城市：120 元/千次曝光

其他城市：60 元/千次曝光

外层图片创意

核心城市：150 元/千次曝光

重点城市：100 元/千次曝光

其他城市：50 元/千次曝光


投放开始时间：未来1~28个自然日

投放持续时间：12小时~6个自然日（限时推广为4-6小时）




订阅号消息列表




单次广告投放预算 
1000
 元起
按千次曝光定价，由投放地域和广告创意外层媒体类型共同决定。
非视频样式
核心城市：40 元/千次曝光
重点城市：35 元/千次曝光
其他城市：30 元/千次曝光
视频样式
核心城市：45 元/千次曝光
重点城市：40 元/千次曝光
其他城市：35 元/千次曝光




投放开始时间：未来1~28个自然日
投放持续时间：3~30个自然日




公众号文章底部




单次广告投放预算 
1000
 元起
按千次曝光定价，由投放地域决定。


外层视频创意

核心城市：40 元/千次曝光

重点城市：35 元/千次曝光

其他城市：30 元/千次曝光


外层图片创意

核心城市：35 元/千次曝光

重点城市：30 元/千次曝光

其他城市：25 元/千次曝光



投放开始时间：未来1~28个自然日

投放持续时间：12小时~28个自然日


公众号文章中部


单次广告投放预算 
1000
 元起
按千次曝光定价，由投放地域决定。

核心城市：25 元/千次曝光

重点城市：20 元/千次曝光

其他城市：15 元/千次曝光

投放开始时间：未来1~28个自然日

投放持续时间：12小时~28个自然日


小程序banner


单次广告投放预算 
1000
 元起
按千次曝光定价，由投放地域决定。


核心城市：25 元/千次曝光

重点城市：20 元/千次曝光

其他城市：15 元/千次曝光

投放开始时间：未来1~28个自然日

投放持续时间：12小时~28个自然日


小程序插屏


单次广告投放预算 
1000
 元起
按千次曝光定价，由投放地域决定。


核心城市：70 元/千次曝光

重点城市：65 元/千次曝光

其他城市：60 元/千次曝光

投放开始时间：未来1~28个自然日

投放持续时间：12小时~28个自然日




支付订单详情页




单次广告投放预算 
1000
 元起
按千次曝光定价，由投放地域决定。


外层视频创意

核心城市：45 元/千次曝光

重点城市：40 元/千次曝光

其他城市：35 元/千次曝光


外层图片创意

核心城市：40 元/千次曝光

重点城市：35 元/千次曝光

其他城市：30 元/千次曝光



投放开始时间：未来1~28个自然日

投放持续时间：12小时~28个自然日

视频号原生广告

单次广告投放预算 
5
 万元起
按千次曝光定价，由投放地域决定。
核心城市：100 元/千次曝光
重点城市：75 元/千次曝光
其他城市：50 元/千次曝光

投放开始时间：未来1~28个自然日
投放持续时间：1~15个自然日
备注说明
核心城市：包含北京和上海。
重点城市：包含广州、成都、深圳、杭州、武汉、苏州、重庆、南京、天津、西安、沈阳、长沙、青岛、宁波、郑州、大连、厦门、济南、哈尔滨、福州等 20 个高活跃城市。
其他城市：包含除以上22个城市之外的其他城市。
2. 按曝光竞价购买
灵活设置目标人群和广告投放时间，通过调整广告曝光单价和设计优质广告创意，与其他客户竞争广告展现机会，根据广告表现最大程度提升广告效果。
目前
朋友圈信息流
、
订阅号消息列表、公众号文章底部
、
公众号文章视频贴片
、
小程序激励式广告
、
小程序插屏广告、小程序封面广告、视频号原生广告
8个广告位支持按曝光竞价购买。详细售卖策略如下：
广告位
售卖门槛
竞价范围
排期时间范围
朋友圈信息流
每日广告预算 
50
 元起
按千次曝光出价，出价范围 1.5~999 元/千次曝光。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~60自然日
订阅号消息列表
每日广告预算 
50
 元起
按千次曝光出价，出价范围 0.01~20000元/千次曝光。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~60自然日
公众号文章底部
每日广告预算 
50
 元起
视频按千次曝光出价，出价范围 1.5~999 元/千次曝光。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
公众号文章视频贴片
每日广告预算 
50
 元起
按千次曝光出价，出价范围 1.5~999 元/千次曝光。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
小程序激励式广告
每日广告预算 
50
 元起
按千次曝光出价，出价范围 1.5~999 元/千次曝光。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
小程序插屏广告
每日广告预算 
50
 元起
按千次曝光出价，出价范围 1.5~999 元/千次曝光。

投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
小程序封面广告
每日广告预算 
50
 元起
按千次曝光出价，出价范围 1.5~999 元/千次曝光。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
视频号原生广告
每日广告预算 
50
 元起
按千次曝光出价，出价范围 0.01~20000 元/千次曝光。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限

3. 按点击竞价购买
灵活设置目标人群和广告投放时间，通过调整广告点击单价和设计优质广告创意，与其他客户竞争广告展现机会，根据广告表现最大程度提升广告效果。
目前
订阅号消息列表、公众号文章底部
、
公众号文章中部
、
小程序Banner广告
和
小程序格子广告
支持按点击竞价购买。详细售卖策略如下：
广告位
售卖门槛
售卖定价
排期时间范围
订阅号消息列表
每日广告预算 
50
 元起
按每次点击出价，最低出价 0.1 元。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
公众号文章底部
每日广告预算 
50
 元起
图片按每次点击出价，最低出价 0.1 元。
投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
公众号文章中部
每日广告预算 
50
 元起
按每次点击出价，最低出价 0.1 元。

投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
小程序Banner广告
每日广告预算 
50
 元起
按每次点击出价，最低出价 0.1 元。

投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
小程序格子广告
每日广告预算 
50
 元起
按每次点击出价，最低出价 0.1 元。

投放开始时间：最早开始时间当日

投放持续时间：0.5小时~不限
4. 按单篇文章购买
互选广告
按文章收费，文章价格由流量主自主决定。
`,
  102: `
微信广告支持丰富的人群定向能力，广告主可根据自身营销诉求在广告投放过程中进行设置。
地域1.常住地（国内）
定向近一个月常住国内的用户群体，支持按省、市、区等不同地域精度进行投放
2. 差旅出行（境内）
朋友圈竞价购买广告，朋友圈广告位开放的所有行业，投放给正在国内旅行或出差用户群体。
受众属性人口属性
选择希望哪一范围的受众（性别、年龄区间、学历等）看到你的广告。
偏好兴趣：长期对某类事情有兴趣的用户群体。
行为：在特定场景发生过相关行为的用户群体。
选择希望可能喜欢或购买哪一类产品或服务的受众看到你的广告。 
同时选用兴趣和行为标签时，两者为“或”关系，即取并集。
 你可根据自身的投放诉求和一方数据分析具体的兴趣行为标签人群进行投放。
2022年6月30日起，兴趣、行为将在竞价场景下线，仅支持合约场景进行投放。
手机设备1. 操作系统
希望向哪一类操作系统展示你的广告。
2. 联网环境
希望在哪一类网络环境下展示你的广告。
3. 设备价格
希望在哪一类设备价格段的展示你的广告。
4. 设备机型
希望你的广告适配到哪一类设备机型。
5. 运营商
希望你的广告适配到哪一类运营商网络。
再营销/排除营销再营销/排除营销
选择向与你的业务有过关联的用户群体投放/不投放广告，持续影响真正对你感兴趣的用户群体，包括：
当前关注你公众号的粉丝及最近一个月内取消关注你公众号的粉丝；
当前已安装你应用的用户群体（目前仅支持 Android 下载）；
最近1年曾领取微信广告卡券的用户群体和最近1年对你的广告感兴趣的用户群体（包括公众号与朋友圈广告位，点击广告、广告详情页、对朋友圈广告点赞行为用户群体）。

例如：最近1年对你的广告感兴趣的用户群体，包括曾点击朋友圈/公众号广告、查看广告详情页、对朋友圈广告点赞行为用户群体。
媒体类型媒体类型
广告主在投放公众号底部广告/文中广告/视频贴片广告/公众号互选广告的过程中，平台按照流量主媒体近期发布的文章和运营内容进行分类：  
优质流量主分类包括生活文学、乐活、影视娱乐、潮流时尚、运动健康、科技互选网、新闻资讯、教育培训、金融房产、汽车、餐饮美食、休闲娱乐、商务服务、旅游、母婴育儿、游戏、家居装修、其他等共19个媒体标签。
自定义人群人群包定向能力，帮助客户对目标用户群做圈定推广。当客户已经有了目标广告用户群体的号码包，可上传形成人群包，在广告投放环节进行定向投放；也可使用强大的智能拓展（Lookalike）能力，帮助广告主对已有人群做相似拓展，获得量级更大的人群包。
2022年6月30日起，腾讯广告知数能力升级。竞价场景下，投放端仅支持并拉取“支持竞价投放”的人群包，供客户进行竞价广告的投放。
（关于“不支持竞价投放”的人群类型，可参考：https://docs.qq.com/sheet/DRURueWZVQWZoRE9B?tab=BB08J2，或咨询您的行业运营接口同学）
自定义人群
在广告创建的定向环节，可选择自定义人群功能，使用人群包做定向和排除营销
人群包之间：定向人群与排除定向人群选择互斥；
人群与基础定向：广告投放取自定义人群包内用户与基础定向的交集。
人群管理
可以在人群管理页，新建上传人群包，以及对已有人群包做管理和删除操作。
新建上传人群，支持多种数据格式，文件格式只支持txt，最大支持 1G 上传，文件内容仅支持英文与数字及横线，每行只能有一个数据，不能包含空格及其他字符。
`,
  103: `
本文介绍了投放管理中的基础管理部分，包括查询、修改、复制、删除、设置自定义数据项、白名单投放等。
查询你可以在投放管理-公众号，朋友圈或小程序广告管理页面，查询已创建的投放计划或广告。
按名称或ID查询：在投放计划/广告列表上方的搜索框中，输入名称（关键词）或ID，点击搜索 icon 或按回车键，可以查询特定的投放计划/广告。
按筛选条件查询：在投放计划/广告列表中，选择不同的推广目标、购买类型或广告位，可以筛选相应的投放计划/广告。
修改竞价广告：
公众号、小程序竞价广告在上线前、投放中或暂停后，支持随时修改定向、预算、出价、创意等信息，如果修改创意内容，广告将进入审核流程。朋友圈竞价广告在上线前支持随时修改，上线后可以修改定向、预算和出价等信息，不支持修改创意（广告上线后，收到广告的用户可能在朋友圈与广告产生点赞、评论等互动，修改创意后，可能会导致广告内容与用户互动意愿或内容不符，影响微信用户体验）。
在投放计划/广告详情页，点击“修改”，即可进入修改流程。
支持修改投放计划名称、人群定向、投放时间、预算、出价、广告位、创意及落地页。 
在投放计划/广告列表，点击“编辑”的 icon，可快捷修改广告名称、投放状态、投放时间或出价。
投放设置如投放时间、投放人群、每日预算修改后，即时生效，无需重新审核。
广告创意如外层素材、落地页修改提交后，将重新进入审核环节。
投放中广告支持暂停投放，暂停后由于曝光扣费存在一定的延迟，账户可能会在一段时间内产生持续扣费。
修改预算时，对于公众号文章底部、公众号文章总部和小程序CPC竞价广告，修改预算幅度至少50元，修改后的预算不得少于（已消耗金额+50）元；对于公众号视频前贴片竞价广告，调高预算时，修改幅度不能低于100元；调低预算时，修改后的预算金额不得小于该广告已消耗的金额的1.5倍。对于朋友圈竞价广告，调高预算时，修改幅度不能低于100元；调低预算时，修改后的预算金额不得小于该广告已消耗的金额的1.5倍。
特别注意
：为保证广告正常上线，建议在广告审核通过后，尽量减少广告修改。
排期广告：
朋友圈及公众号、小程序排期广告在上线前，支持随时修改定向、预算、出价、创意等信息；广告上线后，不支持修改。
广告上线前，广告主可在投放计划/广告详情页，点击“修改”，进入修改流程。支持修改投放计划名称、人群定向、投放时间、预算、广告位、创意及落地页。
投放计划名称、投放时间、定向条件和出价修改后即时生效，且无需再审核。
广告创意中外层素材和落地页如素材图片、文字、推广链接等内容修改提交后，将重新进入审核环节。审核通过后，广告方可上线投放。
特别注意
：合约广告完成锁量后，若多次临时取消排期导致锁定预算未投放，系统将自动识别并实时评估你的广告合作信用；平台将视情节恶劣程度酌情采取相应惩处措施，建议你确认投放计划后进行锁量操作，并合理安排广告投放。
复制在投放计划/广告列表，点击任一投放计划/广告后的“复制”，即可复制一个相同的投放计划/广告，你可以根据需要进行修改，实现快捷创建。
删除在投放计划详情页面，点击“删除计划”即可删除整个投放计划（包括该投放计划下所有广告及创意）。在投放中的投放计划及已锁量的排期广告不支持删除，投放计划一旦删除无法恢复，请谨慎操作。  
在广告详情页面，点击“删除广告”即可删除该广告。在投放中的广告不支持删除，广告一旦删除无法恢复，请谨慎操作。
设置自定义数据项在投放计划/广告列表页面，你可以通过自定义设置查看相应的广告数据。    
点击“自定义报表”进入自定义数据项设置界面，根据需要勾选数据项，点击“确定”即可在投放计划/广告列表中查看相应的数据。  
投放计划和广告列表的自定义数据项设置互不关联。
白名单投放广告通过审核后，进入“待投放”环节，最多可支持配置50个白名单用户，白名单内用户在上线后可收取到该条广告。
广告主须输入白名单用户的微信号（注意大小写），不支持手机号、QQ号，且白名单用户需关注投放广告的公众号。
设置白名单投放提交后，不支持修改&剔除。
`,
  104: `
为了让优化师可以在下班/周末等非坐班时间，减轻盯盘压力，推出托管助手功能；
它可以帮助你，监控和发现广告帐户的“帐户余额，问题广告，潜力广告"，实现管理“帐户余额/发现问题广告帮助及时止损/发现潜力广告帮助提升获量”的目标；
设置托管后，当系统发现上述情况时，会通过消息推送，在微信上通知到绑定微信号

一.功能入口：
1.微信广告投放平台（mp.weixin.qq.com）广告主端
投放管理-托管助手（广告主端的规则最全）


2.服务商系统
客户管理-投放广告

二.已支持规则
1.自定义托管规则
监控环节
价值
托管规则
具体逻辑
帐户
问题发现
帐户可用余额
可用余额少于多少时提醒
广告跑量
潜力挖掘
广告消耗速度
前1小时花费超过多少时提醒
广告跑量
潜力挖掘
广告曝光速度
前1小时曝光量超过多少时提醒
广告跑量
潜力挖掘
广告出价潜力
可通过提出价来提曝光时提醒
广告跑量
问题发现
广告即将结束
距投放结束日期还有几天时提醒
广告跑量
问题发现
广告余额
花费接近预算，预算不足时提醒
广告跑量
问题发现
广告日花费
广告当日花费超过多少时提醒
广告转化
问题发现
广告成本波动
转化目标成本高于出价多少时提醒
广告转化
问题发现
广告转化率
目标转化率过低时提醒
2.基础规则
除了上述自定义的智能托管，有一些平台推荐的基础托管规则，也推荐你订阅
规则类型
规则介绍
推送频率（默认）
广告主日报
可接收广告主的花费、曝光、点击等基础数据，每天推送一次
24小时一次
余额提醒
余额即将耗尽-影响广告投放的时候收到提醒，每天最多推送一次
24小时一次
智能优化赔付到账通知
智能优化赔付到账后将及时推送到账消息，每天最多推送一次
24小时一次
朋友圈广告审核
实时接收朋友圈广告审核消息
实时
广告优化建议
智能诊断公众号广告投放情况并给出指导建议，每条广告只推送一次
24小时一次
公众号广告审核
实时接收公众号广告审核消息
实时
免责声明
因网络波动、系统任务量变化等原因，系统对账户和广告的检查以及通知有极小概率会出现延迟或错误，为了避免损失，你仍然需要密切留意广告的表现符合营销诉求。
`,
  105: `
在广告投放过程中， 你可登录微信公众平台，点击“广告主”—“投放管理”，查看广告投放的效果数据实时报表。
选择“投放计划/广告”不同的数据层级，支持自定义设置数据项和时间段，查看该层级的效果数据。

除了基础的预算消耗、曝光类数据外，该报表支持自定义查看100多项数据指标，覆盖“品牌触达—用户互动—效果转化”全链路数据指标。
你可根据使用场景，选择查看费用类、曝光类、点击类、互动类、转化类、传播类、负反馈等各类数据指标（参见下图）。

你也可以通过API，获取到在微信广告投放的广告数据，实现自主分析。详见指引文档
1.获取内容
广告指标数据，销售线索
2.获取方式：目前一共有2套api，可以获取到不同投放方式创建的广告数据
备注：后续新增迭代，主要在mkt api上进行迭代。为了保证服务质量
（1）新接入客户：建议优先选择mkt api；
（2）已接入open api的客户：也建议逐步迁移至mkt api。
API名称
可获取到数据的范围
指引文档
MKT API（
推荐
）
1.自助投放端提交的广告（全量）；2.OPEN / MKT API投放的广告（全量）
点击查看
OPEN API
1.自助投放端提交的广告（全量）；2.OPEN API投放的广告（全量）
1.
广告主账号获取
 2.
服务商账号获取
3.历史数据：可获取到1年内的历史数据
转化目标-指标组为：推广目标转化目标-指标组和智能优化转化目标-指标组的合并
当广告为智能优化广告时，"转化目标组"指标，即为"智能优化转化目标组"指标;
当广告为非智能优化广告（合约，cpc，cpm）时，"转化目标组"指标，即为"推广目标转化目标组";
"推广目标转化目标组"和"智能优化转化目标组"：即将于10月17日下线。
转化目标-指标组
转化目标：该条广告对应的转化指标名
当广告为智能优化广告时，为广告主自主选择的转化目标对应指标
当广告为非智能优化广告（合约，cpc，cpm）时，为建议观察的转化指标
转化目标量：转化目标指标，对应的具体数量
转化目标成本（元）：产生一次广告转化的平均费用。计算逻辑=广告花费/转化目标量。
目标转化率
朋友圈流量位：转化目标量/可转化点击次数。
公众号流量位：转化目标量/点击次数。
转化目标：针对不同类型广告，代表的指标

深度转化目标-指标组
深度转化目标：该条广告，广告主自主选择的深度转化目标
深度转化目标量：深度转化目标指标，对应的具体数量
深度转化目标成本（元）：产生一次深度广告转化的平均费用。计算逻辑=广告花费/转化目标量。
深度目标转化率
朋友圈：深度转化目标量/可转化点击次数。 公众号：深度转化目标量/点击次数。
推广目标转化指标-指标组
当广告为非智能优化广告（合约，cpc，cpm）时，可观察"推广目标转化指标"。
这是平台建议观察的转化指标，转化指标定义与推广目标相关
1.推广我的公众号：公众号关注次数
2.推广品牌活动：无推广目标转化指标
3.推广我的应用（iOS）：APP激活次数
4.推广我的应用（Android）：安装完成量
5.推广我的商品：下单量
6.收集销售线索：销售线索量
7.推广我的小游戏：小游戏注册人数
随着行业和智能优化能力的增加，广告需观察的转化指标在不断增多。为了提升广告主分析效率，即将上线‘转化目标’指标组。同时，不同类型的广告涉及的转化指标可以直观看到指标名和数值。
为了帮助广告主了解，选择兴趣定向后的效果，现提供「兴趣分布」报表功能
功能价值：帮助客户，分析到转化率更高/获客成本更低的兴趣标签，辅助定向投放。低成本获取高质量用户
一.详细介绍
 
1.入口：入口=微信广告投放平台（mp.weixin.qq.com）自助投放端，数据报告-用户分布

2.数据时间：兴趣分布的数据查看，提供2019/7/26日（含）后的数据
3.目前支持数据指标：点击率，点击均价（元），目标转化率，转化目标成本，深度目标转化率，深度转化目标成本，APP下载完成成本（元）
4.只展示广告勾选的兴趣-对应的数据效果：避免下列情况 （1）.数据分析失焦：因为单个用户会包含多个兴趣标签，展示所有兴趣，会导致广泛兴趣会出现在所有广告； （2）.数据误解：客户勾选了兴趣a进行投放，发现定向外兴趣b 转化率很高，但其实底层逻辑，数据代表的是 ‘兴趣a与兴趣b交集用户的转化率’
`,
  106: `
目前微信广告为朋友圈排期购买的广告及单次广告投放金额在5万元以上的公众号互选广告提供结案报告，公众号排期广告暂无结案报告。
在排期广告投放完成后，你可登录微信公众平台广告主页面，在“投放管理”—“投放计划”层级下，点击已投放结束的推广计划，即可在右上角看到“查看报告”的入口。
报告包括了合约广告在投放期间的全部效果数据，并会在投放结束后一天完成数据计算，投放结束后第三天早上8点推送至广告主的投放页面。

如1月1日广告计划投放结束，1月3日早上8点将收到结案报告推送。
报告分为7个数据模块，全方位解读广告投放数据效果：
广告触达：洞悉广告对目标人群的覆盖情况，包括曝光量、触达用户数、触达次数，以及扣费曝光、赠送曝光的比例。
用户停留：了解用户愿意花多长时间了解你的品牌，包括用户在广告的平均停留时长及分布情况。
点击互动：用户在广告的互动行为表现，包括点赞、评论、点击素材、头像昵称等点击和互动数据。
视频播放：广告视频的播放情况，包括用户在短视频、完整视频的观看数据、及观看时长分布。
社交传播：了解多少人主动分享了你的广告，以及分享后为品牌带来的增值曝光。
用户洞察：了解广告曝光用户、点击用户、互动用户的画像特征，洞悉什么样的用户对您的广告更感兴趣。 
明细数据：可下载明细excel，分析不同广告组合的投放效果。
报告模版示例如下如下（数字部分为样例，不具备参考意义）

`,
  229: `
使用须知
特别说明
『获取点击数据』能力升级，不再兼容 APP-Open API 方案一，请使用
APP-Open MKT API
进行转化数据回传。
旧版『获取点击转发能力』与 APP-Open API 方案一 计划于10月底全面停止使用。 
近期仍可通过修改链接的方式使用旧版『获取点击数据』能力。
使用方式
：进入『获取点击数据』页面，将页面链接中『conversion_v2』替换为『conversion』

价值
在
微信广告投放平台
推广APP/H5/小程序时，用户下载APP/进入H5或小程序中会产生对应的转化行为（如下单、资料收集等）。广告主接入转化跟踪能力，回传用户的转化行为后，可以实现2个价值：
量化广告的转化效果
接入转化跟踪的推广对象，转化数据可以被量化并呈现在数据报表中

获得智能优化（oCPM/oCPA）的使用权限
转化数据积累后，可以帮助广告主获得使用
智能优化
（oCPM/oCPA）的能力

原理说明
（一）用户点击广告之后，通过广告进入落地页，发生相应的转化行为，广告主可以获取发生转化行为的用户。
例如：
1）
APP激活
：下载安装并激活对应APP后，APP可以获取用户手机的设备号信息，如Android的IMEI、iOS的IDFA信息，设备号信息作为广告主与广告平台共同使用的用户标识；
2）
H5电商下单
在落地页购买商品或填写相应表单，落地页可以获取该用户的点击ID（clickid），作为广告主与广告平台共同使用的用户标识；
（二）回传转化数据时，需要回传转化行为与对应的用户标识，广告平台会通过用户标识关联到该次转化对应的广告点击，从而得到广告点击与广告后端转化的关联。
（三）关联后计算的广告效果会呈现在
微信广告投放平台
报表中，并会成为智能优化的数据基础。
回传方式
转化行为数据的回传复用了DMP行为数据回传能力，广告主可以通过以下回传方式回传转化数据：
行为发生环境
回传方式
说明
APP
APP-SDK
app回传的推荐方式
：对接简单，回传稳定，不易出问题；

备注：接入后的版本数据，才可回传。
APP
APP-Open MKT API
优点：不依赖客户端版本覆盖，回传可随时调整；

缺点：没有sdk方式回传稳定
H5
H5-JS
对接简单，回传稳定，不易出问题
H5
H5-Open MKT API
回传可控，方便随时调整
小程序
小程序广告接入
小程序作为电商或销售线索推广落地页，即时转化后回传转化数据
小程序
小程序广告接入-腾讯有数SDK
小程序作为电商或销售线索推广落地页，即时转化后回传转化数据
小游戏
小游戏-Open MKT API
小游戏作为推广目标，即时转化后回传转化数据。（'小游戏注册人数'，默认使用平台数据，不需回传)
公众号
公众号-Open MKT API
公众号作为推广目标，关注公众号，然后在公众号推送的小程序或网页中发生转化后，回传转化数据。
特别说明
1、系统通用
：A账号回传的转化数据，以及通过广点通账号回传的转化数据，会根据转化归因逻辑，匹配对应的广告数据。因此A账号回传的转化数据可能会归因到B、C等账号，符合归因预期逻辑。
2、避免重复回传
：由于系统通用，请务必关注，转化数据通过以上各种方式各种账号回传到广点通或微信广告系统中，每条数据只需要回传一次即可。
重复回传可能导致转化量偏高，oCPM成本异常。
一、API方案介绍
在
微信广告投放平台
推广小游戏时，用户进入小游戏之后会产生对应的行为（如注册、付费等），
为了量化小游戏广告用户的转化效果，需要回传用户的转化行为。本API解决的是小游戏内用户行为回传的问题。
说明：

1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读；

2）联调时，请以回传示例格式为准，确保联调正常；
使用须知
（一） 对接流程简介

特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调，小游戏和游戏类小程序无法调用联调。


1.
对于广告主账号与所推广的小游戏为同公司/个人主体时
：在微信公众平台的『开发』—『基本配置』中注册成为开发者；
2.
对于广告主账号与所推广的小游戏为不同公司/个人主体时
：需要先
通过跨主体回传功能获取小游戏账号授权
，即回传的广告主账号需要获取小游戏账号的授权。详见授权操作说明；
3.创建转化数据对应的数据源；
4.获取用户openid，根据转化行为、推广目标，选择对应的行为类型回传数据，构造请求回传数据至对应的行为源，需要确保回传成功；
5.例行化：确保线上实际投放时，用户发生转化后，会自动实时运行步骤2，调用API回传数据，并回传成功；
6.验证：判断步骤4是否正常运行；
注：对于二次接入本API的广告主账号，可以跳过1、2步骤；
建议对接人员：建议后台开发同学对接本API；

(二) 问题咨询流程

开发过程中遇到任何问题可以参考以下流程解决
1.查看
本文底部特别关注
或【行为数据回传附录-常见问题解答】是否有相应说明；
2.根据【行为数据回传附录-返回码】，查询是否有相关说明，如果未检索到对应内容，访问公众平台开发者文档再次查询；
3.参见【行为数据回传附录-问题咨询流程】对接人工客服；
使用背景
目前支持的行为类型以及对应的智能投放优化目标、数据指标如下：
行为名称
ActionType
推广目标
数据指标
说明
付费
PURCHASE
推广小游戏
小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为
次留
START_APP
推广小游戏
小游戏次留人数
用户首次进入小游戏后，次日再次进入小游戏


关键页面访问



推广小游戏


停留大于30s人数
关键页面访问
在“推广我的小游戏“下
转化定义为注册用户停留大于30s，数据由小游戏平台上报，
无需广告主回传
 。
小游戏创角
CREATE_ROLE
推广小游戏
小游戏创角人数
广告主自定义的小游戏内角色创建行为
付费
PURCHASE
推广小游戏
小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为
原理介绍
（一）对于小程序/小游戏的用户，每个用户都会生成一个openid，将openid与小程序appid作为转化数据的标识之一回传广告平台。
（二）广告平台会通过openid和appid关联到之前投放的小程序/小游戏广告，从而得到用户行为与推广广告的关联。
（三）关联后计算的广告效果会呈现在
微信广告投放平台
报表中，并会成为后续智能优化的数据基础。
二、对接步骤
概览
1、准备阶段
1)注册成为开发者；
2)创建数据源，获取存储数据的数据源ID；
2、正式对接
1）获取用户openid；
2）确定行为类型；
3）获取创建时存储的数据源ID
4）构造请求回传数据，需要确保回传成功；
3、例行化
确保线上实际投放时，用户发生转化后，会自动实时运行『2;、正式对接』
4、验证
调用API回传数据，并回传成功；
准备阶段：成为公众平台开发者，创建数据源（一） 注册成为开发者
目标：获取开发者ID、密码和access_token
步骤：
特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调。
对于非同主体广告主账号：
用于回传数据的广告主账号需要先通过跨主体回传功能获取小游戏账号授权（即回传的广告主账号需要获取小游戏账号的授权）。
注：小游戏需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
 2. 进行授权，详见
授权操作流程
 3. 点击左边栏，『开发』下『开发配置』，获取AppSecret；
 4. 参考说明文档获取
access_token
对于同主体广告主账号：
1. 进入
注册页面
，点击左边栏，『开发』下『基本配置』。同意《微信公众平台开发者服务协议》后，点击『成为开发者』；

2. 获取开发者密码。点击“重置”按钮：

3. 弹窗提示，点击“确定重置”按钮：

4. 点击“开始”按钮：

5. 选择验证方式进行验证：

6. 验证完成之后扫码绑定微信号，绑定成功后重置开发者密码。然后微信上点击确认，进行第二步密码验证：

7. 密码验证后，即可查看开发者密码。由于开发者密码不会直接显示在MP后台，因此需要开发者保存。开发者密码为重要账号凭据，建议不要外传。

8. 获取access_token。在开发——基本配置中点击“获取access_token”,用之前注册的开发者id和生成的开发者密码调用接口获取access_token。

（二） 创建数据源
目标：创建数据源，生成数据源ID（user_action_set_id） 步骤：
构造请求，创建数据源；
保存数据源ID，用于后续回传数据；
请求地址： user_action_sets/add
请求方法： POST
请求参数：
名称
类型
描述
Type
enum
用户行为源类型，『WECHAT_MINI_GAME』
Name
string
用户行为源名称，必填
description
string
用户行为源描述，字段长度最小 1 字节，长度最大 128 字节
wechat_app_id
string
小程序/小游戏对应的appid

特别关注：需要填写被推广的小游戏的appid
请求示例：
curl "https://api.weixin.qq.com/marketing/user_action_sets/add?version=v1.0&access_token=<ACCE
SS_TOKEN>"\
-H 'Content-Type: application/json' \
-d '{
    "type": "WECHAT_MINI_GAME",
    "wechat_app_id": "<WECHAT_APP_ID>",
    "name": "webuser_action_set",
    "description": ""
}'
应答字段：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口] 创建用户行为源时分配的唯一 id
应答示例：
{
"errcode":0, "
"errmsg":""
"data": {
	"user_action_set_id": "<USER_ACTION_SET_ID>"
	}
}
正式对接：获取openid，并进行加密，确定行为类型，回传数据（一） 获取用户openid
目标
：获取访问小游戏用户的openid，作为回传数据的用户标识；
步骤
：
1.获取用户openid，详见
openid获取说明
2.用户发生转化时，记录发生转化的openid；
（二） 确定行为类型
目标
：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型； 
步骤
： 根据以下建议，确认后续API回传时需要填写的Action_Type：
行为名称
ActionType
推广目标
数据指标
说明


付费


PURCHASE


推广小游戏

小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为，回传金额时，单位为“分”。例如充值6元，则回传“600”

次留

START_APP

推广小游戏

小游戏次留人数
用户首次进入小游戏后，次日再次进入小游戏

关键页面访问

VIEW_CONTENT

推广小游戏

停留大于30s人数
关键页面访问
在“推广我的小游戏“下
转化定义为注册用户停留大于30s，数据由小游戏平台上报，
无需广告主回传
 。
小游戏创角
CREATE_ROLE
推广小游戏
小游戏创角人数
广告主自定义的小游戏内角色创建行为
（三）回传数据
目标
：根据openid、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
步骤
：
1. 前提 在传入转化行为数据之前，请确保开发者已经：
注册成为开发者，并获取了可用的在有效期内的token
已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见附录；

2. 确认上报数据字段，参数说明如下：
名称
类型
必填
限制
说明
user_action_set_id
integer
yes

用于标识数据归属权。


url


string


yes

转化行为发生页面的URL，小游戏需要在页面路径前增加『http://www.』， 或直接填写 『http://www.qq.com』

校验逻辑：

1.以『http://www.』 开头；

2.必须为纯小写；

3.必须包含『.』


action_time


integer


yes

行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，
UNIX时间，单位为秒，长度为10位。

如果不填将使用服务端时间填写
action_type
enum
yes

预定义的行为类型，详见上方ActionType定义
openid
string
yes

根据获取到的openid，为28位字符
wechat_app_id

公众号appid
string
yes

生成该openid对应的账号appid，详见
openid获取说明




outer_action_id




string




no

去重标识，平台会基于user_action_set_id，outer_action_id 和action_type三个字段做去重 。

如果历史上报数据中存在某条数据的这三个字段与当前上报数据完全一样的，则当前数据会被过滤掉。

注：字段长度最小1字节，最大长度255字节，且只能为数字，字母，下划线，连接符组成。
action_param
string
no



value

Int

no

代表订单金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000
length_of_stay
Int
no
回传次留必填
Actiontype= START_APP时必填，赋值为1

source

string

Yes

转化数据发生的渠道：

1)Biz，代表公众号内各种服务或网页

2)Web，代表非公众号的其他渠道

归因方式claim_type

integer

Yes

归因方式：

0）按点击行为归因

1）按关注行为归因

小游戏归因时，选择0）点击行为归因；
 3. 调用API，回传数据 示例：需要统计“进入小游戏”的转化行为，开发者只需要在进入小游戏转化行为发生时，上报action_type=“PURCHASE”，且附上获取的 openid。
回传付费请求示例：
curl -k 'https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>"
-d  '{
           	"user_action_set_id": "<USER_ACTION_SET_ID>",
		"actions":[
                           	{
                           		"url":"<URL>",
                           		"action_time":1513077790,
                           		"action_type":"PURCHASE",
                           		"user_id":{
                                          	  "wechat_app_id":"<WECHAT_APP_ID>",
                                          	 "wechat_openid":"<WECHAT_OPEN_ID>"
                                 	},
                           		"action_param":{
                                          	"claim_type":0,
					"source":"Web",
					"value": <purchase_value>
                           		}
                           	}
                        	]
  	}'
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
回传次留请求示例：
curl -k 'https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>"
-d  '{
           	"user_action_set_id": "<USER_ACTION_SET_ID>",
		"actions":[
                           	{
                           		"url":"<URL>",
                           		"action_time":1513077790,
                           		"action_type":"START_APP",
                           		"user_id":{
                                          	  "wechat_app_id":"<WECHAT_APP_ID>",
                                          	 "wechat_openid":"<WECHAT_OPEN_ID>"
                                 	},
                           		"action_param":{					
"length_of_stay": 1,
                                          	 "claim_type":0,
					"source":"Web",
                           		}
                           	}
                        	]
  	}'
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，请使用【
行为数据回传附录
】进行排查
例行化：确保线上实际投放时，用户发生转化后，会自动实时运行第2步[正式对接]（一）确保广告实际投放中，用户发生转化后，步骤四能够正常运行，自动获取用户的openid，并通过API回传到广告系统中。
（二）增加API数据回传日志，记录每次调用API回传的内容以及API应答信息，方便后续排查问题
验证：自行验证，上线验证调用API回传数据，并回传成功；
（一)自行验证
确保模拟数据回传API应答正确；

（二)上线验证
创建广告；
正常投放；
确认API数据回传日志，有数据回传且应答信息正确； 无日志可以根据【
行为数据回传附录
-数据源报表查询】，根据raw_action_count是否有值，判断是否成功传入了行为数据；
访问MP投放端报表，数据指标是否有相应的数值显示；
行为名称
ActionType
推广目标
数据指标
说明
付费
PURCHASE
推广小游戏
小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为
次留
START_APP
推广小游戏
小游戏次留人数
用户首次进入小游戏后，次日再次进入小游戏
特别关注

errcode:900351001,errmsg:'wechat open id fetch error'openid无法识别，请确保回传账号已获取openid对应账号的授权。
用于回传数据的广告主账号需要先通过跨主体回传功能获取小游戏账号授权
回传数据的账号为发起授权方，一般为广告主账号；
openid生产方，为接收授权方，一般为小游戏/小程序/公众号等；
注：
1.小游戏需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
2.进行授权，详见
授权操作流程
3.点击左边栏，『开发』下『开发配置』，获取AppSecret；
4.获取
access_token
回传成功，无法归因，投放端报表无数据展示请再次确认数据源对应的appid与推广的小游戏appid是否一致；
通过数据源id查询数据源信息：
curl -G 'https://api.weixin.qq.com/marketing/user_action_sets/get?version=v1.0&access_token=<ACCESS_TOKEN>'  
-d  "user_action_set_id":"<USER_ACTION_SET_ID>"
一、API方案介绍
在
微信广告投放平台
推广公众号时，用户关注公众号之后会产生对应的转化行为（如下单、资料收集、注册等），
为了量化关注类广告关注粉丝的转化效果，需要回传用户的转化行为。本API解决的是公众号内部转化行为回传的问题。
说明：

1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读；

2）联调时，请以回传示例格式为准，确保联调正常；
使用须知
（一） 对接流程简介

特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调，小游戏和游戏类小程序无法调用联调。

1.
对于广告主账号与转化行为对应用户openid为同公司/个人主体时
：在
微信广告投放平台
的『开发』—『基本配置』中注册成为开发者；
2.
对于广告主账号与转化行为对应用户openid为不同公司/个人主体时，会报错：errcode:900351001
：需要先通过跨主体回传功能获取小游戏账号授权，即回传的广告主账号需要获取小游戏账号的授权。详见
授权操作说明
；
3.创建转化数据对应的数据源；
4.获取用户openid，根据转化行为、推广目标，选择对应的行为类型回传数据，构造请求回传数据至对应的行为源，需要确保回传成功；
5.例行化：确保线上实际投放时，用户发生转化后，会自动实时运行步骤2，调用API回传数据，并回传成功；
6.验证：判断步骤4是否正常运行；
注：对于二次接入本API的广告主账号，可以跳过1、2步骤；
建议对接人员：建议后台开发同学对接本API；

(二) 问题咨询流程

开发过程中遇到任何问题可以参考以下流程解决
1.查看
本文底部特别关注
或【
行为数据回传附录
-常见问题解答】是否有相应说明；
2.根据【
行为数据回传附录
-返回码】，查询是否有相关说明，如果未检索到对应内容，访问公众平台开发者文档再次查询；
3.参见【
行为数据回传附录
-问题咨询流程】对接人工客服；
使用背景
(一) 目前支持的行为类型以及对应的智能投放优化目标、数据指标如下：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广公众号
综合下单次数
如电商商品被下单
付费
PURCHASE
推广公众号
公众号内付费次数
如小说书城付费
预约
RESERVATION
推广公众号
公众号内填单人数
如提交联系信息，预约看车
注册
REGISTER
推广公众号
公众号内注册人数
如注册为会员
（二）目前支持的广告流量包括

1.公众号底部和文中；
2.朋友圈信息流；
3.小程序/小游戏广告位；
原理介绍
（一）对于公众号的粉丝或公众号内进行转化的用户，每个用户都会生成一个openid（参见
公众平台获取openid文档
），将openid与公众号appid作为转化数据的标识之一回传广告平台。
（二）广告平台会通过openid和appid关联到之前投放的公众号关注广告，从而得到用户行为与推广广告的关联。
（三）关联后计算的广告效果会呈现在
微信广告投放平台
报表中，并会成为后续智能优化的数据基础。
二、对接步骤
概览
1、准备阶段
1)注册成为开发者；
2)创建数据源，获取存储数据的数据源ID；

2、正式对接
1）获取用户openid；
2）确定行为类型；
3）获取创建时存储的数据源ID
4）构造请求回传数据，需要确保回传成功；

3、例行化
确保线上实际投放时，用户发生转化后，会自动实时运行『2;、正式对接』
4、验证
调用API回传数据，并回传成功；
准备阶段：成为公众平台开发者，创建数据源（一） 注册成为开发者
目标：获取开发者ID、密码和access_token
步骤：
特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调。
对于非同主体广告主账号：
用于回传数据的广告主账号需要先获取授权，即回传的广告主账号需要获取openid对应appid的授权。
注：openid对应appid需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
进行授权，详见
授权操作流程 
点击左边栏，『开发』下『开发配置』，获取AppSecret；
参考说明文档获取
access_token
对于同主体广告主账号：
1. 进入
注册页面
，点击左边栏，『开发』下『基本配置』。同意《微信公众平台开发者服务协议》后，点击『成为开发者』；

2. 获取开发者密码。点击“重置”按钮：

3. 弹窗提示，点击“确定重置”按钮：

4. 点击“开始”按钮：

5. 选择验证方式进行验证：

6. 验证完成之后扫码绑定微信号，绑定成功后重置开发者密码。然后微信上点击确认，进行第二步密码验证：

7. 密码验证后，即可查看开发者密码。由于开发者密码不会直接显示在MP后台，因此需要开发者保存。开发者密码为重要账号凭据，建议不要外传。

8. 获取access_token。在开发——基本配置中点击“获取access_token”,用之前注册的开发者id和生成的开发者密码调用接口获取access_token。

（二） 创建数据源
目标：创建数据源，生成数据源ID（user_action_set_id） 步骤：
构造请求，创建数据源；
保存数据源ID，用于后续回传数据；
请求地址： user_action_sets/add
请求方法： POST
请求参数：
名称
类型
描述
Type
enum
用户行为源类型，请填入『WECHAT』类型
Name
string
用户行为源名称，必填
description
string
用户行为源描述，字段长度最小 1 字节，长度最大 128 字节
wechat_app_id
string
关注类广告投放账号对应的appid

特别关注：需要填写被推广的公众号的appid
请求示例：
curl "https://api.weixin.qq.com/marketing/user_action_sets/add?version=v1.0&access_token=<ACCE
SS_TOKEN>"\
-H 'Content-Type: application/json' \
-d '{
    "type": "WECHAT",
    "wechat_app_id": "<WECHAT_APP_ID>",
    "name": "webuser_action_set",
    "description": ""
}'
应答字段：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口] 创建用户行为源时分配的唯一 id
应答示例：
{
"errcode":0, "
"errmsg":""
"data": {
	"user_action_set_id": "<USER_ACTION_SET_ID>"
	}
}
正式对接：获取openid，确定行为类型，回传数据（一） 获取用户openid
目标
：获取访问小游戏用户的openid，作为回传数据的用户标识；
步骤
：
1.获取用户openid，详见
openid获取说明
2.用户发生转化时，记录发生转化的openid；
（二） 确定行为类型
目标
：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型； 
步骤
： 根据以下建议，确认后续API回传时需要填写的Action_Type：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广公众号
综合下单次数
如电商商品被下单
付费
PURCHASE
推广公众号
公众号内付费次数
如小说书城付费
预约
RESERVATION
推广公众号
公众号内填单人数
如提交联系信息，预约看车
注册
REGISTER
推广公众号
公众号内注册人数
如注册为会员
（三）回传数据
目标
：根据openid、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
步骤
：
1.前提 在传入转化行为数据之前，请确保开发者已经：
注册成为开发者，并获取了可用的在有效期内的token
已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见附录；
2.确认上报数据字段，参数说明如下：
名称
类型
必填
限制
说明
user_action_set_id
integer
yes

用于标识数据归属权




url




string




yes

转化行为发生页面的URL，小游戏需要在页面路径前增加『http://www.』， 或直接填写 『http://www.qq.com』

校验逻辑：

1.以『http://www.』 开头；

2.必须为纯小写；

3.必须包含『.』


action_time


integer


yes

行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，
UNIX时间，单位为秒，长度为10位。

如果不填将使用服务端时间填写
action_type
enum
yes

预定义的行为类型，详见上方ActionType定义
openid
string
yes

根据获取到的openid，为28位字符
wechat_app_id

公众号appid
string
yes

生成该openid对应的账号appid，详见
openid获取说明





outer_action_id





string





no

去重标识，平台会基于user_action_set_id，outer_action_id 和action_type三个字段做去重 。

如果历史上报数据中存在某条数据的这三个字段与当前上报数据完全一样的，则当前数据会被过滤掉。

注：字段长度最小1字节，最大长度255字节，且只能为数字，字母，下划线，连接符组成。
action_param
string
no



value

Int

no

代表订单金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000

source

string

Yes

转化数据发生的渠道：

1)Biz，代表公众号内各种服务或网页

2)Web，代表非公众号的其他渠道

归因方式claim_type

integer

Yes

归因方式：

0）按点击行为归因

1）按关注行为归因

关注归因时， 默认选择1）关注行为归因；

可以咨询对应运营是否需要调整。
3.调用API，回传数据 示例：需要统计“关注公众号”后发生的转化行为，开发者只需要在发生转化时，上报action_type=“COMPLETE_ORDER”，且附上获取的 openid。
回传付费请求示例：
curl -k 'https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>"
-d  '{
           	"actions":[
                           	{
                           		"user_action_set_id":"<USER_ACTION_SET_ID>",
                           		"url":"<URL>",
                           		"action_time":1513077790,
                           		"action_type":"COMPLETE_ORDER",
                           		"user_id":{
                                          	  "wechat_app_id":"<WECHAT_APP_ID>",
                                          	 "wechat_openid":"<WECHAT_OPEN_ID>"
                                 	},
                           		"action_param":{
                                          	  "object":"...",
                                          	  "product_name":"..",
                                          	  "product_id":"12345",
                                          	  "source":"Biz",
                                          	  "claim_type":1
                           		}
                           	}
                        	]
  	}'
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，请使用【
行为数据回传附录
】进行排查
例行化：确保线上实际投放时，用户发生转化后，会自动实时运行第2步[正式对接]（一）确保广告实际投放中，用户发生转化后，步骤四能够正常运行，自动获取用户的openid，并通过API回传到广告系统中。
（二）增加API数据回传日志，记录每次调用API回传的内容以及API应答信息，方便后续排查问题
验证：自行验证，上线验证调用API回传数据，并回传成功；
（一)自行验证
确保模拟数据回传API应答正确；
（二)上线验证
创建广告；
正常投放；
确认API数据回传日志，有数据回传且应答信息正确； 无日志可以根据【
行为数据回传附录
-数据源报表查询】，根据raw_action_count是否有值，判断是否成功传入了行为数据；
访问MP投放端报表，数据指标是否有相应的数值显示；
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广公众号
综合下单次数
如电商商品被下单
付费
PURCHASE
推广公众号
公众号内付费次数
如小说书城付费
预约
RESERVATION
推广公众号
公众号内填单人数
如提交联系信息，预约看车
注册
REGISTER
推广公众号
公众号内注册人数
如注册为会员
特别关注

errcode:900351001,errmsg:'wechat open id fetch error'openid无法识别，请确保回传账号已获取openid对应账号的授权。
用于回传数据的广告主账号需要先通过跨主体回传功能获取小游戏账号授权
回传数据的账号为发起授权方，一般为广告主账号；
openid生产方，为接收授权方，一般为小游戏/小程序/公众号等；
注：
1.小游戏需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
2.进行授权，详见
授权操作流程
3.点击左边栏，『开发』下『开发配置』，获取AppSecret；
4.获取
access_token
无法归因常见问题user_action_sets/add接口， Type字段，用户行为源类型，请填入『WECHAT』类型；
user_actions/add接口，归因方式claim_type使用integer类型；
回传成功，无法归因，投放端报表无数据展示请再次确认数据源对应的appid与推广的小游戏appid是否一致；
通过数据源id查询数据源信息：
curl -G 'https://api.weixin.qq.com/marketing/user_action_sets/get?version=v1.0&access_token=<ACCESS_TOKEN>'  
-d  "user_action_set_id":"<USER_ACTION_SET_ID>"
功能说明
通过转化转发，获取用户在产生广告转化时对应的用户信息以及广告信息，从而进行自行归因、自建报表、用户冷启动优化等工作。

用户通过广告发生关注或企业微信添加时，广告平台会将发生了对应的用户id和广告信息 发送至客户侧。

特别说明：企业微信转发需广告主接入归因能力，具体归因方案详见
《企业微信归因接入方案》
。
过程简述：

1） 客户侧提供接收信息的Feedback url；

2） 配置转发规则；（初期运营后台配置，后续上线投放端）

3） 用户发生转化时，广告侧转发对应的用户信息和广告信息；
操作指引
进入广告投放端 进行操作:

a. 在微信广告投放端广告主-账户管理-工具箱-转化跟踪-转化转发，『绑定推广对象』。

b. 填写转发配置，创建转发规则

c. 点击联调，确认feedback_url收到内容与弹窗提示一致；


d. 确保开关开启，即可正常使用；

配置附录

常规配置常见疑问字段
说明
代理商ID
非代理商账号可全选或选择特定代理商，代理商账号只能选择当前代理商。

为空则默认全选。

开发者ID
基于此字段转换为对应的unionid然后进行转发。

整个账号（广告主直客&代理商子客）仅允许设定一个值。

需要修改此值则需要账号下所有直客&子客删除企业微信转发规则后才能修改。

配置参考
企业微信官方文档
转发字段含义说明关注转发
对外转发字段名称
traceid
trace_id
openid
wechat_openid
微信广告aid
adgroup_id
微信广告cid
campaign_id
微信广告appid
wechat_account_id
微信广告spid
wechat_agency_id
关注时间
act_time
广告位
position_id
广告位id说明：
广告位id
内容
20141119
朋友圈信息流
72058780271891663
公众号文章底部
2060133845587488
公众号文章视频贴片
20160808
公众号互选广告
9020229299926746
公众号文章中部
8040321819858439
小程序banner广告
1030436212907001
激励式广告
3030046789020061
小程序插屏广告
1010000925
展示Banner图片
1010000927
优雅横版大图
1010000929
沉浸式横版视频
1010000972
模版聚合格子广告
企业微信转发
企业微信转发
对外转发字段名称
traceid
trace_id
unionid
wechat_unionid
微信广告aid
adgroup_id
微信广告cid
campaign_id
微信广告tid
ad_id
微信广告原生页id
canvas_id
广告点击时间
click_time
微信广告appid
wechat_account_id
微信广告spid
wechat_agency_id
企业微信主体信息（CorpID）
qywx_corp_id，暂时为空
企业微信添加渠道
add_channel，暂时为空
Feedback url格式说明请求方：微信广告点击后台
处理方：广告主后台
请求协议：http
请求方式：GET
请求地址：即feedback URL
feedback URL要求：
可以有参数，但请不要包含符号: #；
不能直接用ip，必须是正式的域名
可以用http、https
不占用如下参数：wechat_openid,adgroup_id,campaign_id,wechat_account_id,wechat_agency_id,act_time,position_id,trace_id,wechat_unionid,adgroup_id,campaign_id,ad_id,canvas_id,click_time,wechat_account_id,wechat_agency_id,qywx_corp_id,add_channel,muid, click_time, click_id, app_type, appid，advertiser_id以及如上表格转发字段；
示例：
http://www.example.com/gdt.cgi

备注：正确（对）


http://www.example.com/gdt.cgi?source=gdt

备注：可以添加参数（对）


http://www.example.com/gdt.cgi? muid=xxxxx&click_time=1406276499&appid=00000&click_id=00000&app_type=android&advertiser_id=0000

备注：不能用特定的参数名称（错）
请求格式说明
当用户发生广告转化时，微信广告后台会获取相关参数，添加到feedback url，发起请求，同步给广告主，请求格式如下： http://www.example.com/gdt.cgi?wechat_openid=xxxxx&adgroup_id=xxxxx&wechat_account_id=xxx&wechat_agency_id=xxxx&act_time=1406276499&position_id=xxxxx
Feedback url请求响应格式Json 数据格式，应答格式如下：

{"ret": 返回码, "errmsg": "错误提示"}
正确返回格式例子：

{ ret: 0, errmsg: "ok" }
注意：
返回码为0标识正常接收，其他返回码标识错误。
返回值必须有：ret,0 否则视为不成功；
返回值不能有302
相关文档企业微信投放指引
企业微信投放相关疑问可查询：【腾讯文档】
企业微信操作指南
openid获取指引
unionID获取指引
openid格式：'^[A-Za-z0-9_-]{28}$'(只允许 数字、字母（大小写）、下划线、短横线 共28位)

功能说明
通过点击转发，获取点击广告用户对应的用户设备号以及广告信息，从而进行自行归因、自建报表、用户冷启动优化等工作。
1.在
微信广告投放端
广告主-账户管理-工具箱-转化跟踪，『绑定推广对象』。
联调设备号示例：

iOS：1E2DFA89-496A-47FD-9941-DF1FC4E6484A；

Android：354649050046412
2.接收微信广告发到feedback url中的点击详细信息。


APP转发字段说明字段
说明
格式备注
更名前字段
click_id
点击ID


click_time
点击时间,取值为标准Unix时间戳，秒级别


wx_campaign_id
微信广告的推广计划ID， 
已下线
64位ID编码，建议以long型或uint64进行存储

campaign_id
微信广告的推广计划ID
64位ID编码，建议以long型或uint64进行存储
wx_campaign_id
wx_adgroup_id
微信广告的广告ID， 
已下线
64位ID编码，建议以long型或uint64进行存储

adgroup_id
微信广告的广告ID
64位ID编码，建议以long型或uint64进行存储
wx_adgroup_id
wx_creative_id
微信广告的素材ID， 
已下线
64位ID编码，建议以long型或uint64进行存储

ad_id
微信广告的素材ID
64位ID编码，建议以long型或uint64进行存储
wx_creative_id
advertiser_id
广告主ID，对应腾讯广告uid， 
已下线


wechat_account_id
广告主ID，对应腾讯广告uid


wx_agent_id
代理商ID，对应微信服务商spid， 
已下线


wechat_agency_id
代理商ID，对应微信服务商spid


app_type
应用类型，取值为 android或ios


device_os_type
请求设备操作系统类型，取值为 android或ios


deeplink_url
应用直达url


dest_url
落地页url






muid
设备ID,由 IMEI(Android 应用)、IDFA(iOS 应用)md5生成。

具体加密方案如下:

Android 设备-muid加密规则:
 IMEI 号需转小写，进行 md5 以后得到的 32位全小写md5 表现字符串。

iOS 设备-muid加密规则:
 IDFA 码需转大写，进行 md5 以后得到的 32位全小写md5 表现字符串。



appid
应用ID

Android应用为应用宝移动应用的id，或者iOS应用在Apple App Store的id；



android_id
由android_idmd5生成，并非全量点击数据都有对应信息，当设备号获取不到或匹配不上时，可以作为归因补充


ip
加密IP地址，当设备号获取不到或匹配不上时，可以作为归因补充


user_agent
urlencode，当设备号获取不到或匹配不上时，可以作为归因补充


adgroup_name
广告名称，目前仅支持竞价广告





oaid
虚拟设备id，MSA 制定的匿名设备标识符，保留原始值，不需要 MD5 编码。

具体 OAID 介绍请见移动安全联盟介绍。

oaid正则表达式：Pattern.compile("^[\w-]{8,128}$");

oaid样例：fd79ed7f-6a7b-3b16-edd0-b754cc6d4420








product_type
广告推广目标

12.推广我的应用（Android）

19.推广我的应用（iOS）

23.推广我的公众号

25.推广我的商品（仅京东lunaapi）

29.品牌活动推广（旧）

31.品牌活动推广

36.派发优惠券，
已下线

37.推广我的门店

30.推广我的商品

43.收集销售线索

46.推广小游戏

47.微信支付代金券

APP转发对应的推广目标：

12.推广我的应用（Android）

19.推广我的应用（iOS）

特别说明：
 由于广告侧底层字段升级，可能导致API功能失效，需要各位广告主联系开发团队进行兼容。

点击转发、广告管理等API的日常使用。

1.影响点击转发、广告管理等API的使用；

2.广告id、推广计划id、素材id，升级为64位，可能产生溢出报错，导致API功能失效。
建议方案：兼容64位的ID编码，升级为long型或uint64。
H5网页转发字段说明特别说明：

1.限定为应用推广类相关客户可用，如有需求请联系对接运营开通功能权限

2.H5网页域名配置：域名匹配逻辑为广告链接中，『http://』结束到后续第一个『/』之间的内容。

例如，广告落地页链接为『 https://new.qq.com/rain/a/20191031A0N4C000 』时，域名上需要填写：『new.qq.com』
字段
说明
格式备注
click_id
点击ID

click_time
点击时间,取值为标准Unix时间戳，秒级别

wx_campaign_id
微信广告的推广计划ID， 
已下线
64位ID编码，建议以long型或uint64进行存储
campaign_id
微信广告的推广计划ID
64位ID编码，建议以long型或uint64进行存储
wx_adgroup_id
微信广告的广告ID， 
已下线
64位ID编码，建议以long型或uint64进行存储
adgroup_id
微信广告的广告ID
64位ID编码，建议以long型或uint64进行存储
wx_creative_id
微信广告的素材ID， 
已下线
64位ID编码，建议以long型或uint64进行存储
ad_id
微信广告的素材ID
64位ID编码，建议以long型或uint64进行存储
advertiser_id
广告主ID，对应腾讯广告uid， 
已下线

wechat_account_id
广告主ID，对应腾讯广告uid

wx_agent_id
代理商ID，对应微信服务商spid， 
已下线

wechat_agency_id
代理商ID，对应微信服务商spid

app_type
应用类型，取值为 android或ios

device_os_type
请求设备操作系统类型，取值为 android或ios

deeplink_url
应用直达url

dest_url
落地页url

muid
设备ID,由 IMEI(Android 应用)、IDFA(iOS 应用)md5生成。

具体加密方案如下:

Android 设备-muid加密规则:
 IMEI 号需转小写，进行 md5 以后得到的 32位全小写md5 表现字符串。

iOS 设备-muid加密规则:
 IDFA 码需转大写，进行 md5 以后得到的 32位全小写md5 表现字符串。

appid
应用ID

Android应用为应用宝移动应用的id，或者iOS应用在Apple App Store的id；

android_id
由android_idmd5生成，并非全量点击数据都有对应信息，当设备号获取不到或匹配不上时，可以作为归因补充

ip
加密IP地址，当设备号获取不到或匹配不上时，可以作为归因补充

user_agent
urlencode，当设备号获取不到或匹配不上时，可以作为归因补充

adgroup_name
广告名称，目前仅支持竞价广告

oaid
虚拟设备id，MSA 制定的匿名设备标识符，保留原始值，不需要 MD5 编码。

具体 OAID 介绍请见
移动安全联盟介绍
。

oaid正则表达式：Pattern.compile("^[\w-]{8,128}$");

oaid样例：fd79ed7f-6a7b-3b16-edd0-b754cc6d4420

product_type
广告推广目标

12.推广我的应用（Android）

19.推广我的应用（iOS）

23.推广我的公众号

25.推广我的商品（仅京东lunaapi）

29.品牌活动推广（旧）

31.品牌活动推广

36.派发优惠券， 
已下线

37.推广我的门店

30.推广我的商品

43.收集销售线索

46.推广小游戏

47.微信支付代金券

H5转发对应的推广目标：

31.品牌活动推广

43.收集销售线索

30.推广我的商品

25.推广我的商品（仅京东lunaapi）
特别说明：
 由于广告侧底层字段升级，可能导致API功能失效，需要各位广告主联系开发团队进行兼容。

点击转发、广告管理等API的日常使用。

1.影响点击转发、广告管理等API的使用；

2.广告id、推广计划id、素材id，升级为64位，可能产生溢出报错，导致API功能失效。
建议方案：兼容64位的ID编码，升级为long型或uint64。
以下为feedback url详细说明
feedback url说明请求方：微信广告点击后台
处理方：广告主后台
请求协议：http
请求方式：GET
请求地址：即feedback URL，将用于广告主在微信广告投放平台（mp.weixin.qq.com）创建转化规则所提供请求的地址；
feedback URL要求：
可以有参数，但请不要包含符号: #；
不占用如下参数：muid, click_time, click_id, app_type, appid，advertiser_id：

http://www.example.com/gdt.cgi （对）

http://www.example.com/gdt.cgi?source=gdt 备注：可以添加参数（对）

http://www.example.com/gdt.cgi? muid=xxxxx&click_time=1406276499&appid=00000&click_id=00000&app_type=android&advertiser_id=0000备注：不能用特定的参数名称（错）
微信广告请求格式当用户点击广告时，微信广告点击处理后台会获取相关参数，添加到feedback url，发起请求，同步给广告主，请求格式如下：
iOS应用： http://www.example.com/gdt.cgi?muid=40c7084b4845eebce9d07b8a18a055fc&click_time=1406276499&appid=000000&click_id=007210548a030059ccdfd1d4&app_type=ios&advertiser_id=20000
Android应用： http://www.example.com/gdt.cgi?muid=40c7084b4845eebce9d07b8a18a055fc&click_time=1406276499&appid=000000&click_id=007210548a030059ccdfd1d4&app_type=android&advertiser_id=20000
Feedback url请求响应格式Json 数据格式。
应答格式：
{"ret": 返回码, "msg": "错误提示"}
返回码为0标识正常接收，其他返回码标识错误。
注意：返回值必须有：ret,0；否则视为不成功；返回值不能有302
正确返回格式例子：
{ ret: 0, errmsg: "ok" }
说明
支持回传的行为参数，可用于行为人群回传与转化数据回传。但部分行为参数目前仅支持作为行为人群创建，尚未支持作为投放端数据指标展示或作为oCPM优化目标。
以下为转化数据回传与行为人群支持的标准行为参数。
支持行为参数一览APP-SDK
APP-Open MKT API
H5-JS
H5-Open MKT API
以上回传方式支持的行为参数如下：
行为Action_Type
说明


CUSTOM
自定义标准行为

需要配合
custom_action
一起使用

例：

"action_type": "CUSTOM",

"custom_action": "my_type" //即自定义行为名称。
REGISTER
注册
VIEW_CONTENT
关键页面访问


CONSULT
咨询

请在 action_param 中标识具体的咨询行为：

action_param 中的 key 填写 consult_type

value 填写 ONLINE_CONSULT/MAKE_PHONE_CALL/RESERVE_PHONE_NUMBER 分别表示网页咨询/电话咨询/电话回拨。
ADD_TO_CART
加入购物车
PURCHASE
购买
ACTIVATE_APP
激活应用
SEARCH
搜索
ADD_TO_WISHLIST
收藏
INITIATE_CHECKOUT
开始结算
COMPLETE_ORDER
下单
START_APP
启动应用
RATE
评分
PAGE_VIEW
页面浏览，仅在 user_action_set 为站点时有效
RESERVATION
预约
SHARE
分享
APPLY
申请
CLAIM_OFFER
领取卡券(如 web 落地页领取优惠券等信息的行为)
NAVIGATE
导航(如点击导航按钮后打开地图页面的行为)
PRODUCT_RECOMMEND
商品推荐(动态创意客户直接推送推荐结果时使用)
VISIT_STORE
到店(线下行为，线下零售商接入数据时使用)
TRY_OUT
体验(线下行为，线下零售商接入数据时使用)
DELIVER
发货，订单发货
SIGN_IN
签收，订单签收
APP-Open API 方案一
      支持的回传方式如下：
转化类型
定义
conv_type取值
激活
用户下载应用后首次打开的操作行为。
MOBILEAPP_ACTIVITE

注册
用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为。
MOBILEAPP_REGISTER
加入购物车
用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。
MOBILEAPP_ADDTOCART
付费
用户在应用内进行付费，完成了交易的操作行为。
MOBILEAPP_COST
API回传示例适用于
APP-SDK
APP-Open MKT API
H5-JS
H5-Open MKT API
回传设备号示例：
curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-H 'Content-Type: application/json' 
-d '{
    "actions": [
        {
	"user_action_set_id": "<USER_ACTION_SET_ID>",
            "action_time": 1492998081,
            "user_id": {
                "hash_imei": "f9efca36a3c30e1cf28170d86ecbf5e9"
            },
            "action_type": "CUSTOM",
            "custom_action": "my_type",
            "action_param": 
		{
                "content_type": "ecommerce",
                "object": "product",
                "int_example": 123,
                "int_array_example": [
                    123,
                    234
                ],
                "double_example": 123.4500000000000028421709430404007434844970703125,
                "double_array_example": [
                    123.4500000000000028421709430404007434844970703125,
                    234.56000000000000227373675443232059478759765625
                ],
                "bool_example": true,
                "bool_array_example": [
                    true,
                    false
                ],
                "string_example": "123",
                "string_array_example": [
                    "123",
                    "234",
                    "abc"
                ]
            }
        }
    ]
}'
回传openid示例：
curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-H 'Content-Type: application/json' 
-d '{
    "actions": [
        {
	"user_action_set_id": "<USER_ACTION_SET_ID>",
            "action_time": 1492998081,
            "user_id":{
		"wechat_app_id":"<WECHAT_APP_ID>",
		"wechat_openid":"<WECHAT_OPEN_ID>"
                                 	},
            "action_type": "CUSTOM",
            "custom_action": "my_type",
            "action_param": 
		{
                "content_type": "ecommerce",
                "object": "product",
                "int_example": 123,
                "int_array_example": [
                    123,
                    234
                ],
                "double_example": 123.4500000000000028421709430404007434844970703125,
                "double_array_example": [
                    123.4500000000000028421709430404007434844970703125,
                    234.56000000000000227373675443232059478759765625
                ],
                "bool_example": true,
                "bool_array_example": [
                    true,
                    false
                ],
                "string_example": "123",
                "string_array_example": [
                    "123",
                    "234",
                    "abc"
                ]
            }
        }
    ]
}'
参数说明：
名称
类型
描述
actions
struct[]
返回数组列表，不能大于 50KB

user_action_set_id*

integer
创建用户行为源时分配的唯一 id。，参见
数据回传API-准备阶段创建数据源
。

数组最小长度 1，最大长度 50
action_time
integer
行为发生时，客户端的时间点。UNIX 时间，单位为秒，如果不填将使用服务端时间填写。

最小值 0，最大值 2147483647
user_id
struct
用户标识，支持多种用户id，如openid、设备号等；
wechat_app_id
string
回传openid时必填，填写openid所属方的appid
action_type
enum
标准行为类型，当值为 ‘CUSTOM’ 时表示自定义行为类型
custom_action
string
自定义行为类型，当 action_type=CUSTOM 时必填。

字段长度最小 1 字节，长度最大 128 字节
action_param
string
行为所带的参数，详见
 [param_map]

字段长度最小 1 字节，长度最大 204800 字节
数据报表/oCPM可用转化行为参数H5-Open MKT API
行为名称
ActionType
推广目标
---说明---
MP投放端指标
oCPM优化目标
下单
COMPLETE_ORDER
推广商品
如电商商品被下单
下单量
支持
预约
RESERVATION
收集销售线索
如提交联系信息，预约看车，金融业务注册申请等
销售线索量
支持
H5-JS回传
行为名称
ActionType
推广目标
---说明---
MP投放端指标
oCPM优化目标
下单
COMPLETE_ORDER
推广商品
如电商商品被下单
下单量
支持
预约
RESERVATION
收集销售线索
如提交联系信息，预约看车，金融业务注册申请等
销售线索量
支持
APP-Open API 方案一
转化类型
定义
conv_type取值
MP投放端指标
oCPM优化目标
激活
用户下载应用后首次打开的操作行为。
MOBILEAPP_ACTIVITE
APP激活次数
支持


注册
用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为。


MOBILEAPP_REGISTER


APP注册次数


支持

加入购物车
用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。

MOBILEAPP_ADDTOCART

APP加入购物车次数

尚未支持

付费
用户在应用内进行付费，完成了交易的操作行为。

MOBILEAPP_COST

APP付费次数

尚未支持
APP-Open MKT API
行为名称
ActionType
推广目标
---说明---
MP投放端指标
oCPM优化目标
激活
ACTIVATE_APP
推广应用
用户下载应用后首次打开的操作行为。
APP激活次数
支持



注册



REGISTER



推广应用
用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为



APP注册次数



支持

加入购物车

ADDTOCART

推广应用
用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。

APP加入购物车次数

尚未支持

付费

PURCHASE

推广应用
用户在应用内进行付费，完成了交易的操作行为。

APP付费次数

尚未支持
APP-SDK
行为名称
ActionType
推广目标
---说明---
MP投放端指标
oCPM优化目标
激活
ACTIVATE_APP
推广应用
用户下载应用后首次打开的操作行为。
APP激活次数
支持



注册



REGISTER



推广应用
用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为



APP注册次数



支持

加入购物车

ADDTOCART

推广应用
用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。

APP加入购物车次数

尚未支持

付费

PURCHASE

推广应用
用户在应用内进行付费，完成了交易的操作行为。

APP付费次数

尚未支持
说明
本文档主要说明用户点击广告跳转小程序页面，小程序页面路径所带参数，以及参数监控上报。目前适用于朋友圈、公众号、小程序广告位推广小程序广告的数据监控。
介绍广告主在微信广告侧投放小程序广告，普通用户在收到广告后，点击广告打开小程序页面时，微信侧在小程序页面路径上所带的额外参数及参数说明。小程序广告主获取参数的方式以及数据上报的方案。
参数说明
参数名
参数说明
备注
weixinadkey
广告加密key
暂时不用关心
gdt_vid
广告traceid


weixinadinfo
广告adinfo，由其他参数拼接而成，值为aid.traceid.scene_type.0，aid为微信广告投放端创建广告时生成的广告id

scene_type
广告场景值
暂时不用关心
**示例
创建广告填写的小程序路径：

/page/item/detail/detail?sku=1077777&platform=1
小程序路径加广告参数后示例地址：

/page/item/detail/detail?sku=1077777&platform=1&gdt_vid=wx0ewinbalytpt ma00&weixinadinfo=20966864.wx0ewinbalytptma00.0.1
获取参数代码示例在小程序页面注册时监听onLoad方法，通过options参数获取打开当前页面所调用的 query 参数，可参考
官方文档示例
test.js Page({
data: {
  
text: "This is page data." },
onLoad: function(options) {
// url参数中可以获取到gdt_vid、weixinadinfo参数值 let gdt_vid = options.gdt_vid
let weixinadinfo = options.weixinadinfo
// 获取广告id
let aid = 0
if(weixinadinfo){
let weixinadinfoArr = weixinadinfo.split(‘.’)
aid = weixinadinfoArr[0] }
console.log(‘来源广告的广告id是:’ + aid) }
... })
‘’‘
数据监控方案目前微信广告侧未直接提供广告上报数据，广告主可以通过以下几种方式进行数据的监控:
(一)使用微信广告的参数
用户通过微信广告打开小程序时，微信广告会在原地址上增加广告特有的参数，小程序开发者可以解析这些广告参数(主要收集 aid 和 traceid 信息)，并通过以下两种方式进行参数的上报与分析:
1.使用微信广告提供的API能力(推荐):当对应小程序落地页产生转化行为时，可以 利用API将广告参数和转化数据一并上报给广告平台，经过广告平台计算后，将最终数据呈现在广告投放端。API文档说明
2.开发者自行完成数据上报与分析:收集到广告参数后，小程序开发者可自己进行广告数据与转化行为数据的匹配计算。
(二)使用独立页面作为小程序的投放落地页
制作独立的小程序落地页，该小程序页面仅用于本次广告投放，并针对该页面进行数据监控，以达到区分广告效果的目的。
(三)为小程序落地页地址增加独立的监控参数
创建广告填写小程序路径时，在路径地址上增加独立的监控参数，在小程序页面根据增加的独立参数进行上报，以区分广告来源的数据。
行为数据上传附录
本文档包含行为数据上传可能涉及的问题排查流程、咨询流程、API相关参数等，请自行查阅。
问题排查流程查看FAQ中是否有类似的问题；
查询
附录中『附录-API相关信息-返回码』
，查询是否有相关说明；

访问
公众平台开发者文档
再次查询；

访问
腾讯广告开发者平台
；再次查询

参见下方第3点-『问题咨询流程』，对接人工客服；
FAQ(常见问题解答)1. 回传数据请求接口是否需要设置所有的参数？
可以按需设置，建议你设置所有参数，在你的服务端可以自由取舍。
2. 回传的数据是否100%准确？
API回传不可避免的会产生部分数据的遗漏，同时不符合规范的上报也会被过滤。
3. 除了下单和预约表单，是否还会支持别的转化类型上报，如加车、收藏等？
目前微信广告仅支持这两种，需要广告主将想要统计的转化对应到这两种类型上，其他类型会尽快支持。
4. 上线后，需要将ip加白名单，才能获取access_token么？
是的。
5. 错误提示：{"errcode":900355202,"errmsg":"actionSet create request too frequently"}
需要配置IP白名单，登录“微信公众平台-开发-基本配置”提前将服务器IP地址添加到IP白名单中，点击查看设置方法，否则将无法调用成功。

6. 错误提示：{errcode=48001, errmsg=api unauthorized}
公众号广告主未审核通过，或者IP白名单未添加导致的,IP白名单未添加参见FAQ第5条；
7. 错误提示：{errcode: 900351001, errmsg: 'wechat open id fetch error'}
openid无法识别，请确保回传账号已获取openid对应账号的授权。
用于回传数据的广告主账号需要先通过跨主体回传功能获取小游戏账号授权
回传数据的账号为发起授权方，一般为广告主账号；
openid生产方，为接收授权方，一般为小游戏/小程序/公众号等；
注：
1.小游戏需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
2进行授权，详见
授权操作流程
3点击左边栏，『开发』下『开发配置』，获取AppSecret；
4
获取access_token
8. 无法匹配错误码
1）根据错误码查询附录中『附录-API相关信息-返回码』，查询是否有相关说明；

2）访问
公众平台开发者文档
再次查询；

3）访问再次查询
腾讯广告开发者平台
；

4）参见下方『问题咨询流程』，对接人工客服；
更多常见问题
反馈建议
问题咨询流程对接API过程中，如果涉及API无法调通，报错无法解决的问题，技术咨询可进入腾讯广告开发者专区https://developers.e.qq.com，点击页面右下角侧“问号Logo”，通过反馈中心进行反馈，会有专人及时处理，感谢你的理解与配合!如API可正常使用，但对归因结果数据有疑惑，请咨询『微信广告助手』注：咨询时请注明使用的API名称和使用背景，附上对接文档方便快速定位问题。

数据源查询1.请求地址： user_action_sets/get
2.请求方法：GET
3.请求参数：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过  [user_action_sets 接口] 创建用户行为源时分配的唯一id
4.请求示例：
curl -G 'https://api.weixin.qq.com/marketing/user_action_sets/get?version=v1.0&access_token=<ACCESS_TOKEN>'

-d "user_action_set_id":"<USER_ACTION_SET_ID>"
5.应答字段：
名称
类型
描述
list
struct[]
返回数组列表
user_action_set_id
integer
用户行为源 id，通过  [user_action_sets 接口]  创建用户行为源时分配的唯一id
type
enum
用户行为源类型，WEBhttps://developers.e.qq.com/docs/reference/enum - api_user_action_set_type
name
string
用户行为源名称，必填
description
string
用户行为源描述
activate_status
boolean
数据接入状态， true 表示已接入， false 表示未接入
created_time
string
创建时间，格式为 yyyy-MM-dd HH:mm:ss,如 2016-11-01 10:42:56
6.应答示例：
{ "data":{ "list":[ { "user_action_set_id":<USER_ACTION_SET_ID>, "type":"WEB", "name":"wxadtest", "description":"test", "activate_status":true, "created_time":"2017-12-11 17:14:17" } ] }, "errcode":0, " "errmsg":"" }
数据源报表查询1.请求地址：user_action_set_reports/get
2.请求方法：GET
3.请求参数：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口]  创建用户行为源时分配的唯一 id

date_range

struct
时间范围，日期格式，{"start_date":"2017-03-01","end_date":"2017-04-02"}，需要进行urlencode转码（即date_range对应的value整体需要转码）
start_date
string
开始时间点对应的时间戳，小于或等于 end_date。字段长度最小 10 字节，长度最大 10 字节
end_date
string
结束时间点对应的时间戳，小于或等于今天，且大于或等于 start_date。字段长度最小 10 字节，长度最大 10 字节

time_granularity

enum
时间粒度，针对流量的粒度，可选值： DAILY （按天汇总），HOURLY （按小时汇总），默认小时，参考下方该参数的枚举值https://developers.e.qq.com/docs/reference/enum - api_time_granularity 枚举列表：{ DAILY, HOURLY }

aggregation

enum
聚合维度，是否将结果按照指定类型细分，可选值'DOMAIN', 'ACTION_TYPE'，参考下方该参数的枚举值。 枚举列表：{ DOMAIN, ACTION_TYPE }
4.请求示例：
curl -G 'https://api.weixin.qq.com/marketing/user_action_set_reports/get?version=v1.0&access_token=<ACCESS_TOKEN>' -d 'user_action_set_id=<USER_ACTION_SET_ID>' -d 'date_range={ "start_date": "2017-04-24", "end_date": "2017-05-01" }'

-d 'time_granularity=DAILY' -d 'aggregation=ACTION_TYPE'
5.应答字段：
名称
类型
描述
list
struct[]
返回数组列表
date
string
采样日期，格式： yyyy-MM-dd
hour
integer
小时，当 time_granularity=HOURLY 时有值，返回格式 HH
domain
string
行为发生的域名，当 aggregation=DOMAIN 时有值
action_type
enum
预定义的行为类型，当 aggregation=ACTION_TYPE 时有值，参考附录中的action_type
custom_action
string
自定义行为类型，当 aggregation=ACTION_TYPE 时有值
raw_action_count
integer
原始上报行为数
identified_action_count
integer
可识别的行为数
identified_user_count
integer
可识别的独立用户数，当没有指定 aggregation 时，有值
6.应答示例：
{ "data":{ "list":[ { "date":"2017-12-12", "action_type":"COMPLETE_ORDER", "custom_action":"", "raw_action_count":4000, "identified_action_count":2000 } ] }, "errcode":0, " "errmsg":"" }
API相关信息1. 枚举值
时间粒度 | time_granularity
名称
描述
DAILY
按天汇总
HOURLY
按小时汇总
聚合方式|aggregation
名称
描述
DOMAIN
按域名汇总
ACTION_TYPE
按行为类型汇总
预定义标准的行为类型 | action_type
行为
Actiontype
描述
限制



注册



REGISTER
用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为。小游戏场景下，注册行为表示用户打开小游戏并完成内容加载的行为，由小游戏平台对数据进行上报，建议广告主与平台对齐口径。

关键页面访问
VIEW_CONTENT







咨询





CONSULT

请在 action_param 中标识具体的咨询行为,


key
 :consult_type。

value
 选填 ：

1）ONLINE_CONSULT：网页咨询；

2）MAKE_PHONE_CALL：电话咨询；

3）RESERVE_PHONE_NUMBER：电话回拨
加入购物车
ADD_TO_CART
用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。

购买
PURCHASE
用户在应用内进行付费，完成了交易的操作行为。

激活应用
ACTIVATE_APP
用户下载应用后首次打开的操作行为。

搜索
SEARCH


收藏
ADD_TO_WISHLIST


开始结算
INITIATE_CHECKOUT


下单
COMPLETE_ORDER


启动应用
START_APP


评分
RATE


页面浏览
PAGE_VIEW

仅在 user_action_set 为站点时有效
预约
RESERVATION


分享
SHARE


申请
APPLY


领取卡券
CLAIM_OFFER
如 web 落地页领取优惠券等信息的行为

导航
NAVIGATE
如点击导航按钮后打开地图页面的行为

商品推荐
PRODUCT_RECOMMEND

动态创意客户直接推送推荐结果时使用
到店
VISIT_STORE

线下行为，线下零售商接入数据时使用
体验
TRY_OUT

线下行为，线下零售商接入数据时使用
发货，订单发货
DELIVER


签收，订单签收
SIGN_IN



2. action_param结构
action_param是一个Map，key类型为String，value的类型支持以下几种：
Int或Int[]: 64位整数；
Double或Double[]: 最大值100000000000(一千亿)，保留3位小数精度，超过的截断，而非四舍五入；
Boolean或Boolean[]: 支持字面值为：true,false；
String或String[]: 字符串；
其类型约束在服务端控制，如果不满足约束，将返回对应的错误。
返回码使用说明

1）根据错误码查询附录中『附录-API相关信息-返回码』，查询是否有相关说明；

2）访问
公众平台开发者文档
再次查询；

3）访问再次查询
腾讯广告开发者平台
；

4）参见下方『问题咨询流程』，对接人工客服；
返回码
提示消息
描述
0
success
操作成功，没有错误
18001
Your request is missing a required parameter. The required parameter is '{PARAM}'
缺少必要的参数，参数名：{Param}
18002
Parameter '{PARAM}' must be {TYPE}.
参数{Param}必须是{TYPE}
18003
The value you specified for '{PARAM}' is invalid. Valid values must be less than {PARAM}.
参数{Param}必须小于{Value}
18004
The value you specified for '{PARAM}' is invalid. Valid values must be greater than {PARAM}.
参数{Param}必须大于{Value}
18005
The value is invalid for the associated parameter '{PARAM}'.
参数{Param}的数据格式不符合要求
18006
The value of parameter '{PARAM}' contains disallowed characters.
参数{Param}含有非法字符
18007
The parameter '{PARAM}' has too many characters.
参数{Param}长度太长
18008
The parameter '{PARAM}' has too few characters.
参数{Param}长度太短
18009
Parameter '{PARAM}' must be one of the following values: [{PARAM}].
参数{Param}值不在[{Enum}]中
18010
The type of the uploaded file is invalid.
文件类型不允许
18011
Your request contains too many values for '{PARAM}'. This parameter can have a maximum of {PARAM} value(s).
参数{Param}数组元素太多，最多有{Value}个
18012
Your request contains too few values for '{PARAM}'. This parameter must have a minimum of {PARAM} value(s).
参数{Param}数组元素太少，至少有{Value}个
18013
Parameter '{PARAM}' has too many decimal places. The maximum number of decimal places is {PARAM}.
参数{Param}小数位数太长，小数点后最多{Value}位
30000
We are unable to process your request at this time. Please retry your request. If you encounter this error repeatedly, please contact our dedicated operation team.
系统错误，请重试。如稳定复现请保留请求信息并向广点通官方反馈
30106
Your request is missing a required parameter. The required parameter is 'agency_token'.
缺少必要的参数，参数名：{agency_token}
30107
Binding to the agency has failed. Please check whether your account has already been bound.
新增服务商授权失败，请确认是否已经授权过
31001
Required parameter '{PARAM}' cannot be an empty string.
参数{Param}不能为空
31009
This operation is not permitted on this {PARAM}.
没有权限操作指定对象，对象名：{Object}
31010
The {PARAM} is invalid: it could have been deleted or never existed.
操作的对象不存在或已删除，对象名：{Object}
31011
The specified parameter '{PARAM}' referred to an entity which either does not exist or is not accessible to you.
参数{Param}错误，对应的数据不存在
31013
An {PARAM} is being added or renamed, but the name is already being used by another {PARAM}.
对象存在重名，对象名：{Object}
31014
The file failed MD5 check.
文件签名校验失败
31016
parameter value is too tiny
参数值太小
31026
campaign daily budget less than cost plus limit
推广计划日预算小于当前消耗加上最低修改幅度
31027
An object with the same 'outer_id' has already been created.
已使用相同的outer_id创建对象
31028
The 'outer_id' provided does not match our records.
outer_id不匹配
31030
New version should be greater than the existing version.
版本必须比当前版本新
31031
The parameter '{PARAM}' is not allowed to be modified.
参数{Param}不允许修改
31034
Parameter '{PARAM}' is invalid.
参数值错误，参数名：{Param}
31035
Your request must include at least one of {PARAM}.
以下参数必须至少设置一项，参数名：[{Param}]
31036
You can only provide one 'order_by' parameter.
只能提供一个order_by参数
31037
The uploaded file is too large.
上传文件过大
31038
You are not permitted to do this request.
请求没有权限
31099
Parameter is invalid.
参数值错误
32100
Your account balance is not enough.
余额不足
32102
Funds can only be transferred between accounts of the same type.
只能在同类型资金账户间划账
32103
Funds transfer is not supported by your account.
当前资金账户类型不支持划账
32104
The signature of the recharge message is invalid.
充值通知签名错误
32105
Transfer failed: the current account has more than {Value} funds with validity period.
划账失败，当前账户已超{Value}笔有效资金
32106
Funds are not allowed to be transferred to a frozen account.
不允许向冻结的账户划账
32107
The 'daily_budget' can only be set when the advertiser becomes active.
只有生效帐户才能设置日限额
32108
The duration of the parameter 'date_range' is beyond the allowed maximum.
参数date_range的时间跨度超过允许的范围
32109
Transfer limit reached. Please retry after one day.
超过每日划账次数限制，请明天再试
32203
The budget of the account has been modified too many times.
帐号预算修改次数太多
32206
mobile and telephone must set one of them
手机号和座机号不能同时为空
32207
No advertiser is found for the 'advertiser_id' provided in the request.
没有找到有效的广告主
32209
The agency is inactive.
代理商状态不可用
32210
The API can only be used by an agency.
调用方必须为代理商
32211
The advertiser is inactive.
广告主帐号当前不可用
32212
The 'daily_budget' was greater than the maximum allowed.
日限额太大
32213
The 'daily_budget' was less than the minimum allowed.
日限额太小
32214
current user status is not allowed to save drafts
当前广告主状态不允许保存草稿
32215
nothing changed for approval
调用update接口必须修改至少一项内容
32216
information is not complete for approval
提交审核需要的信息不完整
32217
no industry info provided
industry_id和outer_industry不能同时为空
32218
the qq of user has been registered
填写的QQ号已被注册为广告主
32219
The advertiser don't have any wechat account binding
广告主没有绑定微信公众号
32220
The wechat spid frozen can not be different from campaign's
该推广计划由其他服务商创建
32221
The 'daily_budget' must higher than current day budget.
日预算需要高于当前帐号的总消耗
32302
Campaign 'daily_budget' has been modified too many times.
推广计划限额修改次数太多
32306
Only suspended campaigns can be deleted.
只有暂停的计划才能被删除
32307
Campaign 'daily_budget' was too low. Please increase the 'daily_budget' and retry.
推广计划限额太小
32308
Parameter 'campaign_type' is not allowed to be modified.
计划类型不能被修改
32310
The 'daily_budget' was greater than the maximum allowed.
日限额太大
32311
The 'daily_budget' was less than the minimum allowed.
日限额太小
32312
The 'begin_date' must greater than now.
开始日期不得早于今日
32313
The city's level of point {PARAM} is defferent from other points in Adgroup's geo_location
所选的城市或商圈不属于同一出价级别
32402
Ad group time interval specified is invalid, 'end_date' cannot be earlier than 'begin_date'.
开始日期必须早于结束日期
32405
Parameters 'min_impression_include' and 'max_impression_include' must be used together.
最低曝光频次和最高曝光频次必须成对设置
32406
Parameter 'max_impression_include' cannot be less than 'min_impression_include'.
最高曝光频次不得小于最低曝光频次
32407
Parameter 'site_set' has already been set by the campaign.
推广计划上已经设置了投放站点
32408
A required parameter 'site_set' was not specified or is an empty string.
广告投放站点未设置
32409
Parameter 'timeset' has already been set by the campaign.
推广计划已经设置投放时段
32410
Campaigns of {Enum} type can only use 'bid_type' of {Enum}.
{Enum}类型推广计划只能使用{Enum}类型的计费方式
32413
Parameters 'begin_date' and 'end_date' have already been set by the campaign.
投放日期重复设置
32415
The bid on an ad group is not allowed to be higher than 50% of the daily budget of the campaign.
广告出价不得超过计划预算的50%
32416
The bid on an ad group is not allowed to be modified.
当前广告不允许修改出价
32417
The 'product_type' you specified is not allowed to be used by your campaign.
无法使用当前标的物类型
32419
the industry id of qualification code not exit
行业资质编码不存在
32420
the number of qualifications is illegal
营业执照号错误
32421
This targeting can not be modified
定向不能进行修改
32422
Thi bid is too samll or large
出价超出限制
32423
This campaign is allowed to have {PARAM} adgroups
当前推广计划下广告组数量超出限制
32424
The {PARAM} is different from other adgroups or it's campaign
属性{PARAM}与所属推广计划或推广计划下的其他广告组的不一致
32425
The wechat's adgroup allows its product_type in 'PRODUCT_TYPE_LBS_WECHAT' and 'PRODUCT_TYPE_LINK_WECHAT' only
微信广告组的商品类型只能为PRODUCT_TYPE_LBS_WECHAT、PRODUCT_TYPE_LINK_WECHAT
32426
The point {PARAM} is illegal in wechat's campaign
微信推广计划的参数非法，参数名：{Param}
32427
The bid is illegal in the city of level {PARAM}
出价不符合城市{Param}的级别要求
32428
The 'targeting_id' and 'targeting' can not appear at the same time
targeting_id和targeting不能同时使用
32429
The 'targeting' must be set and 'targeting_id' is not allowed
微信公众号及朋友圈广告不允许使用targeting_id，仅允许使用targeting
32430
The 'geo_location' must be set
定向geo_location不能为空
32431
The 'regions' and 'business_districts' can be empty at the same time.
regions和business_districts不能同时为空
32432
The 'location_types' must be the following values: 'RECENTLY_IN','VISITED_IN'.
location_types仅支持RECENTLY_IN、VISITED_IN
32432
The 'location_types' must be the {PARAM}
location_types仅支持{Param}
32433
The {PARAM} is not allowd
{Param}参数不允许使用
32504
The creative template cannot be used by the adgroup with the 'product_type' you specified.
当前规格不能被标的物类型为{Enum}的广告组使用
32506
adgroup_id and campaign_id is not match
广告组id和计划id不匹配
32507
The video type is invalid.
视频类型错误
32508
The video is not of legal dimensions.
视频尺寸不符合要求
32509
The image could not be stored.
存储图片失败
32510
The domain is not whitelisted for 'impression_tracking_url'.
曝光监控地址主域不在允许的白名单内
32513
Parameter 'destination_url' has already been set by the ad group.
广告组已经设置落地页地址
32514
Parameter 'creative_elements[{Param}]' is invalid.
创意元素creative_element中参数｛Param｝错误
32515
Parameters 'product_ref_id' in url and 'product_ref_id' in adgroup must match.
落地页地址中标的物ID与adgroup中标的物ID必须一致
32516
The ad must use a dynamic ad template since it is a dynamic ad.
当前广告是动态创意广告，必须使用动态创意规格
32517
Video length does not meet the specifications.
视频时长不符合要求
32518
Video file is too large.
视频文件大小不符合要求
32519
Video is pending conversion.
视频文件处理中，暂不可用
32520
The image is not of legal dimensions.
图片尺寸不符合要求
32521
Image file is too large.
图片文件过大
32523
Parameters 'site_set' and 'product_type' must be used together.
site_set和product_type两个筛选条件必须一起使用
32524
The creative elements do not meet the specifications of the creative template.
创意元素不符合规格要求
32525
Image file is too small.
图片文件过小
32526
Video transcoding has failed.
视频文件转码失败
32527
The creative template cannot be used on the 'site_set' of the adgroup.
当前规格不能在广告组对应的站点投放
32528
You are not permitted to use this creative template.
未授权使用该规格
32529
cannot use search ad creative currently
当前创意不可使用
32531
unmatched campaign_type group on adgroup and creative
创意和广告组上的广告类型不一致
32532
campaign product_type and ad_creative product_type is not match
推广计划的标的物类型和广告创意的标的物类型不匹配
32533
Adgroup site_set and AdCreative site_set is not match
广告组的站点和广告创意的站点不匹配
32534
Adgroup product_type and AdCreative product_type is not match
广告组的标的物类型和广告创意的标的物类型不匹配
32535
Adgroup product_ref_id and AdCreative product_ref_id is not match
广告组的标的物id和广告创意的标的物id不匹配
32536
The number of Wechat moments Ad in one campaign reach limit
同一推广计划下的微信朋友圈广告个数已达上限
32537
Wechat moments Ad in one campaign must refers the same ad_creative
同一推广计划下的微信朋友圈广告仅能关联同一广告创意
32538
This Adgroup in the Wechat moments Campaign already refers one AdCreative
微信朋友圈广告仅能关联一个广告创意
32539
This Adgroup in Wechat offical account Campaign already refers one Creative
微信公众号广告仅能关联一个广告创意
32540
AdCreative's campaign must set the placement CAMPAIGN_TYPE_WECHAT_MOMENTS
朋友圈创意必须归属于朋友圈推广计划
32541
The number of AdCreative associations reaches the limit
创意数量达到限制
32542
Wechat moments ad only support one image
微信朋友圈广告仅支持一张图片
32544
Creative elements's texts at most have 4 rows
创意元素的文字描述最多4行
32545
Wechat moments ad are not allowed modified after exposure
微信朋友圈广告一旦有过曝光后，即不允许修改
32605
Parameter 'app_behavior[object_type]' cannot be found.
app_behavior下object_type不存在
32606
Parameter 'app_behavior[object_type]' must be a leaf node.
app分类必须指定最细级别
32607
Parameters 'location' and 'area' cannot be used together.
不能同时使用位置和地域定向
32609
Parameter 'targeting_setting[{Param}]' is invalid.
定向详细条件中{Param}错误
32610
You have selected a Min '{Param}' greater than Max '{Param}', you should select a valid range.
区间错误: 参数{Param}的上限大于下限
32615
Parameter 'targeting_setting[ad_behavior]' is invalid. The action is not allowed to be used by your account.
当前帐号不允许使用该行为作为定向
32702
Too many APP products are created in this month.
每月创建的APP标的物超上限
32705
Required parameter 'app_id' cannot an empty string.
app id不能为空
32706
The app with the 'product_ref_id' cannot be found.
未发现对应的app
32708
Subordiante 'product_ref_id' cannot be found.
未发现对应的渠道包id
32709
The preview image of the subordinate product cannot be found.
视频说说缩略图不存在
32710
A product is being added, but the 'product_refs_id' is already being used by another product.
请不要重复创建标的物
32711
The pc app identified with the 'product_id' cannot be found.
找不到对应的开发平台PC应用
32712
The name of the pc app is not available.
获取开放平台PC应用名称失败
32713
The product type not support yet
标的物类型暂不支持
32801
The 'group_by' condition is invalid.
无效的聚合条件
32803
Parameter 'date' is before allowed minimum or after allowed maximum.
报表日期超限
32804
Parameter 'order_by' is invalid.
当前的排序规则不支持
32805
Report type and level not match.
报表的类型和层级不匹配
32901
The uploaded file is invalid.
上传文件为空
32902
The type of the uploaded file is not supported.
文件类型不支持
32903
The image identified with the URL cannot be found.
URL指定的图片无法正常读取
32904
The duration of the file is beyond the allowed maximum.
文件播放时间太长
50002
account id invalid
account_id无效
51000
parameter error
参数异常
51001
system error
系统异常
51002
unknown protocol error
无效的数据协议
52012
file extension invalid
无效的文件类型
52015
file size exceeds limit.
文件大小超过限制
`,
  230: `
  一、API方案介绍
  在微信广告推广APP应用程序时，用户下载APP应用程序会产生对应的转化行为（如激活、注册等），为了量化广告转化效果，以及积累转化数据以使用智能优化（oCPM/oCPA）能力，需要回传用户的转化行为。本API解决的是APP行为数据回传的问题
  说明： 1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读； 2）联调时，请以回传示例格式为准，确保联调正常；
  使用须知
  （一） 对接流程简介
  特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调，小游戏和游戏类小程序无法调用联调。
  1.在
  微信公众平台
  的『开发』—『基本配置』中注册成为开发者；
  2.创建转化数据对应的数据源；
  3.获取用户设备号（IMEI/IDFA），并进行加密处理，根据转化行为、推广目标，选择对应的行为类型回传数据，构造请求回传数据至对应的行为源，需要确保回传成功；
  4.例行化：确保线上实际投放时，用户发生转化后，会自动实时运行步骤2，调用API回传数据，并回传成功；
  5.验证：判断步骤3是否正常运行；
  注：
  
  1.对于二次接入本API的广告主账号，可以跳过1、2步骤；
  
  2.需要通过点击转发获取点击广告的用户详细信息，用于内部归因或用户冷启动，详见
  点击转发使用说明
  (二) 问题咨询流程
  开发过程中遇到任何问题可以参考以下流程解决
  1.查看FAQ中是否有类似的问题；
  2.根据【
  行为数据回传附录
  -返回码】，查询是否有相关说明，如果未检索到对应内容，访问公众平台开发者文档再次查询；
  3.参见【
  行为数据回传附录
  -问题咨询流程】对接人工客服；
  使用背景
  (一) 目前支持的行为类型以及对应的智能投放优化目标、数据指标如下：
  行为名称
  ActionType
  推广目标
  数据指标
  说明
  激活
  ACTIVATE_APP
  推广应用
  APP激活次数
  用户下载应用后首次打开的操作行为。
  
  
  注册
  
  
  REGISTER
  
  
  推广应用
  
  
  APP注册次数
  用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为
  
  加入购物车
  
  ADD_TO_CART
  
  推广应用
  
  APP加入购物车次数
  用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。
  付费
  PURCHASE
  推广应用
  APP付费次数
  用户在应用内进行付费，完成了交易的操作行为。
  次留
  START_APP
  推广应用
  暂无
  用户完成应用激活后，第二天继续进入APP
  （二）目前支持的广告流量包括
  1.公众号底部和文中：品牌活动推广、电商推广、销售线索收集广告的H5落地页；
  2.朋友圈信息流：品牌活动推广、本地推广、电商推广、销售线索收集广告的H5落地页；
  原理介绍
  （一）对于推广APP广告，用户通过广告下载安装并使用对应APP后，APP可以获取用户手机的设备号信息，如Android的IMEI、iOS的IDFA信息，设备号信息作为广告主与广告平台共同使用的用户标识；
  （二）回传转化数据时，需要回传转化行为与对应的设备号信息，广告平台会通过设备号关联到该次转化对应的广告点击，从而得到广告点击与广告后端转化的关联。
  （三）关联后计算的广告效果会呈现在
  微信广告投放平台
  报表中，并会成为智能优化的数据基础。
  二、对接步骤
  
  准备阶段：成为公众平台开发者，创建数据源（一） 注册成为开发者
  目标：获取开发者ID、密码和access_token
  步骤：
  特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调。
  进入
  注册页面
  ，点击左边栏，『开发』下『基本配置』。同意《微信公众平台开发者服务协议》后，点击『成为开发者』；
  
  获取开发者密码。点击“重置”按钮：
  
  弹窗提示，点击“确定重置”按钮：
  
  点击“开始”按钮：
  
  选择验证方式进行验证：
  
  验证完成之后扫码绑定微信号，绑定成功后重置开发者密码。然后微信上点击确认，进行第二步密码验证：
  
  密码验证后，即可查看开发者密码。由于开发者密码不会直接显示在
  微信广告投放平台
  后台，因此需要开发者保存。开发者密码为重要账号凭据，建议不要外传。
  
  获取access_token。在开发——基本配置中点击“获取access_token”,用之前注册的开发者id和生成的开发者密码调用接口获取access_token。
  
  （二） 创建数据源
  目标：创建数据源，生成数据源ID（user_action_set_id）
  步骤：
  构造请求，创建数据源；
  保存数据源ID，用于后续回传数据；
  请求地址： user_action_sets/add
  请求方法： POST
  请求参数：
  名称
  类型
  描述
  Type
  enum
  用户行为源类型，IOS或ANDROID
  mobile_app_id
  integer
  应用 id，必填字段;
  Name
  string
  用户行为源名称，必填
  description
  string
  用户行为源描述，字段长度最小 1 字节，长度最大 128 字节
  请求示例：
  curl -i "https://api.weixin.qq.com/marketing/user_action_sets/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
  -H "Content-Type: application/json" 
  -d '{ 
    "type": "ANDROID", 
    "mobile_app_id":"123456",
    "name": "wxadtest",
    "description": "test"
     }'
  应答字段：
  名称
  类型
  描述
  user_action_set_id
  integer
  用户行为源 id，通过 [user_action_sets 接口] 创建用户行为源时分配的唯一 id
  应答示例：
  { 
    "errcode":0, "
    "errmsg":"" 
    "data": { 
      "user_action_set_id": "<USER_ACTION_SET_ID>" 
    } 
  }
  正式对接：获取用户设备号信息，并进行加密，确定行为类型，回传数据（一） 获取用户设备号信息并进行加密
  目标
  ：获取使用APP的设备号，并进行对应的加密处理，作为回传数据的用户标识；
  步骤
  ：
  1 获取设备号信息 获取APP用户的设备号信息，作为加密前的原始信息；
  Android设备
  ：需要获取IMEI信息，IMEI原始信息为14或15位，由数字+字母或纯数字组成；
  iOS设备
  ：需要获取IDFA信息，IDFA原始信息为36位，由数字+字母串+『-』分隔符组成；
  
  2 设备号加密，本文中加密后设备号统称为muid
  Android 设备
  ：IMEI 号(需转小写)，进行 md5 以后得到的 32 位全小写的字符串。
    如，
    原始 IMEI 号：354649050046412
    加密之后：b496ec1169770ea274a2b4f42ca4fb71
  
  iOS 设备
  ：IDFA码(需转大写)，进行 md5 以后得到的 32 位全小写的字符串。
    如，
    原始IDFA码：1E2DFA89-496A-47FD-9941-DF1FC4E6484A
    加密之后：40c7084b4845eebce9d07b8a18a055fc
  
  
  3 记录muid 用户发生转化时，记录发生转化的muid；
  （二） 确定行为类型
  目标
  ：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型；
  步骤
  ： 根据以下建议，确认后续API回传时需要填写的Action_Type：
  行为名称
  ActionType
  推广目标
  数据指标
  说明
  激活
  ACTIVATE_APP
  推广我的应用
  APP激活次数
  用户下载应用后首次打开的操作行为。
  
  注册
  
  
  REGISTER
  
  
  推广我的应用
  
  
  APP注册次数
  用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为
  
  加入购物车
  
  ADD_TO_CART
  
  推广我的应用
  
  APP加入购物车次数
  用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。
  
  付费
  
  PURCHASE
  
  推广我的应用
  
  APP付费次数
  用户在应用内进行付费，完成了交易的操作行为。
  次留
  START_APP
  推广我的应用
  APP次留人数
  用户完成应用激活后，第二天继续进入APP
  （三）回传数据
  目标
  ：根据muid、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
  步骤
  ：
   1. 前提 在传入转化行为数据之前，请确保开发者已经：
  注册成为开发者，并获取了可用的在有效期内的token
  已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见
  行为数据回传附录
  ；
   2. 确认上报数据字段，参数说明如下：
  名称
  类型
  必填
  限制
  说明
  user_action_set_id
  integer
  yes
  
  用于标识数据归属权。
  
  
  action_time
  
  
  integer
  
  
  yes
  
  行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，UNIX时间，单位为秒，如果不填将使用服务端时间填写
  
  
  action_type
  
  
  enum
  
  
  yes
  
  预定义的行为类型，目前只支持COMPLETE_ORDER（下单）及RESERVATION（表单预约）
  hash_imei
  string
  yes
  Android应用填写，iOS应用不填入此项
  目填入Android应用设备号加密后的muid
  hash_idfa
  string
  yes
  iOS应用填写，Android应用不填入此项
  目填入iOS应用设备号加密后的muid
  
  
  
  
  oaid
  
  
  
  
  string
  
  
  
  
  no
  
  MSA 制定的匿名设备标识符，保留原始值，不需要 MD5 编码。
  
  具体 OAID 介绍请见
  移动安全联盟介绍
  。
  
  oaid正则表达式：Pattern.compile("^[\w\-]{8,128}$");
  
  oaid样例：fd79ed7f-6a7b-3b16-edd0-b754cc6d4420
  
  click_id
  
  string
  
  no
  
  点击转发接收到的click_id,获取方式见
  点击转发能力使用
  
  
  
  
  
  
  outer_action_id
  
  
  
  
  
  
  string
  
  
  
  
  
  
  no
  
  去重标识，平台会基于user_action_set_id，outer_action_id 和action_type三个字段做去重 。
  
  如果历史上报数据中存在某条数据的这三个字段与当前上报数据完全一样的，则当前数据会被过滤掉。
  
  注：字段长度最小1字节，最大长度255字节，且只能为数字，字母，下划线，连接符组成。
  
  
  action_param
  
  
  string
  
  
  no
  
  行为所带的参数，转化行为价值（例如金额），详见
  行为数据回传附录
  ，字段长度最小 1 字节，长度最大 204800 字节
  
  
  value
  
  
  Int
  
  
  no
  
  代表行为对应价值或金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000
  length_of_stay
  intege
  no
  回传次留必填
  Actiontype= START_APP时必填，赋值为1
  调用API，回传数据 示例：需要统计“激活”的转化行为，开发者只需要在激活转化行为发生时，上报action_type=“ACTIVATE_APP”，且附上由落地页获取的 hash_imei或hash_idfa。
  请求示例（简单版，适用于一般情况的数据回传）：
  curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
  -H "Content-Type:application/json"
  -d  '{
    "user_action_set_id": "<USER_ACTION_SET_ID>",
    "actions": [{
        "action_time": 1513077790,
        "user_id": {
          "hash_imei": "f9efca36a3c30e1cf28170d86ecbf5e9",
          "oaid":"fd79ed7f-6a7b-3b16-edd0-b754cc6d4420"
        },
        //注释：trace为非必填字段
        "trace": {
          "click_id": "<CLICK_ID>"
        },
        //注释结束
        "action_type": "ACTIVATE_APP",
        "action_param": {
          "value": < purchase_value >
        }
      ]
    }'
  注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
  请求示例（回传次留数据）：
  curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
  -H "Content-Type:application/json"
  -d  '{ 
    "user_action_set_id": "<USER_ACTION_SET_ID>",
    "actions":[
      {
          "action_time":1513077790,
          "user_id": {
                  "hash_imei": "f9efca36a3c30e1cf28170d86ecbf5e9",
      "oaid":"fd79ed7f-6a7b-3b16-edd0-b754cc6d4420"
              },
        //注释：trace为非必填字段
        "trace": {
          "click_id": "<CLICK_ID>"
        },
        //注释结束
          "action_type":"START_APP",
         "action_param": {
           "length_of_stay": 1,
           "value": <purchase_value> 
      }
      ]
    }'
  请求示例（复杂版，需要回传大量其他参数时可以参考）：
  curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
  -H "Content-Type:application/json"
  -d  '{ 
    "user_action_set_id": "<USER_ACTION_SET_ID>",
    "actions":[
      {
          "action_time":1513077790,
          "user_id": {
                  "hash_imei": "f9efca36a3c30e1cf28170d86ecbf5e9"	
              },
          //注释：trace为非必填字段
          "trace": {
          "click_id": "<CLICK_ID>"
        },
        //注释结束
          "action_type":"ACTIVATE_APP",
         "action_param": {
                  "content_type": "ecommerce",
                  "object": "product",
                  "int_example": 123,
                  "int_array_example": [
                      123,
                      234	
                  ],
                  "double_example": 123.45,
                  "double_array_example": [
                      123.45,
                      234.56
                  ],
                  "bool_example": true,
                  "bool_array_example": [
                      true,
                      false	
                  ],
                  "string_example": "123",
                  "string_array_example": [
                      "123",
                      "234",
                      "abc"
          }		
      }
      ]
    }
  注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
  应答示例：
  正确的返回值为：
  {"errcode":0," errmsg ":""}
  返回错误返回码时，详见『
  行为数据回传附录
  -问题排查流程』。
  例行化：确保线上实际投放时，用户发生转化后，会自动实时运行第2步[正式对接]（一）确保广告实际投放中，用户发生转化后，步骤四能够正常运行，自动获取用户的muid，并通过API回传到广告系统中。
  （二）增加API数据回传日志，记录每次调用API回传的内容以及API应答信息，方便后续排查问题
  验证：自行验证，上线验证调用API回传数据，并回传成功；
  （一)自行验证
  根据后续投放归因场景，创建测试广告；
  根据线上数据，获取用户muid；
  手动调用API，填入muid，模拟手动回传一次转化数据；
  获得应答信息：{"errcode":0," errmsg":""}，则验证成功；
  注：
  验证成功，代表API回传通路正常，如果线上应答不成功，需要重点排查获取click_id，填写各种信息，自动回传的逻辑是否正常；
  验证失败，请参考 
  行为数据回传附录
  -『问题咨询流程』
  
  （二)上线验证
  创建广告；
  正常投放；
  确认API数据回传日志，有数据回传且应答信息正确； 无日志可以根据『附录-数据源报表查询』，根据raw_action_count是否有值，判断是否成功传入了行为数据；
  访问
  微信广告投放平台
  报表，数据指标是否有相应的数值显示；
  ActionType = ACTIVATE_APP，对应数据指标：APP激活次数；
  ActionType = REGISTER，对应数据指标：APP注册次数；
  ActionType = ADD_TO_CART，对应数据指标：APP加入购物车次数；
  ActionType = PURCHASE，对应数据指标：APP付费次数；
  三、附录
  详见
  行为数据回传附录
  
  
  通过SDK方式回传APP内转化行为数据。
  说明： 1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读； 2）联调时，请以回传示例格式为准，确保联调正常；
  使用场景
  SDK支持回传的全部行为详见
  行为数据回传参数
  ，
  以下为效果衡量以及oCPM常用行为。
  行为名称
  ActionType
  推广目标
  说明
  微信广告投放平台指标
  作为oCPM优化目标
  激活
  ACTIVATE_APP
  推广应用
  用户下载应用后首次打开的操作行为。
  APP激活次数
  支持
  
  
  注册
  
  
  REGISTER
  
  
  推广应用
  用户在应用内完成注册，如手机号码验证、注册应用下账户、创建游戏角色、通过QQ微信号等方式通过授权或其他类注册行为
  
  
  APP注册次数
  
  
  支持
  
  加入购物车
  
  ADD_TO_CART
  
  推广应用
  用户在应用内发起购买而未完成付费的行为，如加入购物车、下单等。
  
  APP加入购物车次数
  
  暂未支持
  
  付费
  
  PURCHASE
  
  推广应用
  用户在应用内进行付费，完成了交易的操作行为。
  
  APP付费次数
  
  暂未支持
  次留
  START_APP
  推广应用
  用户完成应用激活后，第二天继续进入APP
  APP次留人数
  暂未支持
  问题咨询
  开发过程中遇到任何问题可以参考以下流程解决：
  1.查看【
  行为数据回传附录
  -常见问题解答】中是否有类似的问题；
  
  2.参见【
  行为数据回传附录
  -问题咨询流程】对接人工客服；
  对接流程
  
  创建行为数据源登录
  微信广告投放平台
  -『人群管理』-『高级拓展』进入DMP页面，在“数据接入”页面创建App用户行为数据源。
  iOS应用
  ：
  行为数据源的类型选择iOS，填写相应的应用ID，输入数据源名称创建一个数据源；
  记录DMP给App数据源分配的两个ID，行为数据源ID（UserActionSetID）和AppSecretKey；
  Android应用
  ：
  行为数据源的类型选择Android，填写相应的应用ID，输入数据源名称创建一个数据源；
  记录DMP给App数据源分配的两个ID，行为数据源ID（UserActionSetID）和AppSecretKey；
  开始对接进入
  转化数据接入中心
  下载需要的SDK文件。根据 SDK 压缩包内的接入文档开始对接；
  iOS应用
  ：
  GDTActionSDK-1.0.0.framework
   文件为 App 需要嵌入的 SDK；
  GDTActionSDKSample
   是我们提供的SDK接入示例工程。
  
  注：本文档提到的
  GDTActionSDK-x.x.x.framework
  在的
  x.x.x
  指的是你实际下载的SDK版本。
  Android应用
  ：
  GDTActionSDK.min.x.x.x.jar
   文件为 App 需要嵌入的 SDK；
  GDTActionSDKDemo
   是我们提供的SDK接入示例工程。
  
  注：本文档提到的
  GDTActionSDK.min.x.x.x.jar
  中的
  x.x.x
  指的是你实际下载的SDK版本。
  用途说明回传转化行为用于效果衡量或oCPM
  ：支持的行为类型见本文顶部『使用场景』；
  回传用户行为用于DMP人群创建
  ：支持的行为类型见
  行为参数
  ；  
`,
  231: `
一、API方案介绍
在微信广告推广H5页面时，用户进入H5中会产生对应的转化行为（如下单、资料收集等），为了量化广告转化效果，以及积累转化数据以使用智能优化（oCPM/oCPA）能力，需要回传用户的转化行为。本API解决的是H5转化行为回传的问题
说明： 1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读； 2）联调时，请以回传示例格式为准，确保联调正常；
使用须知
（一） 对接流程简介
0.请使用已开通广告主身份的公众号或小程序身份进行联调，小游戏和游戏类小程序无法调用联调。
1.在
微信公众平台
的『开发』—『基本配置』中注册成为开发者；
2.创建转化数据对应的数据源；
3.获取用户click_id，根据转化行为、推广目标，选择对应的行为类型回传数据，构造请求回传数据至对应的行为源，需要确保回传成功；
注：用户点击广告进入落地页后，广告平台会在URL增加click_id。即，URL中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』。
4.例行化：确保线上实际投放时，用户发生转化后，会自动实时运行步骤2，调用API回传数据，并回传成功；
5.验证：判断步骤3是否正常运行； 注：对于二次接入本API的广告主账号，可以跳过1、2步骤； 建议对接人员：建议后台开发同学对接本API；
(二) 问题咨询流程
开发过程中遇到任何问题可以参考以下流程解决
1.查看FAQ中是否有类似的问题；
2.根据【
行为数据回传附录
-返回码】，查询是否有相关说明，如果未检索到对应内容，访问公众平台开发者文档再次查询；
3.参见【
行为数据回传附录
-问题咨询流程】对接人工客服；
使用背景
(一) 目前支持的行为类型以及对应的智能投放优化目标、数据指标如下：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广商品
下单量
如电商商品被下单
预约
RESERVATION
收集销售线索
销售线索量
如提交联系信息，预约看车
确认有效销售线索
CONFIRM_EFFECTIVE_LEADS
收集销售线索
有效销售线索
如电话呼叫成功
付费销售线索
PURCHASE
收集销售线索
首次付费人数/网页付费次数
如销售线索产生最终付费
注册
REGISTER
收集销售线索
网页注册人数
如金融业务注册人数
（二）目前支持的广告流量包括
1.公众号底部和文中：品牌活动推广、电商推广、销售线索收集广告的H5落地页；
2.朋友圈信息流：品牌活动推广、本地推广、电商推广、销售线索收集广告的H5落地页；
原理介绍
（一）对于落地页为H5的广告而言，在微信广告平台推广时，每次点击都会生成一个 click_id，在跳转到落地页时， 会将 click_id 作为参数传入对应的 URL 中
（二）回传转化数据时，需要回传click_id与转化行为，广告平台会通过click_id关联到该次转化对应的广告，从而得到点击与转化的关联
（三）关联后计算的广告效果会呈现在
微信广告投放平台
广告主报表中，并会成为智能优化的数据基础。
二、对接步骤

准备阶段：成为公众平台开发者，创建数据源目标：获取开发者ID、密码和access_token 步骤：
特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调。
1. 进入
注册页面
，点击左边栏，『开发』下『基本配置』。同意《微信公众平台开发者服务协议》后，点击『成为开发者』；

2. 获取开发者密码。点击“重置”按钮：

3. 弹窗提示，点击“确定重置”按钮：

4. 点击“开始”按钮：

5. 选择验证方式进行验证：

6. 验证完成之后扫码绑定微信号，绑定成功后重置开发者密码。然后微信上点击确认，进行第二步密码验证：

7. 密码验证后，即可查看开发者密码。由于开发者密码不会直接显示在微信广告投放平台后台，因此需要开发者保存。开发者密码为重要账号凭据，建议不要外传。

8. 获取access_token。在开发——基本配置中点击“获取access_token”,用之前注册的开发者id和生成的开发者密码调用接口获取access_token。

（二） 创建数据源
目标：创建数据源，生成数据源ID（user_action_set_id） 步骤：
构造请求，创建数据源；
保存数据源ID，用于后续回传数据；
请求地址： user_action_sets/add
请求方法： POST
请求参数：
名称
类型
描述
Type
enum
用户行为源类型，WEB
Name
string
用户行为源名称，必填
description
string
用户行为源描述，字段长度最小 1 字节，长度最大 128 字节
请求示例：
curl -i "https://api.weixin.qq.com/marketing/user_action_sets/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-H "Content-Type: application/json" 
-d '{ 
	"type": "WEB", 
	"name": "wxadtest",
	"description": "test"
	 }'
应答字段：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口] 创建用户行为源时分配的唯一 id
应答示例：
{
    	"errcode":0, "
	"errmsg":""
    "data": {
        "user_action_set_id": "<USER_ACTION_SET_ID>"
    }
}
正式对接：获取click_id，并进行加密，确定行为类型，回传数据（一） 获取用户click_id
目标
：获取访问H5的用户click_id，作为回传数据的用户标识；
步骤
：
1.获取click_id
落地页为H5：用户点击广告进入落地页后，广告平台会在URL增加click_id。即，URL中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』；
click_id格式：18位或16位长度字符串；
2.传递click_id 如果存在二跳页面，建议页面增加逻辑向下传递click_id。即，访问下一页面时，网页参数中增加click_id信息；
3.记录click_id 用户发生转化时，记录发生转化的click_id；
（二） 确定行为类型
目标
：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型； 
步骤
： 根据以下建议，确认后续API回传时需要填写的Action_Type：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广商品
下单量
如电商商品被下单
预约
RESERVATION
收集销售线索
销售线索量
如提交联系信息，预约看车，金融业务注册申请等
确认有效销售线索
CONFIRM_EFFECTIVE_LEADS
收集销售线索
有效销售线索
如电话呼叫成功
付费销售线索
PURCHASE
收集销售线索
首次付费人数/网页付费次数
如销售线索产生最终付费
注册
REGISTER
收集销售线索
网页注册人数
如金融业务注册人数
（三）回传数据
目标
：根据click_id、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
步骤
：
1. 前提 在传入转化行为数据之前，请确保开发者已经：
注册成为开发者，并获取了可用的在有效期内的token
已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见附录；
2. 确认上报数据字段，参数说明如下：
名称
类型
必填
限制
说明
user_action_set_id
integer
yes

用于标识数据归属权。



url



string



yes

转化行为发生页面的URL，小程序小游戏需要在页面路径前增加『http://www.』 ， 或直接填写 『http://www.qq.com』

校验逻辑：

1.以『http://www.』 开头；

2.必须为纯小写；

3.必须包含『.』


action_time


integer


yes

行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，UNIX时间，单位为秒，如果不填将使用服务端时间填写
action_type
enum
yes

预定义的行为类型，详见上方表格



click_id



string



yes

落地页URL中的click_id，对于微信流量为URL中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』。小程序环境获取方法
参考数据监控指引





outer_action_id





string





no

去重标识，平台会基于user_action_set_id，outer_action_id 和action_type三个字段做去重 。

如果历史上报数据中存在某条数据的这三个字段与当前上报数据完全一样的，则当前数据会被过滤掉。

注：字段长度最小1字节，最大长度255字节，且只能为数字，字母，下划线，连接符组成。


action_param


string


no


回传有效销售线索必填
行为所带的参数，转化行为价值（例如金额），详见附录，字段长度最小 1 字节，长度最大 204800 字节

value

Int

no

代表订单金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000
leads_type
enum
no
回传有效销售线索必填
有效线索的来源区分，目前支持PHONE（电话直呼），RESERVE（表单预约）
3. 调用API，回传数据 示例：需要统计“下单”的转化行为，开发者只需要在下单转化行为发生时，上报action_type=“COMPLETE_ORDER”，且附上由落地页获取的 click_id。
请求示例：
curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-d  '{
	"user_action_set_id":"<USER_ACTION_SET_ID>",
	"actions":[
		{
		    "url":"<URL>",
		    "action_time":1513077790,
		    "action_type":"COMPLETE_ORDER",
		    "trace":{
			"click_id":"<CLICK_ID>"
			},
		    "action_param":{
			"value": 40
		    }
		}
		]
	}' 
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，详见『附录-问题排查流程』。
请求回传有效销售线索示例：
curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-d  '{ 
	"user_action_set_id":"<USER_ACTION_SET_ID>",
	"actions":[
		{
		    "url":"<URL>",
		    "action_time":1513077790,
		    "action_type":"CONFIRM_EFFECTIVE_LEADS",
		    "trace":{
			"click_id":"<CLICK_ID>"
			},
		    "action_param":{
			"value": 40，
			"leads_type": “RESERVE"
		    }
		}
		]
	}' 
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}
例行化：确保线上实际投放时，用户发生转化后，会自动实时运行第2步[正式对接]（一）确保广告实际投放中，用户发生转化后，步骤四能够正常运行，自动获取用户的click_id，并通过API回传到广告系统中。
（二）增加API数据回传日志，记录每次调用API回传的内容以及API应答信息，方便后续排查问题
验证：自行验证，上线验证调用API回传数据，并回传成功；
（一)自行验证
根据后续投放归因场景，创建测试广告；
根据线上数据，获取用户链接中的click_id；
手动调用API，填入click_id，模拟手动回传一次转化数据；
获得应答信息：{"errcode":0," errmsg":""}，则验证成功； 注：
验证成功，代表API回传通路正常，如果线上应答不成功，需要重点排查获取click_id，填写各种信息，自动回传的逻辑是否正常；
验证失败，请参考 章节一：问题咨询流程
（二)上线验证
创建广告；
正常投放；
确认API数据回传日志，有数据回传且应答信息正确； 无日志可以根据『附录-数据源报表查询』，根据raw_action_count是否有值，判断是否成功传入了行为数据；
访问MP投放端报表，数据指标是否有相应的数值显示；
ActionType = COMPLETE_ORDER对应数据指标：下单量；
ActionType = RESERVATION对应数据指标：销售线索量；
ActionType = CONFIRM_EFFECTIVE_LEADS对应数据指标：有效销售线索量；
三、附录
问题排查流程查看FAQ中是否有类似的问题；
根据错误码查询附录中『附录-API相关信息-返回码』，查询是否有相关说明，如果未检索到对应内容，访问
公众平台开发者文档
再次查询；
参见下方第3点-『问题咨询流程』，对接人工客服。
FAQ回传数据请求接口是否需要设置所有的参数？
可以按需设置，建议你设置所有参数，在你的服务端可以自由取舍。
回传的数据是否100%准确？
API回传不可避免的会产生部分数据的遗漏，同时不符合规范的上报也会被过滤。
除了下单和预约表单，是否还会支持别的转化类型上报，如加车、收藏等？
目前微信广告仅支持这两种，需要广告主将想要统计的转化对应到这两种类型上，其他类型会尽快支持。
上线后，需要将ip加白名单，才能获取access_token么？
是的。
错误提示：{"errcode":900355202,"errmsg":"actionSet create request too frequently"}
需要配置IP白名单，登录“微信公众平台-开发-基本配置”提前将服务器IP地址添加到IP白名单中，点击查看设置方法，否则将无法调用成功。

错误提示：{errcode=48001, errmsg=api unauthorized}
公众号广告主未审核通过，或者IP白名单未添加导致的,IP白名单未添加参见FAQ第5条；
更多常见问题
反馈建议
问题咨询流程对接API过程中，如果涉及API无法调通，报错无法解决的问题，技术咨询可进入腾讯广告开发者专区https://developers.e.qq.com，点击页面右下角侧“问号Logo”，通过反馈中心进行反馈，会有专人及时处理，感谢你的理解与配合!如API可正常使用，但对归因结果数据有疑惑，请咨询『微信广告助手』注：咨询时请注明使用的API名称和使用背景，附上对接文档方便快速定位问题。

数据源查询请求地址： user_action_sets/get
请求方法：GET
请求参数：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过  [user_action_sets 接口] 创建用户行为源时分配的唯一id
请求示例：
curl -G 'https://api.weixin.qq.com/marketing/user_action_sets/get?version=v1.0&access_token=<ACCESS_TOKEN>'

-d "user_action_set_id":"<USER_ACTION_SET_ID>"
应答字段：
名称
类型
描述
list
struct[]
返回数组列表
user_action_set_id
integer
用户行为源 id，通过  [user_action_sets 接口]  创建用户行为源时分配的唯一id

type

enum
用户行为源类型，WEBhttps://developers.e.qq.com/docs/reference/enum - api_user_action_set_type
name
string
用户行为源名称，必填
description
string
用户行为源描述
activate_status
boolean
数据接入状态， true 表示已接入， false 表示未接入
created_time
string
创建时间，格式为 yyyy-MM-dd HH:mm:ss,如 2016-11-01 10:42:56
应答示例：
{ "data":{ "list":[ { "user_action_set_id":<USER_ACTION_SET_ID>, "type":"WEB", "name":"wxadtest", "description":"test", "activate_status":true, "created_time":"2017-12-11 17:14:17" } ] }, "errcode":0, " "errmsg":"" }
数据源报表查询请求地址：user_action_set_reports/get
请求方法：GET
请求参数：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口]  创建用户行为源时分配的唯一 id

date_range

struct
时间范围，日期格式，{"start_date":"2017-03-01","end_date":"2017-04-02"}，需要进行urlencode转码（即date_range对应的value整体需要转码）

start_date

string
开始时间点对应的时间戳，小于或等于 end_date。字段长度最小 10 字节，长度最大 10 字节

end_date

string
结束时间点对应的时间戳，小于或等于今天，且大于或等于 start_date。字段长度最小 10 字节，长度最大 10 字节


time_granularity


enum
时间粒度，针对流量的粒度，可选值： DAILY （按天汇总），HOURLY （按小时汇总），默认小时，参考下方该参数的枚举值https://developers.e.qq.com/docs/reference/enum - api_time_granularity 枚举列表：{ DAILY, HOURLY }

aggregation

enum
聚合维度，是否将结果按照指定类型细分，可选值'DOMAIN', 'ACTION_TYPE'，参考下方该参数的枚举值。 枚举列表：{ DOMAIN, ACTION_TYPE }
请求示例：
curl -G 'https://api.weixin.qq.com/marketing/user_action_set_reports/get?version=v1.0&access_token=<ACCESS_TOKEN>' -d 'user_action_set_id=<USER_ACTION_SET_ID>' -d 'date_range={ "start_date": "2017-04-24", "end_date": "2017-05-01" }'

-d 'time_granularity=DAILY' -d 'aggregation=ACTION_TYPE'
应答字段：
名称
类型
描述
list
struct[]
返回数组列表
date
string
采样日期，格式： yyyy-MM-dd
hour
integer
小时，当 time_granularity=HOURLY 时有值，返回格式 HH
domain
string
行为发生的域名，当 aggregation=DOMAIN 时有值
action_type
enum
预定义的行为类型，当 aggregation=ACTION_TYPE 时有值，参考附录中的action_type
custom_action
string
自定义行为类型，当 aggregation=ACTION_TYPE 时有值
raw_action_count
integer
原始上报行为数
identified_action_count
integer
可识别的行为数
identified_user_count
integer
可识别的独立用户数，当没有指定 aggregation 时，有值
应答示例：
{ "data":{ "list":[ { "date":"2017-12-12", "action_type":"COMPLETE_ORDER", "custom_action":"", "raw_action_count":4000, "identified_action_count":2000 } ] }, "errcode":0, " "errmsg":"" }
API相关信息枚举值
时间粒度 | time_granularity
名称
描述
DAILY
按天汇总
HOURLY
按小时汇总
聚合方式|aggregation
名称
描述
DOMAIN
按域名汇总
ACTION_TYPE
按行为类型汇总
预定义标准的行为类型 | action_type
名称
描述
COMPLETE_ORDER
下单
RESERVATION
预约
action_param结构
action_param是一个Map，key类型为String，value的类型支持以下几种：
Int或Int[]: 64位整数；
Double或Double[]: 最大值100000000000(一千亿)，保留3位小数精度，超过的截断，而非四舍五入；
Boolean或Boolean[]: 支持字面值为：true,false；
String或String[]: 字符串；
其类型约束在服务端控制，如果不满足约束，将返回对应的错误。
返回码：查看返回码-消息提示-描述返回码
提示消息
描述
0
success
操作成功，没有错误
18001
Your request is missing a required parameter. The required parameter is '{PARAM}'
缺少必要的参数，参数名：{Param}
18002
Parameter '{PARAM}' must be {TYPE}.
参数{Param}必须是{TYPE}
18003
The value you specified for '{PARAM}' is invalid. Valid values must be less than {PARAM}.
参数{Param}必须小于{Value}
18004
The value you specified for '{PARAM}' is invalid. Valid values must be greater than {PARAM}.
参数{Param}必须大于{Value}
18005
The value is invalid for the associated parameter '{PARAM}'.
参数{Param}的数据格式不符合要求
18006
The value of parameter '{PARAM}' contains disallowed characters.
参数{Param}含有非法字符
18007
The parameter '{PARAM}' has too many characters.
参数{Param}长度太长
18008
The parameter '{PARAM}' has too few characters.
参数{Param}长度太短
18009
Parameter '{PARAM}' must be one of the following values: [{PARAM}].
参数{Param}值不在[{Enum}]中
18010
The type of the uploaded file is invalid.
文件类型不允许
18011
Your request contains too many values for '{PARAM}'. This parameter can have a maximum of {PARAM} value(s).
参数{Param}数组元素太多，最多有{Value}个
18012
Your request contains too few values for '{PARAM}'. This parameter must have a minimum of {PARAM} value(s).
参数{Param}数组元素太少，至少有{Value}个
18013
Parameter '{PARAM}' has too many decimal places. The maximum number of decimal places is {PARAM}.
参数{Param}小数位数太长，小数点后最多{Value}位
30000
We are unable to process your request at this time. Please retry your request. If you encounter this error repeatedly, please contact our dedicated operation team.
系统错误，请重试。如稳定复现请保留请求信息并向广点通官方反馈
30106
Your request is missing a required parameter. The required parameter is 'agency_token'.
缺少必要的参数，参数名：{agency_token}
30107
Binding to the agency has failed. Please check whether your account has already been bound.
新增服务商授权失败，请确认是否已经授权过
31001
Required parameter '{PARAM}' cannot be an empty string.
参数{Param}不能为空
31009
This operation is not permitted on this {PARAM}.
没有权限操作指定对象，对象名：{Object}
31010
The {PARAM} is invalid: it could have been deleted or never existed.
操作的对象不存在或已删除，对象名：{Object}
31011
The specified parameter '{PARAM}' referred to an entity which either does not exist or is not accessible to you.
参数{Param}错误，对应的数据不存在
31013
An {PARAM} is being added or renamed, but the name is already being used by another {PARAM}.
对象存在重名，对象名：{Object}
31014
The file failed MD5 check.
文件签名校验失败
31016
parameter value is too tiny
参数值太小
31026
campaign daily budget less than cost plus limit
推广计划日预算小于当前消耗加上最低修改幅度
31027
An object with the same 'outer_id' has already been created.
已使用相同的outer_id创建对象
31028
The 'outer_id' provided does not match our records.
outer_id不匹配
31030
New version should be greater than the existing version.
版本必须比当前版本新
31031
The parameter '{PARAM}' is not allowed to be modified.
参数{Param}不允许修改
31034
Parameter '{PARAM}' is invalid.
参数值错误，参数名：{Param}
31035
Your request must include at least one of {PARAM}.
以下参数必须至少设置一项，参数名：[{Param}]
31036
You can only provide one 'order_by' parameter.
只能提供一个order_by参数
31037
The uploaded file is too large.
上传文件过大
31038
You are not permitted to do this request.
请求没有权限
31099
Parameter is invalid.
参数值错误
32100
Your account balance is not enough.
余额不足
32102
Funds can only be transferred between accounts of the same type.
只能在同类型资金账户间划账
32103
Funds transfer is not supported by your account.
当前资金账户类型不支持划账
32104
The signature of the recharge message is invalid.
充值通知签名错误
32105
Transfer failed: the current account has more than {Value} funds with validity period.
划账失败，当前账户已超{Value}笔有效资金
32106
Funds are not allowed to be transferred to a frozen account.
不允许向冻结的账户划账
32107
The 'daily_budget' can only be set when the advertiser becomes active.
只有生效帐户才能设置日限额
32108
The duration of the parameter 'date_range' is beyond the allowed maximum.
参数date_range的时间跨度超过允许的范围
32109
Transfer limit reached. Please retry after one day.
超过每日划账次数限制，请明天再试
32203
The budget of the account has been modified too many times.
帐号预算修改次数太多
32206
mobile and telephone must set one of them
手机号和座机号不能同时为空
32207
No advertiser is found for the 'advertiser_id' provided in the request.
没有找到有效的广告主
32209
The agency is inactive.
代理商状态不可用
32210
The API can only be used by an agency.
调用方必须为代理商
32211
The advertiser is inactive.
广告主帐号当前不可用
32212
The 'daily_budget' was greater than the maximum allowed.
日限额太大
32213
The 'daily_budget' was less than the minimum allowed.
日限额太小
32214
current user status is not allowed to save drafts
当前广告主状态不允许保存草稿
32215
nothing changed for approval
调用update接口必须修改至少一项内容
32216
information is not complete for approval
提交审核需要的信息不完整
32217
no industry info provided
industry_id和outer_industry不能同时为空
32218
the qq of user has been registered
填写的QQ号已被注册为广告主
32219
The advertiser don't have any wechat account binding
广告主没有绑定微信公众号
32220
The wechat spid frozen can not be different from campaign's
该推广计划由其他服务商创建
32221
The 'daily_budget' must higher than current day budget.
日预算需要高于当前帐号的总消耗
32302
Campaign 'daily_budget' has been modified too many times.
推广计划限额修改次数太多
32306
Only suspended campaigns can be deleted.
只有暂停的计划才能被删除
32307
Campaign 'daily_budget' was too low. Please increase the 'daily_budget' and retry.
推广计划限额太小
32308
Parameter 'campaign_type' is not allowed to be modified.
计划类型不能被修改
32310
The 'daily_budget' was greater than the maximum allowed.
日限额太大
32311
The 'daily_budget' was less than the minimum allowed.
日限额太小
32312
The 'begin_date' must greater than now.
开始日期不得早于今日
32313
The city's level of point {PARAM} is defferent from other points in Adgroup's geo_location
所选的城市或商圈不属于同一出价级别
32402
Ad group time interval specified is invalid, 'end_date' cannot be earlier than 'begin_date'.
开始日期必须早于结束日期
32405
Parameters 'min_impression_include' and 'max_impression_include' must be used together.
最低曝光频次和最高曝光频次必须成对设置
32406
Parameter 'max_impression_include' cannot be less than 'min_impression_include'.
最高曝光频次不得小于最低曝光频次
32407
Parameter 'site_set' has already been set by the campaign.
推广计划上已经设置了投放站点
32408
A required parameter 'site_set' was not specified or is an empty string.
广告投放站点未设置
32409
Parameter 'timeset' has already been set by the campaign.
推广计划已经设置投放时段
32410
Campaigns of {Enum} type can only use 'bid_type' of {Enum}.
{Enum}类型推广计划只能使用{Enum}类型的计费方式
32413
Parameters 'begin_date' and 'end_date' have already been set by the campaign.
投放日期重复设置
32415
The bid on an ad group is not allowed to be higher than 50% of the daily budget of the campaign.
广告出价不得超过计划预算的50%
32416
The bid on an ad group is not allowed to be modified.
当前广告不允许修改出价
32417
The 'product_type' you specified is not allowed to be used by your campaign.
无法使用当前标的物类型
32419
the industry id of qualification code not exit
行业资质编码不存在
32420
the number of qualifications is illegal
营业执照号错误
32421
This targeting can not be modified
定向不能进行修改
32422
Thi bid is too samll or large
出价超出限制
32423
This campaign is allowed to have {PARAM} adgroups
当前推广计划下广告组数量超出限制
32424
The {PARAM} is different from other adgroups or it's campaign
属性{PARAM}与所属推广计划或推广计划下的其他广告组的不一致
32425
The wechat's adgroup allows its product_type in 'PRODUCT_TYPE_LBS_WECHAT' and 'PRODUCT_TYPE_LINK_WECHAT' only
微信广告组的商品类型只能为PRODUCT_TYPE_LBS_WECHAT、PRODUCT_TYPE_LINK_WECHAT
32426
The point {PARAM} is illegal in wechat's campaign
微信推广计划的参数非法，参数名：{Param}
32427
The bid is illegal in the city of level {PARAM}
出价不符合城市{Param}的级别要求
32428
The 'targeting_id' and 'targeting' can not appear at the same time
targeting_id和targeting不能同时使用
32429
The 'targeting' must be set and 'targeting_id' is not allowed
微信公众号及朋友圈广告不允许使用targeting_id，仅允许使用targeting
32430
The 'geo_location' must be set
定向geo_location不能为空
32431
The 'regions' and 'business_districts' can be empty at the same time.
regions和business_districts不能同时为空
32432
The 'location_types' must be the following values: 'RECENTLY_IN','VISITED_IN'.
location_types仅支持RECENTLY_IN、VISITED_IN
32432
The 'location_types' must be the {PARAM}
location_types仅支持{Param}
32433
The {PARAM} is not allowd
{Param}参数不允许使用
32504
The creative template cannot be used by the adgroup with the 'product_type' you specified.
当前规格不能被标的物类型为{Enum}的广告组使用
32506
adgroup_id and campaign_id is not match
广告组id和计划id不匹配
32507
The video type is invalid.
视频类型错误
32508
The video is not of legal dimensions.
视频尺寸不符合要求
32509
The image could not be stored.
存储图片失败
32510
The domain is not whitelisted for 'impression_tracking_url'.
曝光监控地址主域不在允许的白名单内
32513
Parameter 'destination_url' has already been set by the ad group.
广告组已经设置落地页地址
32514
Parameter 'creative_elements[{Param}]' is invalid.
创意元素creative_element中参数｛Param｝错误
32515
Parameters 'product_ref_id' in url and 'product_ref_id' in adgroup must match.
落地页地址中标的物ID与adgroup中标的物ID必须一致
32516
The ad must use a dynamic ad template since it is a dynamic ad.
当前广告是动态创意广告，必须使用动态创意规格
32517
Video length does not meet the specifications.
视频时长不符合要求
32518
Video file is too large.
视频文件大小不符合要求
32519
Video is pending conversion.
视频文件处理中，暂不可用
32520
The image is not of legal dimensions.
图片尺寸不符合要求
32521
Image file is too large.
图片文件过大
32523
Parameters 'site_set' and 'product_type' must be used together.
site_set和product_type两个筛选条件必须一起使用
32524
The creative elements do not meet the specifications of the creative template.
创意元素不符合规格要求
32525
Image file is too small.
图片文件过小
32526
Video transcoding has failed.
视频文件转码失败
32527
The creative template cannot be used on the 'site_set' of the adgroup.
当前规格不能在广告组对应的站点投放
32528
You are not permitted to use this creative template.
未授权使用该规格
32529
cannot use search ad creative currently
当前创意不可使用
32531
unmatched campaign_type group on adgroup and creative
创意和广告组上的广告类型不一致
32532
campaign product_type and ad_creative product_type is not match
推广计划的标的物类型和广告创意的标的物类型不匹配
32533
Adgroup site_set and AdCreative site_set is not match
广告组的站点和广告创意的站点不匹配
32534
Adgroup product_type and AdCreative product_type is not match
广告组的标的物类型和广告创意的标的物类型不匹配
32535
Adgroup product_ref_id and AdCreative product_ref_id is not match
广告组的标的物id和广告创意的标的物id不匹配
32536
The number of Wechat moments Ad in one campaign reach limit
同一推广计划下的微信朋友圈广告个数已达上限
32537
Wechat moments Ad in one campaign must refers the same ad_creative
同一推广计划下的微信朋友圈广告仅能关联同一广告创意
32538
This Adgroup in the Wechat moments Campaign already refers one AdCreative
微信朋友圈广告仅能关联一个广告创意
32539
This Adgroup in Wechat offical account Campaign already refers one Creative
微信公众号广告仅能关联一个广告创意
32540
AdCreative's campaign must set the placement CAMPAIGN_TYPE_WECHAT_MOMENTS
朋友圈创意必须归属于朋友圈推广计划
32541
The number of AdCreative associations reaches the limit
创意数量达到限制
32542
Wechat moments ad only support one image
微信朋友圈广告仅支持一张图片
32544
Creative elements's texts at most have 4 rows
创意元素的文字描述最多4行
32545
Wechat moments ad are not allowed modified after exposure
微信朋友圈广告一旦有过曝光后，即不允许修改
32605
Parameter 'app_behavior[object_type]' cannot be found.
app_behavior下object_type不存在
32606
Parameter 'app_behavior[object_type]' must be a leaf node.
app分类必须指定最细级别
32607
Parameters 'location' and 'area' cannot be used together.
不能同时使用位置和地域定向
32609
Parameter 'targeting_setting[{Param}]' is invalid.
定向详细条件中{Param}错误
32610
You have selected a Min '{Param}' greater than Max '{Param}', you should select a valid range.
区间错误: 参数{Param}的上限大于下限
32615
Parameter 'targeting_setting[ad_behavior]' is invalid. The action is not allowed to be used by your account.
当前帐号不允许使用该行为作为定向
32702
Too many APP products are created in this month.
每月创建的APP标的物超上限
32705
Required parameter 'app_id' cannot an empty string.
app id不能为空
32706
The app with the 'product_ref_id' cannot be found.
未发现对应的app
32708
Subordiante 'product_ref_id' cannot be found.
未发现对应的渠道包id
32709
The preview image of the subordinate product cannot be found.
视频说说缩略图不存在
32710
A product is being added, but the 'product_refs_id' is already being used by another product.
请不要重复创建标的物
32711
The pc app identified with the 'product_id' cannot be found.
找不到对应的开发平台PC应用
32712
The name of the pc app is not available.
获取开放平台PC应用名称失败
32713
The product type not support yet
标的物类型暂不支持
32801
The 'group_by' condition is invalid.
无效的聚合条件
32803
Parameter 'date' is before allowed minimum or after allowed maximum.
报表日期超限
32804
Parameter 'order_by' is invalid.
当前的排序规则不支持
32805
Report type and level not match.
报表的类型和层级不匹配
32901
The uploaded file is invalid.
上传文件为空
32902
The type of the uploaded file is not supported.
文件类型不支持
32903
The image identified with the URL cannot be found.
URL指定的图片无法正常读取
32904
The duration of the file is beyond the allowed maximum.
文件播放时间太长
50002
account id invalid
account_id无效
51000
parameter error
参数异常
51001
system error
系统异常
51002
unknown protocol error
无效的数据协议
52012
file extension invalid
无效的文件类型
52015
file size exceeds limit.
文件大小超过限制
通过JS代码回传网页内转化行为数据。
说明： 1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读； 2）联调时，请以回传示例格式为准，确保联调正常；
使用场景
JS支持回传的全部行为详见
行为数据回传参数
，
以下为效果衡量以及oCPM常用行为。
行为名称
ActionType
推广目标
------说明------
限制
MP投放端指标
作为oCPM优化目标
下单
COMPLETE_ORDER
推广商品
下单量
如电商商品被下单


预约
RESERVATION
收集销售线索
销售线索量
如提交联系信息，预约看车


确认有效销售线索
CONFIRM_EFFECTIVE_LEADS
收集销售线索
有效销售线索
如电话呼叫成功


付费销售线索
PURCHASE
收集销售线索
首次付费人数/网页付费次数
如销售线索产生最终付费


注册
REGISTER
收集销售线索
网页注册人数
如金融业务注册人数


问题咨询
开发过程中遇到任何问题可以参考以下流程解决：
1.查看【
行为数据回传附录
-常见问题解答】中是否有类似的问题；

2.参见【
行为数据回传附录
-问题咨询流程】对接人工客服；

对接流程
1.创建行为数据源登录
MP系统
-『人群管理』-『高级拓展』进入DMP页面，在『数据接入』-『Web网站数据』，点击『创建web数据源』。
2.嵌入JS代码创建完成后，在当前页面，点击『获取跟踪代码』，根据
JS代码嵌入说明
嵌入JS代码完成上报。
步骤：
在网站头部添加【基础代码】
在特定页面添加【行为代码】
查看数据接入监测报
3.用途说明1）回传转化行为用于效果衡量或oCPM
：支持的行为类型见本文顶部『使用场景』；
1）回传用户行为用于DMP人群创建
：支持的行为类型见
行为参数
；
`,
  232: `一、API方案介绍
在微信广告推广小程序页面时，用户进入小程序中会产生对应的转化行为（如下单、资料收集等），为了量化广告转化效果，以及积累转化数据以使用智能优化（oCPM/oCPA）能力，需要回传用户的转化行为。本 API 解决的是小程序转化行为回传的问题，暂不支持小游戏类型接入
说明： 1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读； 2）联调时，请以回传示例格式为准，确保联调正常；
使用须知
（一） 对接流程简介
特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调，小游戏和游戏类小程序无法调用联调。
1.在
微信公众平台
的『开发』—『基本配置』中注册成为开发者；
2.创建转化数据对应的数据源；
3.获取用户click_id，根据转化行为、推广目标，选择对应的行为类型回传数据，构造请求回传数据至对应的行为源，需要确保回传成功；
注：用户点击广告进入落地页后，广告平台会在页面path增加click_id。即，页面path中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』，参考
数据监控指引
。
4.例行化：确保线上实际投放时，用户发生转化后，会自动实时运行步骤2，调用API回传数据，并回传成功；
5.验证：判断步骤3是否正常运行； 注：对于二次接入本API的广告主账号，可以跳过1、2步骤； 建议对接人员：建议后台开发同学对接本API；
(二) 问题咨询流程
开发过程中遇到任何问题可以参考以下流程解决
1.查看FAQ中是否有类似的问题；
2.根据【
行为数据回传附录
-返回码】，查询是否有相关说明，如果未检索到对应内容，访问公众平台开发者文档再次查询；
3.参见【
行为数据回传附录
-问题咨询流程】对接人工客服；
使用背景
(一) 目前支持的行为类型以及对应的智能投放优化目标、数据指标如下：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广商品
下单量
如电商商品被下单
预约
RESERVATION
收集销售线索
销售线索次数
如提交联系信息，预约看车
确认有效销售线索
CONFIRM_EFFECTIVE_LEADS
收集销售线索
有效销售线索
如电话呼叫成功
付费销售线索
PURCHASE
收集销售线索
首次付费人数/网页付费次数
如销售线索产生最终付费
注册
REGISTER
收集销售线索
网页注册人数
如金融业务注册人数
注：外卖行业详见以下正式流程；
（二）目前支持的广告流量包括
1.公众号底部和文中：品牌活动推广、电商推广、销售线索收集广告的小程序落地页；
2.朋友圈信息流：品牌活动推广、本地推广、电商推广、销售线索收集广告的小程序落地页；
原理介绍
（一）对于落地页为小程序的广告而言，在微信广告平台推广时，每次点击都会生成一个 click_id，在跳转到落地页时， 会将 click_id 作为参数传入对应的 小程序 中
（二）回传转化数据时，需要回传click_id与转化行为，广告平台会通过click_id关联到该次转化对应的广告，从而得到点击与转化的关联
（三）关联后计算的广告效果会呈现在
微信广告投放平台
广告主（后简称“MP投放端”）报表中，并会成为智能优化的数据基础。
二、对接步骤
准备阶段：成为公众平台开发者，创建数据源（一） 注册成为开发者
目标：获取开发者ID、密码和access_token 步骤：
特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调。
1.进入「
微信公众平台
 - 设置 - 开发设置」获取appid；

2.获取access_token，
调用接口获取access_token
。
（二） 创建数据源
目标：创建数据源，生成数据源ID（user_action_set_id） 步骤：
构造请求，创建数据源；
保存数据源ID，用于后续回传数据；
请求地址： user_action_sets/add
请求方法： POST
请求参数：
名称
类型
描述
Type
enum
用户行为源类型，WEB
Name
string
用户行为源名称，必填
description
string
用户行为源描述，字段长度最小 1 字节，长度最大 128 字节
请求示例：
curl -i "https://api.weixin.qq.com/marketing/user_action_sets/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-H "Content-Type: application/json" 
-d '{ 
	"type": "WEB", 
	"name": "wxadtest",
	"description": "test"
	 }'
应答字段：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口] 创建用户行为源时分配的唯一 id
应答示例：
{
    	"errcode":0, "
	"errmsg":""
    "data": {
        "user_action_set_id": "<USER_ACTION_SET_ID>"
    }
}
正式对接：获取click_id，并进行加密，确定行为类型，回传数据（一） 获取用户click_id
目标
：获取访问小程序的用户click_id，作为回传数据的用户标识；
步骤
：
获取click_id
获取方法：用户点击广告进入落地页后，广告平台会在落地页增加click_id。即，页面path中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』
，
参考
数据监控指引
click_id格式：18位或16位长度字符串；
格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』
传递click_id 如果存在二跳页面，建议页面增加逻辑向下传递click_id。即，访问下一页面时，网页参数中增加click_id信息；
记录click_id 用户发生转化时，记录发生转化的click_id；
（二） 确定行为类型
目标
：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型； 
步骤
： 根据以下建议，确认后续API回传时需要填写的Action_Type：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广商品
下单量
如电商商品被下单
预约
RESERVATION
收集销售线索
销售线索次数
如提交联系信息，预约看车，金融业务注册申请等
确认有效销售线索
CONFIRM_EFFECTIVE_LEADS
收集销售线索
有效销售线索
如电话呼叫成功
付费销售线索
PURCHASE
收集销售线索
首次付费人数/网页付费次数
如销售线索产生最终付费
注册
REGISTER
收集销售线索
网页注册人数
如金融业务注册人数
三）回传数据
目标
：根据click_id、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
步骤
：
1.前提 在传入转化行为数据之前，请确保开发者已经：
注册成为开发者，并获取了可用的在有效期内的token
已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见附录；
2.确认上报数据字段，参数说明如下：
名称
类型
必填
限制
说明
user_action_set_id
integer
yes
用于标识数据归属权



url


string


yes
转化行为发生页面的URL，小程序可在路径前增加"http://www." 或直接填写 "http://www.qq.com"

校验逻辑：

1.以『http://www.』 开头；

2.必须为纯小写；

3.必须包含『.』



action_time


integer


yes
行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，UNIX时间，单位为秒，如果不填将使用服务端时间填写



action_type


enum


yes
预定义的行为类型，目前只支持COMPLETE_ORDER（下单）及RESERVATION（表单预约）、CONFIRM_EFFECTIVE_LEADS（有效销售线索）



click_id


string


yes
目前仅支持click_id 落地页URL中的click_id，对于微信流量为URL中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』。小程序环境获取方法参考
数据监控指引





outer_action_id




string




no

去重标识，平台会基于user_action_set_id，outer_action_id 和action_type三个字段做去重 

如果历史上报数据中存在某条数据的这三个字段与当前上报数据完全一样的，则当前数据会被过滤掉。

注：字段长度最小1字节，最大长度255字节，且只能为数字，字母，下划线，连接符组成。

action_param

string

no
行为所带的参数，转化行为价值（例如金额），详见附录，字段长度最小 1 字节，长度最大 204800 字节


value

Int

no
代表订单金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000


leads_type

enum

no

回传有效销售线索必填
有效线索的来源区分，目前支持PHONE（电话直呼），RESERVE（表单预约）
调用API，回传数据 示例：需要统计“下单”的转化行为，开发者只需要在下单转化行为发生时，上报action_type=“COMPLETE_ORDER”，且附上由落地页获取的 click_id。
请求示例：
curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-d  '{ 
	"user_action_set_id": "<USER_ACTION_SET_ID>",
	"actions":[
		{
		    "url":"<URL>",
		    "action_time":1513077790,
		    "action_type":"COMPLETE_ORDER",
		    "trace":{
			"click_id":"<CLICK_ID>"
			},
		    "action_param":{
			"value": 40
		    }
		}
		]
	}' 
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，详见『附录-问题排查流程』。
请求回传有效销售线索示例：
curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-d  '{ 
	"user_action_set_id": "<USER_ACTION_SET_ID>",
	"actions":[
		{
		    "url":"<URL>",
		    "action_time":1513077790,
		    "action_type":"CONFIRM_EFFECTIVE_LEADS",
		    "trace":{
			"click_id":"<CLICK_ID>"
			},
		    "action_param":{
			"value": 40，
			"leads_type": “RESERVE"
		    }
		}
		]
	}' 
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，详见『附录-问题排查流程』。
[外卖行业]专属流程：正式对接（一） 获取用户click_id
目标
：获取访问小程序或H5落地页的用户click_id，作为回传数据的用户标识；
步骤
：
获取click_id
落地页为小程序环境获取方法参考
数据监控指引
落地页为H5：用户点击广告进入落地页后，广告平台会在URL增加click_id。即，URL中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』；
click_id格式：18位或16位长度字符串；
传递click_id 如果存在二跳页面，建议页面增加逻辑向下传递click_id。即，访问下一页面时，网页或小程序路径参数中增加click_id信息；
记录click_id 用户发生转化时，记录发生转化的click_id；
（二） 确定行为类型
目标
：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型； 
步骤
： 根据以下建议，确认后续API回传时需要填写的Action_Type：
页面访问
VIEW_CONTENT
推广门店
数据指标
说明
页面访问
VIEW_CONTENT
推广门店
暂无

下单
COMPLETE_ORDER
推广门店
下单量
如用户点击下单按钮且下单成功
付费
PURCHASE
推广门店
付费量
必备字段，如下单后完成支付行为
（三）回传数据
目标
：根据click_id、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
步骤
：
1.前提 在传入转化行为数据之前，请确保开发者已经：
注册成为开发者，并获取了可用的在有效期内的token
已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见附录；
2.确认上报数据字段，参数说明如下：
名称
类型
必填
限制
说明
user_action_set_id
integer
yes

用于标识数据归属权



url



string



yes

转化行为发生页面的URL，小程序小游戏需要在页面路径前增加『http://www.』 ， 或直接填写 『http://www.qq.com』

校验逻辑：

1.以『http://www.』 开头；

2.必须为纯小写；

3.必须包含『.』


action_time


integer


yes

行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，UNIX时间，单位为秒，如果不填将使用服务端时间填写


action_type


enum


yes

预定义的行为类型，支持COMPLETE_ORDER（下单）及VIEW_CONTENT（页面访问）、PURCHASE（付费）


click_id


string


yes

落地页URL中的click_id，对于微信流量为URL中的gdt_vid，格式为『wx0ewinbalytptma00』或『wx0ewinbalytptma』。小程序环境获取方法参考
数据监控指引


action_param


string


no

行为所带的参数，转化行为价值（例如金额），详见附录，字段长度最小 1 字节，长度最大 204800 字节


value


Int


no


建议回传
代表订单或付费金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000


user_locations


string


no

用户当前位置的经纬度信息，如22.5228070000,113.9353380000

注：必须使用gcj02坐标系，详见：
腾讯地图坐标系说明


order_detail


array


no

包括:

菜名

单价:分，例如商品单价40元，需赋值为4000

份数


shipping_locations


string


no

收货地址经纬度信息，依序为纬度，经度。如23.0413930,113.3730940

注：必须使用gcj02坐标系，详见：
腾讯地图坐标系说明
3.调用API，回传数据 示例：需要统计“下单”的转化行为，开发者只需要在下单转化行为发生时，上报action_type=“COMPLETE_ORDER”，且附上由落地页获取的 click_id。
请求示例：
curl -k "https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>" 
-d  '{ 
	"actions":[
		{
		    "user_action_set_id":"<USER_ACTION_SET_ID>",
		    "url":"<URL>",
		    "action_time":1513077790,
		    "action_type":"COMPLETE_ORDER",
		    "trace":{
			"click_id":"<CLICK_ID>"
			},
		    "action_param":{
			"value": 40
			"user_locations":"23.0413930,113.3730940",
			"order_detail":["米饭_500_2","番茄鸡蛋_1000_1"],
			"shipping_locations":"23.0413930,113.3730940"
		}
		]
	}' 
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，详见『附录-问题排查流程』。
例行化：确保线上实际投放时，用户发生转化后，会自动实时运行第2步[正式对接]一）确保广告实际投放中，用户发生转化后，步骤四能够正常运行，自动获取用户的click_id，并通过API回传到广告系统中。
（二）增加API数据回传日志，记录每次调用API回传的内容以及API应答信息，方便后续排查问题
验证：自行验证，上线验证调用API回传数据，并回传成功；
（一)自行验证
根据后续投放归因场景，创建测试广告；
根据线上数据，获取用户链接中的click_id；
手动调用API，填入click_id，模拟手动回传一次转化数据；
获得应答信息：{"errcode":0," errmsg":""}，则验证成功； 注：
验证成功，代表API回传通路正常，如果线上应答不成功，需要重点排查获取click_id，填写各种信息，自动回传的逻辑是否正常；
验证失败，请参考 章节一：问题咨询流程
（二)上线验证
创建广告；
正常投放；
确认API数据回传日志，有数据回传且应答信息正确； 无日志可以根据『附录-数据源报表查询』，根据raw_action_count是否有值，判断是否成功传入了行为数据；
访问MP投放端报表，数据指标是否有相应的数值显示；
ActionType = COMPLETE_ORDER对应数据指标：下单量；
ActionType = RESERVATION对应数据指标：销售线索次数；
三、附录
问题排查流程查看FAQ中是否有类似的问题；
根据错误码查询附录中『附录-API相关信息-返回码』，查询是否有相关说明，如果未检索到对应内容，访问
公众平台开发者文档
再次查询；
参见下方第3点-『问题咨询流程』，对接人工客服；
FAQ1. 回传数据请求接口是否需要设置所有的参数？
可以按需设置，建议你设置所有参数，在你的服务端可以自由取舍。
2. 回传的数据是否100%准确？
API回传不可避免的会产生部分数据的遗漏，同时不符合规范的上报也会被过滤。
3. 除了下单和预约表单，是否还会支持别的转化类型上报，如加车、收藏等？
目前微信广告仅支持这两种，需要广告主将想要统计的转化对应到这两种类型上，其他类型会尽快支持。
4. 上线后，需要将ip加白名单，才能获取access_token么？
是的。
5. 错误提示：{"errcode":900355202,"errmsg":"actionSet create request too frequently"}
需要配置IP白名单，登录“微信公众平台-开发-基本配置”提前将服务器IP地址添加到IP白名单中，点击查看设置方法，否则将无法调用成功。

6. 错误提示：{errcode=48001, errmsg=api unauthorized}
公众号广告主未审核通过，或者IP白名单未添加导致的,IP白名单未添加参见FAQ第5条；
更多常见问题
反馈建议
问题咨询流程对接API过程中，如果涉及API无法调通，报错无法解决的问题，技术咨询可进入腾讯广告开发者专区https://developers.e.qq.com，点击页面右下角侧“问号Logo”，通过反馈中心进行反馈，会有专人及时处理，感谢你的理解与配合!如API可正常使用，但对归因结果数据有疑惑，请咨询『微信广告助手』注：咨询时请注明使用的API名称和使用背景，附上对接文档方便快速定位问题。

数据源查询1.请求地址： user_action_sets/get
2.请求方法：GET
3.请求参数：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过  [user_action_sets 接口] 创建用户行为源时分配的唯一id
4.请求示例：
curl -G 'https://api.weixin.qq.com/marketing/user_action_sets/get?version=v1.0&access_token=<ACCESS_TOKEN>'

-d "user_action_set_id":"<USER_ACTION_SET_ID>"
5.应答字段：
名称
类型
描述
list
struct[]
返回数组列表
user_action_set_id
integer
用户行为源 id，通过  [user_action_sets 接口]  创建用户行为源时分配的唯一id
type
enum
用户行为源类型，WEBhttps://developers.e.qq.com/docs/reference/enum - api_user_action_set_type
name
string
用户行为源名称，必填
description
string
用户行为源描述
activate_status
boolean
数据接入状态， true 表示已接入， false 表示未接入
created_time
string
创建时间，格式为 yyyy-MM-dd HH:mm:ss,如 2016-11-01 10:42:56
6.应答示例：
{ "data":{ "list":[ { "user_action_set_id":<USER_ACTION_SET_ID>, "type":"WEB", "name":"wxadtest", "description":"test", "activate_status":true, "created_time":"2017-12-11 17:14:17" } ] }, "errcode":0, " "errmsg":"" }
数据源报表查询1.请求地址：user_action_set_reports/get
2.请求方法：GET
3.请求参数：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口]  创建用户行为源时分配的唯一 id
date_range
struct
时间范围，日期格式，{"start_date":"2017-03-01","end_date":"2017-04-02"}，需要进行urlencode转码（即date_range对应的value整体需要转码）
start_date
string
开始时间点对应的时间戳，小于或等于 end_date。字段长度最小 10 字节，长度最大 10 字节
end_date
string
结束时间点对应的时间戳，小于或等于今天，且大于或等于 start_date。字段长度最小 10 字节，长度最大 10 字节
time_granularity
enum
时间粒度，针对流量的粒度，可选值： DAILY （按天汇总），HOURLY （按小时汇总），默认小时，参考下方该参数的枚举值https://developers.e.qq.com/docs/reference/enum - api_time_granularity 枚举列表：{ DAILY, HOURLY }
aggregation
enum
聚合维度，是否将结果按照指定类型细分，可选值'DOMAIN', 'ACTION_TYPE'，参考下方该参数的枚举值。 枚举列表：{ DOMAIN, ACTION_TYPE }
4.请求示例：
curl -G 'https://api.weixin.qq.com/marketing/user_action_set_reports/get?version=v1.0&access_token=<ACCESS_TOKEN>' -d 'user_action_set_id=<USER_ACTION_SET_ID>' -d 'date_range={ "start_date": "2017-04-24", "end_date": "2017-05-01" }'

-d 'time_granularity=DAILY' -d 'aggregation=ACTION_TYPE'
5.应答字段：
名称
类型
描述
list
struct[]
返回数组列表
date
string
采样日期，格式： yyyy-MM-dd
hour
integer
小时，当 time_granularity=HOURLY 时有值，返回格式 HH
domain
string
行为发生的域名，当 aggregation=DOMAIN 时有值
action_type
enum
预定义的行为类型，当 aggregation=ACTION_TYPE 时有值，参考附录中的action_type
custom_action
string
自定义行为类型，当 aggregation=ACTION_TYPE 时有值
raw_action_count
integer
原始上报行为数
identified_action_count
integer
可识别的行为数
identified_user_count
integer
可识别的独立用户数，当没有指定 aggregation 时，有值
6.应答示例：
{ "data":{ "list":[ { "date":"2017-12-12", "action_type":"COMPLETE_ORDER", "custom_action":"", "raw_action_count":4000, "identified_action_count":2000 } ] }, "errcode":0, " "errmsg":"" }
API相关信息1. 枚举值
时间粒度 | time_granularity
名称
描述
DAILY
按天汇总
HOURLY
按小时汇总
聚合方式|aggregation
名称
描述
DOMAIN
按域名汇总
ACTION_TYPE
按行为类型汇总
预定义标准的行为类型 | action_type
名称
描述
COMPLETE_ORDER
下单
RESERVATION
预约
2. action_param结构
action_param是一个Map，key类型为String，value的类型支持以下几种：
Int或Int[]: 64位整数；
Double或Double[]: 最大值100000000000(一千亿)，保留3位小数精度，超过的截断，而非四舍五入；
Boolean或Boolean[]: 支持字面值为：true,false；
String或String[]: 字符串；
其类型约束在服务端控制，如果不满足约束，将返回对应的错误。
返回码：查看返回码-消息提示-描述返回码
提示消息
描述
0
success
操作成功，没有错误
18001
Your request is missing a required parameter. The required parameter is '{PARAM}'
缺少必要的参数，参数名：{Param}
18002
Parameter '{PARAM}' must be {TYPE}.
参数{Param}必须是{TYPE}
18003
The value you specified for '{PARAM}' is invalid. Valid values must be less than {PARAM}.
参数{Param}必须小于{Value}
18004
The value you specified for '{PARAM}' is invalid. Valid values must be greater than {PARAM}.
参数{Param}必须大于{Value}
18005
The value is invalid for the associated parameter '{PARAM}'.
参数{Param}的数据格式不符合要求
18006
The value of parameter '{PARAM}' contains disallowed characters.
参数{Param}含有非法字符
18007
The parameter '{PARAM}' has too many characters.
参数{Param}长度太长
18008
The parameter '{PARAM}' has too few characters.
参数{Param}长度太短
18009
Parameter '{PARAM}' must be one of the following values: [{PARAM}].
参数{Param}值不在[{Enum}]中
18010
The type of the uploaded file is invalid.
文件类型不允许
18011
Your request contains too many values for '{PARAM}'. This parameter can have a maximum of {PARAM} value(s).
参数{Param}数组元素太多，最多有{Value}个
18012
Your request contains too few values for '{PARAM}'. This parameter must have a minimum of {PARAM} value(s).
参数{Param}数组元素太少，至少有{Value}个
18013
Parameter '{PARAM}' has too many decimal places. The maximum number of decimal places is {PARAM}.
参数{Param}小数位数太长，小数点后最多{Value}位
30000
We are unable to process your request at this time. Please retry your request. If you encounter this error repeatedly, please contact our dedicated operation team.
系统错误，请重试。如稳定复现请保留请求信息并向广点通官方反馈
30106
Your request is missing a required parameter. The required parameter is 'agency_token'.
缺少必要的参数，参数名：{agency_token}
30107
Binding to the agency has failed. Please check whether your account has already been bound.
新增服务商授权失败，请确认是否已经授权过
31001
Required parameter '{PARAM}' cannot be an empty string.
参数{Param}不能为空
31009
This operation is not permitted on this {PARAM}.
没有权限操作指定对象，对象名：{Object}
31010
The {PARAM} is invalid: it could have been deleted or never existed.
操作的对象不存在或已删除，对象名：{Object}
31011
The specified parameter '{PARAM}' referred to an entity which either does not exist or is not accessible to you.
参数{Param}错误，对应的数据不存在
31013
An {PARAM} is being added or renamed, but the name is already being used by another {PARAM}.
对象存在重名，对象名：{Object}
31014
The file failed MD5 check.
文件签名校验失败
31016
parameter value is too tiny
参数值太小
31026
campaign daily budget less than cost plus limit
推广计划日预算小于当前消耗加上最低修改幅度
31027
An object with the same 'outer_id' has already been created.
已使用相同的outer_id创建对象
31028
The 'outer_id' provided does not match our records.
outer_id不匹配
31030
New version should be greater than the existing version.
版本必须比当前版本新
31031
The parameter '{PARAM}' is not allowed to be modified.
参数{Param}不允许修改
31034
Parameter '{PARAM}' is invalid.
参数值错误，参数名：{Param}
31035
Your request must include at least one of {PARAM}.
以下参数必须至少设置一项，参数名：[{Param}]
31036
You can only provide one 'order_by' parameter.
只能提供一个order_by参数
31037
The uploaded file is too large.
上传文件过大
31038
You are not permitted to do this request.
请求没有权限
31099
Parameter is invalid.
参数值错误
32100
Your account balance is not enough.
余额不足
32102
Funds can only be transferred between accounts of the same type.
只能在同类型资金账户间划账
32103
Funds transfer is not supported by your account.
当前资金账户类型不支持划账
32104
The signature of the recharge message is invalid.
充值通知签名错误
32105
Transfer failed: the current account has more than {Value} funds with validity period.
划账失败，当前账户已超{Value}笔有效资金
32106
Funds are not allowed to be transferred to a frozen account.
不允许向冻结的账户划账
32107
The 'daily_budget' can only be set when the advertiser becomes active.
只有生效帐户才能设置日限额
32108
The duration of the parameter 'date_range' is beyond the allowed maximum.
参数date_range的时间跨度超过允许的范围
32109
Transfer limit reached. Please retry after one day.
超过每日划账次数限制，请明天再试
32203
The budget of the account has been modified too many times.
帐号预算修改次数太多
32206
mobile and telephone must set one of them
手机号和座机号不能同时为空
32207
No advertiser is found for the 'advertiser_id' provided in the request.
没有找到有效的广告主
32209
The agency is inactive.
代理商状态不可用
32210
The API can only be used by an agency.
调用方必须为代理商
32211
The advertiser is inactive.
广告主帐号当前不可用
32212
The 'daily_budget' was greater than the maximum allowed.
日限额太大
32213
The 'daily_budget' was less than the minimum allowed.
日限额太小
32214
current user status is not allowed to save drafts
当前广告主状态不允许保存草稿
32215
nothing changed for approval
调用update接口必须修改至少一项内容
32216
information is not complete for approval
提交审核需要的信息不完整
32217
no industry info provided
industry_id和outer_industry不能同时为空
32218
the qq of user has been registered
填写的QQ号已被注册为广告主
32219
The advertiser don't have any wechat account binding
广告主没有绑定微信公众号
32220
The wechat spid frozen can not be different from campaign's
该推广计划由其他服务商创建
32221
The 'daily_budget' must higher than current day budget.
日预算需要高于当前帐号的总消耗
32302
Campaign 'daily_budget' has been modified too many times.
推广计划限额修改次数太多
32306
Only suspended campaigns can be deleted.
只有暂停的计划才能被删除
32307
Campaign 'daily_budget' was too low. Please increase the 'daily_budget' and retry.
推广计划限额太小
32308
Parameter 'campaign_type' is not allowed to be modified.
计划类型不能被修改
32310
The 'daily_budget' was greater than the maximum allowed.
日限额太大
32311
The 'daily_budget' was less than the minimum allowed.
日限额太小
32312
The 'begin_date' must greater than now.
开始日期不得早于今日
32313
The city's level of point {PARAM} is defferent from other points in Adgroup's geo_location
所选的城市或商圈不属于同一出价级别
32402
Ad group time interval specified is invalid, 'end_date' cannot be earlier than 'begin_date'.
开始日期必须早于结束日期
32405
Parameters 'min_impression_include' and 'max_impression_include' must be used together.
最低曝光频次和最高曝光频次必须成对设置
32406
Parameter 'max_impression_include' cannot be less than 'min_impression_include'.
最高曝光频次不得小于最低曝光频次
32407
Parameter 'site_set' has already been set by the campaign.
推广计划上已经设置了投放站点
32408
A required parameter 'site_set' was not specified or is an empty string.
广告投放站点未设置
32409
Parameter 'timeset' has already been set by the campaign.
推广计划已经设置投放时段
32410
Campaigns of {Enum} type can only use 'bid_type' of {Enum}.
{Enum}类型推广计划只能使用{Enum}类型的计费方式
32413
Parameters 'begin_date' and 'end_date' have already been set by the campaign.
投放日期重复设置
32415
The bid on an ad group is not allowed to be higher than 50% of the daily budget of the campaign.
广告出价不得超过计划预算的50%
32416
The bid on an ad group is not allowed to be modified.
当前广告不允许修改出价
32417
The 'product_type' you specified is not allowed to be used by your campaign.
无法使用当前标的物类型
32419
the industry id of qualification code not exit
行业资质编码不存在
32420
the number of qualifications is illegal
营业执照号错误
32421
This targeting can not be modified
定向不能进行修改
32422
Thi bid is too samll or large
出价超出限制
32423
This campaign is allowed to have {PARAM} adgroups
当前推广计划下广告组数量超出限制
32424
The {PARAM} is different from other adgroups or it's campaign
属性{PARAM}与所属推广计划或推广计划下的其他广告组的不一致
32425
The wechat's adgroup allows its product_type in 'PRODUCT_TYPE_LBS_WECHAT' and 'PRODUCT_TYPE_LINK_WECHAT' only
微信广告组的商品类型只能为PRODUCT_TYPE_LBS_WECHAT、PRODUCT_TYPE_LINK_WECHAT
32426
The point {PARAM} is illegal in wechat's campaign
微信推广计划的参数非法，参数名：{Param}
32427
The bid is illegal in the city of level {PARAM}
出价不符合城市{Param}的级别要求
32428
The 'targeting_id' and 'targeting' can not appear at the same time
targeting_id和targeting不能同时使用
32429
The 'targeting' must be set and 'targeting_id' is not allowed
微信公众号及朋友圈广告不允许使用targeting_id，仅允许使用targeting
32430
The 'geo_location' must be set
定向geo_location不能为空
32431
The 'regions' and 'business_districts' can be empty at the same time.
regions和business_districts不能同时为空
32432
The 'location_types' must be the following values: 'RECENTLY_IN','VISITED_IN'.
location_types仅支持RECENTLY_IN、VISITED_IN
32432
The 'location_types' must be the {PARAM}
location_types仅支持{Param}
32433
The {PARAM} is not allowd
{Param}参数不允许使用
32504
The creative template cannot be used by the adgroup with the 'product_type' you specified.
当前规格不能被标的物类型为{Enum}的广告组使用
32506
adgroup_id and campaign_id is not match
广告组id和计划id不匹配
32507
The video type is invalid.
视频类型错误
32508
The video is not of legal dimensions.
视频尺寸不符合要求
32509
The image could not be stored.
存储图片失败
32510
The domain is not whitelisted for 'impression_tracking_url'.
曝光监控地址主域不在允许的白名单内
32513
Parameter 'destination_url' has already been set by the ad group.
广告组已经设置落地页地址
32514
Parameter 'creative_elements[{Param}]' is invalid.
创意元素creative_element中参数｛Param｝错误
32515
Parameters 'product_ref_id' in url and 'product_ref_id' in adgroup must match.
落地页地址中标的物ID与adgroup中标的物ID必须一致
32516
The ad must use a dynamic ad template since it is a dynamic ad.
当前广告是动态创意广告，必须使用动态创意规格
32517
Video length does not meet the specifications.
视频时长不符合要求
32518
Video file is too large.
视频文件大小不符合要求
32519
Video is pending conversion.
视频文件处理中，暂不可用
32520
The image is not of legal dimensions.
图片尺寸不符合要求
32521
Image file is too large.
图片文件过大
32523
Parameters 'site_set' and 'product_type' must be used together.
site_set和product_type两个筛选条件必须一起使用
32524
The creative elements do not meet the specifications of the creative template.
创意元素不符合规格要求
32525
Image file is too small.
图片文件过小
32526
Video transcoding has failed.
视频文件转码失败
32527
The creative template cannot be used on the 'site_set' of the adgroup.
当前规格不能在广告组对应的站点投放
32528
You are not permitted to use this creative template.
未授权使用该规格
32529
cannot use search ad creative currently
当前创意不可使用
32531
unmatched campaign_type group on adgroup and creative
创意和广告组上的广告类型不一致
32532
campaign product_type and ad_creative product_type is not match
推广计划的标的物类型和广告创意的标的物类型不匹配
32533
Adgroup site_set and AdCreative site_set is not match
广告组的站点和广告创意的站点不匹配
32534
Adgroup product_type and AdCreative product_type is not match
广告组的标的物类型和广告创意的标的物类型不匹配
32535
Adgroup product_ref_id and AdCreative product_ref_id is not match
广告组的标的物id和广告创意的标的物id不匹配
32536
The number of Wechat moments Ad in one campaign reach limit
同一推广计划下的微信朋友圈广告个数已达上限
32537
Wechat moments Ad in one campaign must refers the same ad_creative
同一推广计划下的微信朋友圈广告仅能关联同一广告创意
32538
This Adgroup in the Wechat moments Campaign already refers one AdCreative
微信朋友圈广告仅能关联一个广告创意
32539
This Adgroup in Wechat offical account Campaign already refers one Creative
微信公众号广告仅能关联一个广告创意
32540
AdCreative's campaign must set the placement CAMPAIGN_TYPE_WECHAT_MOMENTS
朋友圈创意必须归属于朋友圈推广计划
32541
The number of AdCreative associations reaches the limit
创意数量达到限制
32542
Wechat moments ad only support one image
微信朋友圈广告仅支持一张图片
32544
Creative elements's texts at most have 4 rows
创意元素的文字描述最多4行
32545
Wechat moments ad are not allowed modified after exposure
微信朋友圈广告一旦有过曝光后，即不允许修改
32605
Parameter 'app_behavior[object_type]' cannot be found.
app_behavior下object_type不存在
32606
Parameter 'app_behavior[object_type]' must be a leaf node.
app分类必须指定最细级别
32607
Parameters 'location' and 'area' cannot be used together.
不能同时使用位置和地域定向
32609
Parameter 'targeting_setting[{Param}]' is invalid.
定向详细条件中{Param}错误
32610
You have selected a Min '{Param}' greater than Max '{Param}', you should select a valid range.
区间错误: 参数{Param}的上限大于下限
32615
Parameter 'targeting_setting[ad_behavior]' is invalid. The action is not allowed to be used by your account.
当前帐号不允许使用该行为作为定向
32702
Too many APP products are created in this month.
每月创建的APP标的物超上限
32705
Required parameter 'app_id' cannot an empty string.
app id不能为空
32706
The app with the 'product_ref_id' cannot be found.
未发现对应的app
32708
Subordiante 'product_ref_id' cannot be found.
未发现对应的渠道包id
32709
The preview image of the subordinate product cannot be found.
视频说说缩略图不存在
32710
A product is being added, but the 'product_refs_id' is already being used by another product.
请不要重复创建标的物
32711
The pc app identified with the 'product_id' cannot be found.
找不到对应的开发平台PC应用
32712
The name of the pc app is not available.
获取开放平台PC应用名称失败
32713
The product type not support yet
标的物类型暂不支持
32801
The 'group_by' condition is invalid.
无效的聚合条件
32803
Parameter 'date' is before allowed minimum or after allowed maximum.
报表日期超限
32804
Parameter 'order_by' is invalid.
当前的排序规则不支持
32805
Report type and level not match.
报表的类型和层级不匹配
32901
The uploaded file is invalid.
上传文件为空
32902
The type of the uploaded file is not supported.
文件类型不支持
32903
The image identified with the URL cannot be found.
URL指定的图片无法正常读取
32904
The duration of the file is beyond the allowed maximum.
文件播放时间太长
50002
account id invalid
account_id无效
51000
parameter error
参数异常
51001
system error
系统异常
51002
unknown protocol error
无效的数据协议
52012
file extension invalid
无效的文件类型
52015
file size exceeds limit.
文件大小超过限制
方案介绍
在
微信广告投放平台
推广落地页为小程序时，用户进入小程序之后会产生对应的行为（如下单、注册等），
为了量化小程序广告用户的转化效果，需要回传用户的转化行为。本SDK是基于腾讯有数SDK的用户行为回传的解决方案。
功能说明：

1）回传并积累小程序内转化行为数据以使用智能优化（oCPM/oCPA）能力；

2）提取小程序内发生特定行为的用户，用于广告投放；

3）基于小程序用户行为偏好，优化广告投放效果；

4）追踪广告全链路数据，支持查看广告引导进入小程序用户的后续行为和相关分析；
使用须知：

1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读；
有数产品介绍
腾讯有数
是腾讯官方微信生态内的一站式数据分析及运营工具，帮助客户了解小程序商城运营情况，提升运营效率。
开通步骤
腾讯有数的注册采用申请制，请点击链接，填写并提交申请表，申请通过后会邮件收到《数据接入服务使用指引文档》。
1.提交申请资料腾讯有数的注册采用申请制，请
点击链接
，填写并提交申请表，申请通过后会邮件收到《数据接入服务使用指引文档》。
2.开始对接使用有数功能，商家需要接入：
 1）前端行为数据；
2）后端其他数据（订单、商品）；
注：通过前端SDK上报行为数据可满足广告场景的最低接入要求，但无法开通有数全部功能。
相应文档如下：

《前端SDK获取方式及文档地址》

《后端SDK获取方式及文档地址》

《开发环境及生产环境账号获取指引》
3.联调，测试并验收根据《数据接入服务使用指引文档》中的要求，完成联调与测试.
商家自行确认关键指标后，确认验收，联系有数运营同学申请正式开通.
广告相关功能使用指引
功能
使用指引
转化数据归因（oCPM/oCPA）
通过有数平台回传转化数据用于广告归因和oCPM/oCPA投放，无需二次开发。

使用路径：营销分析-关联平台-开启转化数据回传至广告
小程序人群提取
提取小程序内发生特定行为的用户，推送广告平台，用于广告投放；

使用路径：人群管理-创建人群
广告投放优化
基于小程序用户行为偏好，优化广告投放效果；

使用路径：营销分析-关联平台-开启小程序数据授权至广告
广告追踪分析
帮助商家持续追踪分析用户点击广告后在小程序中的打开浏览及下单等转化行为，支持洞察分析广告人群的长期留存和价值贡献；

使用路径：营销分析-广告追踪分析；人群管理-洞察报告-长效分析报告；
开启腾讯有数转化数据归因（oCPM/oCPA）功能后，回传内容与广告侧指标对应关系如下表。

特别说明：
使用路径：营销分析-关联平台-开启转化数据回传至广告。
归因匹配逻辑：转化行为会
匹配转化前30天内的广告点击行为进行归因
。
有数后台字段
微信广告act_type
微信广告acion_param
微广数据指标
oCPM优化目标
下单
complete_order
无
下单量
下单
购买
purchase
无
网页付费次数
付费
加入购物车
add_to_cart
无
网页加购物车次数
加购物车
预约
reservation
无
销售线索次数
综合线索收集
确认有效销售线索
comfirm_effective_leads
无
有效销售线索量
有效综合线索
网页咨询
consult
online_consilt
在线咨询人数
在线咨询
问题咨询
发送邮件至youshu@tencent.com，或添加微信账号：youshu_helper 咨询。
说明
本文档主要说明用户点击广告跳转小程序页面，小程序页面路径所带参数，以及参数监控上报。目前适用于朋友圈、公众号、小程序广告位推广小程序广告的数据监控。
介绍广告主在微信广告侧投放小程序广告，普通用户在收到广告后，点击广告打开小程序页面时，微信侧在小程序页面路径上所带的额外参数及参数说明。小程序广告主获取参数的方式以及数据上报的方案。
参数说明
参数名
参数说明
备注
weixinadkey
广告加密key
暂时不用关心
gdt_vid
广告traceid


weixinadinfo
广告adinfo，由其他参数拼接而成，值为aid.traceid.scene_type.0，aid为微信广告投放端创建广告时生成的广告id

scene_type
广告场景值
暂时不用关心
示例
创建广告填写的小程序路径：
/page/item/detail/detail?sku=1077777&platform=1
小程序路径加广告参数后示例地址：

/page/item/detail/detail?sku=1077777&platform=1&gdt_vid=wx0ewinbalytptma00&weixinadinfo=20966864.wx0ewinbalytptma00.0.1
获取参数代码示例在小程序页面注册时监听onLoad方法，通过options参数获取打开当前页面所调用的 query 参数，可参考
官方文档示例
test.js Page({
data: {
  
text: "This is page data." },
onLoad: function(options) {
// url参数中可以获取到gdt_vid、weixinadinfo参数值 let gdt_vid = options.gdt_vid
let weixinadinfo = options.weixinadinfo
// 获取广告id
let aid = 0
if(weixinadinfo){
let weixinadinfoArr = weixinadinfo.split(‘.’)
aid = weixinadinfoArr[0] }
console.log(‘来源广告的广告id是:’ + aid) }
... })
数据监控方案目前微信广告侧未直接提供广告上报数据，广告主可以通过以下几种方式进行数据的监控：
（一）使用微信广告的参数
用户通过微信广告打开小程序时，微信广告会在原地址上增加广告特有的参数，小程序开发者可以解析这些广告参数(主要收集 aid 和 traceid 信息)，并通过以下两种方式进行参数的上报与分析：
使用微信广告提供的API能力(推荐):当对应小程序落地页产生转化行为时，可以利用API将广告参数和转化数据一并上报给广告平台，经过广告平台计算后，将最终数据呈现在广告投放端。
API文档说明
开发者自行完成数据上报与分析:收集到广告参数后，小程序开发者可自己进行广告数据与转化行为数据的匹配计算。
（二）使用独立页面作为小程序的投放落地页
制作独立的小程序落地页，该小程序页面仅用于本次广告投放，并针对该页面进行数据监控，以达到区分广告效果的目的。
（三）为小程序落地页地址增加独立的监控参数
创建广告填写小程序路径时，在路径地址上增加独立的监控参数，在小程序页面根据增加的独立参数进行上报，以区分广告来源的数据。
常见问题：为什么链接里没有携带gdt_vid/weixinadinfo或其他广告参数一般是广告落地页存在重定向或二跳页面，需要页面增加逻辑，在任何情况下都继续向下游页面传递广告参数。
即，从广告落地页重定向或访问下一页面时，网页参数中透传广告参数。`,
  233: `一、API方案介绍
在
微信广告投放平台
推广小游戏时，用户进入小游戏之后会产生对应的行为（如注册、付费等），
为了量化小游戏广告用户的转化效果，需要回传用户的转化行为。本API解决的是小游戏内用户行为回传的问题。
说明：

1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读；

2）联调时，请以回传示例格式为准，确保联调正常；
使用须知
（一） 对接流程简介

特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调，小游戏和游戏类小程序无法调用联调。


1.
对于广告主账号与所推广的小游戏为同公司/个人主体时
：在微信公众平台的『开发』—『基本配置』中注册成为开发者；
2.
对于广告主账号与所推广的小游戏为不同公司/个人主体时
：需要先
通过跨主体回传功能获取小游戏账号授权
，即回传的广告主账号需要获取小游戏账号的授权。详见授权操作说明；
3.创建转化数据对应的数据源；
4.获取用户openid，根据转化行为、推广目标，选择对应的行为类型回传数据，构造请求回传数据至对应的行为源，需要确保回传成功；
5.例行化：确保线上实际投放时，用户发生转化后，会自动实时运行步骤2，调用API回传数据，并回传成功；
6.验证：判断步骤4是否正常运行；
注：对于二次接入本API的广告主账号，可以跳过1、2步骤；
建议对接人员：建议后台开发同学对接本API；
(二) 问题咨询流程

开发过程中遇到任何问题可以参考以下流程解决
1.查看
本文底部特别关注
或【行为数据回传附录-常见问题解答】是否有相应说明；
2.根据【行为数据回传附录-返回码】，查询是否有相关说明，如果未检索到对应内容，访问公众平台开发者文档再次查询；
3.参见【行为数据回传附录-问题咨询流程】对接人工客服；
使用背景
目前支持的行为类型以及对应的智能投放优化目标、数据指标如下：
行为名称
ActionType
推广目标
数据指标
说明
付费
PURCHASE
推广小游戏
小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为
次留
START_APP
推广小游戏
小游戏次留人数
用户首次进入小游戏后，次日再次进入小游戏


关键页面访问



推广小游戏


停留大于30s人数
关键页面访问
在“推广我的小游戏“下
转化定义为注册用户停留大于30s，数据由小游戏平台上报，
无需广告主回传
 。
小游戏创角
CREATE_ROLE
推广小游戏
小游戏创角人数
广告主自定义的小游戏内角色创建行为
付费
PURCHASE
推广小游戏
小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为
原理介绍
（一）对于小程序/小游戏的用户，每个用户都会生成一个openid，将openid与小程序appid作为转化数据的标识之一回传广告平台。
（二）广告平台会通过openid和appid关联到之前投放的小程序/小游戏广告，从而得到用户行为与推广广告的关联。
（三）关联后计算的广告效果会呈现在微信广告投放平台（mp.weixin.qq.com）报表中，并会成为后续智能优化的数据基础。
二、对接步骤
概览
1、准备阶段
1)注册成为开发者；
2)创建数据源，获取存储数据的数据源ID；

2、正式对接
1）获取用户openid；
2）确定行为类型；
3）获取创建时存储的数据源ID
4）构造请求回传数据，需要确保回传成功；

3、例行化
确保线上实际投放时，用户发生转化后，会自动实时运行『2;、正式对接』
4、验证
调用API回传数据，并回传成功；
准备阶段：成为公众平台开发者，创建数据源（一） 注册成为开发者
目标：获取开发者ID、密码和access_token
步骤：
特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调。
对于非同主体广告主账号：
用于回传数据的广告主账号需要先通过跨主体回传功能获取小游戏账号授权（即回传的广告主账号需要获取小游戏账号的授权）。
注：小游戏需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
 2. 进行授权，详见
授权操作流程
 3. 点击左边栏，『开发』下『开发配置』，获取AppSecret；
 4. 参考说明文档获取
access_token
对于同主体广告主账号：
1. 进入
注册页面
，点击左边栏，『开发』下『基本配置』。同意《微信公众平台开发者服务协议》后，点击『成为开发者』；

2. 获取开发者密码。点击“重置”按钮：

3. 弹窗提示，点击“确定重置”按钮：

4. 点击“开始”按钮：

5. 选择验证方式进行验证：

6. 验证完成之后扫码绑定微信号，绑定成功后重置开发者密码。然后微信上点击确认，进行第二步密码验证：

7. 密码验证后，即可查看开发者密码。由于开发者密码不会直接显示在MP后台，因此需要开发者保存。开发者密码为重要账号凭据，建议不要外传。

8. 获取access_token。在开发——基本配置中点击“获取access_token”,用之前注册的开发者id和生成的开发者密码调用接口获取access_token。

（二） 创建数据源
目标：创建数据源，生成数据源ID（user_action_set_id） 步骤：
构造请求，创建数据源；
保存数据源ID，用于后续回传数据；
请求地址： user_action_sets/add
请求方法： POST
请求参数：
名称
类型
描述
Type
enum
用户行为源类型，『WECHAT_MINI_GAME』
Name
string
用户行为源名称，必填
description
string
用户行为源描述，字段长度最小 1 字节，长度最大 128 字节
wechat_app_id
string
小程序/小游戏对应的appid

特别关注：需要填写被推广的小游戏的appid
请求示例：
curl "https://api.weixin.qq.com/marketing/user_action_sets/add?version=v1.0&access_token=<ACCE
SS_TOKEN>"\
-H 'Content-Type: application/json' \
-d '{
    "type": "WECHAT_MINI_GAME",
    "wechat_app_id": "<WECHAT_APP_ID>",
    "name": "webuser_action_set",
    "description": ""
}'
应答字段：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口] 创建用户行为源时分配的唯一 id
应答示例：
{
"errcode":0, "
"errmsg":""
"data": {
	"user_action_set_id": "<USER_ACTION_SET_ID>"
	}
}
正式对接：获取openid，并进行加密，确定行为类型，回传数据（一） 获取用户openid
目标
：获取访问小游戏用户的openid，作为回传数据的用户标识；
步骤
：
1.获取用户openid，详见
openid获取说明
2.用户发生转化时，记录发生转化的openid；
（二） 确定行为类型
目标
：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型； 
步骤
： 根据以下建议，确认后续API回传时需要填写的Action_Type：
行为名称
ActionType
推广目标
数据指标
说明


付费


PURCHASE


推广小游戏

小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为，回传金额时，单位为“分”。例如充值6元，则回传“600”

次留

START_APP

推广小游戏

小游戏次留人数
用户首次进入小游戏后，次日再次进入小游戏

关键页面访问

VIEW_CONTENT

推广小游戏

停留大于30s人数
关键页面访问
在“推广我的小游戏“下
转化定义为注册用户停留大于30s，数据由小游戏平台上报，
无需广告主回传
 。
小游戏创角
CREATE_ROLE
推广小游戏
小游戏创角人数
广告主自定义的小游戏内角色创建行为
（三）回传数据
目标
：根据openid、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
步骤
：
1. 前提 在传入转化行为数据之前，请确保开发者已经：
注册成为开发者，并获取了可用的在有效期内的token
已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见附录；

2. 确认上报数据字段，参数说明如下：
名称
类型
必填
限制
说明
user_action_set_id
integer
yes

用于标识数据归属权。


url


string


yes

转化行为发生页面的URL，小游戏需要在页面路径前增加『http://www.』， 或直接填写 『http://www.qq.com』

校验逻辑：

1.以『http://www.』 开头；

2.必须为纯小写；

3.必须包含『.』


action_time


integer


yes

行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，
UNIX时间，单位为秒，长度为10位。

如果不填将使用服务端时间填写
action_type
enum
yes

预定义的行为类型，详见上方ActionType定义
openid
string
yes

根据获取到的openid，为28位字符
wechat_app_id

公众号appid
string
yes

生成该openid对应的账号appid，详见
openid获取说明




outer_action_id




string




no

去重标识，平台会基于user_action_set_id，outer_action_id 和action_type三个字段做去重 。

如果历史上报数据中存在某条数据的这三个字段与当前上报数据完全一样的，则当前数据会被过滤掉。

注：字段长度最小1字节，最大长度255字节，且只能为数字，字母，下划线，连接符组成。
action_param
string
no



value

Int

no

代表订单金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000
length_of_stay
Int
no
回传次留必填
Actiontype= START_APP时必填，赋值为1

source

string

Yes

转化数据发生的渠道：

1)Biz，代表公众号内各种服务或网页

2)Web，代表非公众号的其他渠道

归因方式claim_type

integer

Yes

归因方式：

0）按点击行为归因

1）按关注行为归因

小游戏归因时，选择0）点击行为归因；
 3. 调用API，回传数据 示例：需要统计“进入小游戏”的转化行为，开发者只需要在进入小游戏转化行为发生时，上报action_type=“PURCHASE”，且附上获取的 openid。
回传付费请求示例：
curl -k 'https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>"
-d  '{
           	"user_action_set_id": "<USER_ACTION_SET_ID>",
		"actions":[
                           	{
                           		"url":"<URL>",
                           		"action_time":1513077790,
                           		"action_type":"PURCHASE",
                           		"user_id":{
                                          	  "wechat_app_id":"<WECHAT_APP_ID>",
                                          	 "wechat_openid":"<WECHAT_OPEN_ID>"
                                 	},
                           		"action_param":{
                                          	"claim_type":0,
					"source":"Web",
					"value": <purchase_value>
                           		}
                           	}
                        	]
  	}'
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
回传次留请求示例：
curl -k 'https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>"
-d  '{
           	"user_action_set_id": "<USER_ACTION_SET_ID>",
		"actions":[
                           	{
                           		"url":"<URL>",
                           		"action_time":1513077790,
                           		"action_type":"START_APP",
                           		"user_id":{
                                          	  "wechat_app_id":"<WECHAT_APP_ID>",
                                          	 "wechat_openid":"<WECHAT_OPEN_ID>"
                                 	},
                           		"action_param":{					
"length_of_stay": 1,
                                          	 "claim_type":0,
					"source":"Web",
                           		}
                           	}
                        	]
  	}'
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，请使用【
行为数据回传附录
】进行排查
例行化：确保线上实际投放时，用户发生转化后，会自动实时运行第2步[正式对接]（一）确保广告实际投放中，用户发生转化后，步骤四能够正常运行，自动获取用户的openid，并通过API回传到广告系统中。
（二）增加API数据回传日志，记录每次调用API回传的内容以及API应答信息，方便后续排查问题
验证：自行验证，上线验证调用API回传数据，并回传成功；
（一)自行验证
确保模拟数据回传API应答正确；

（二)上线验证
创建广告；
正常投放；
确认API数据回传日志，有数据回传且应答信息正确； 无日志可以根据【
行为数据回传附录
-数据源报表查询】，根据raw_action_count是否有值，判断是否成功传入了行为数据；
访问MP投放端报表，数据指标是否有相应的数值显示；
行为名称
ActionType
推广目标
数据指标
说明
付费
PURCHASE
推广小游戏
小游戏付费次数

小游戏付费金额（元）
用户在小游戏中发生购买道具等付费行为
次留
START_APP
推广小游戏
小游戏次留人数
用户首次进入小游戏后，次日再次进入小游戏
特别关注

errcode:900351001,errmsg:'wechat open id fetch error'openid无法识别，请确保回传账号已获取openid对应账号的授权。
用于回传数据的广告主账号需要先通过跨主体回传功能获取小游戏账号授权
回传数据的账号为发起授权方，一般为广告主账号；
openid生产方，为接收授权方，一般为小游戏/小程序/公众号等；
注：
1.小游戏需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
2.进行授权，详见
授权操作流程
3.点击左边栏，『开发』下『开发配置』，获取AppSecret；
4.获取
access_token
回传成功，无法归因，投放端报表无数据展示请再次确认数据源对应的appid与推广的小游戏appid是否一致；
通过数据源id查询数据源信息：
curl -G 'https://api.weixin.qq.com/marketing/user_action_sets/get?version=v1.0&access_token=<ACCESS_TOKEN>'  
-d  "user_action_set_id":"<USER_ACTION_SET_ID>"`,
  234: `一、API方案介绍
在
微信广告投放平台
推广公众号时，用户关注公众号之后会产生对应的转化行为（如下单、资料收集、注册等），
为了量化关注类广告关注粉丝的转化效果，需要回传用户的转化行为。本API解决的是公众号内部转化行为回传的问题。
说明：

1）此文档说明与技术开发紧密相关，建议广告主运营人员在开发人员指导下阅读；

2）联调时，请以回传示例格式为准，确保联调正常；
使用须知
（一） 对接流程简介

特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调，小游戏和游戏类小程序无法调用联调。

1.
对于广告主账号与转化行为对应用户openid为同公司/个人主体时
：在
微信公众平台
的『开发』—『基本配置』中注册成为开发者；
2.
对于广告主账号与转化行为对应用户openid为不同公司/个人主体时，会报错：errcode:900351001
：需要先通过跨主体回传功能获取小游戏账号授权，即回传的广告主账号需要获取小游戏账号的授权。详见
授权操作说明
；
3.创建转化数据对应的数据源；
4.获取用户openid，根据转化行为、推广目标，选择对应的行为类型回传数据，构造请求回传数据至对应的行为源，需要确保回传成功；
5.例行化：确保线上实际投放时，用户发生转化后，会自动实时运行步骤2，调用API回传数据，并回传成功；
6.验证：判断步骤4是否正常运行；
注：对于二次接入本API的广告主账号，可以跳过1、2步骤；
建议对接人员：建议后台开发同学对接本API；
(二) 问题咨询流程

开发过程中遇到任何问题可以参考以下流程解决
1.查看
本文底部特别关注
或【
行为数据回传附录
-常见问题解答】是否有相应说明；
2.根据【
行为数据回传附录
-返回码】，查询是否有相关说明，如果未检索到对应内容，访问公众平台开发者文档再次查询；
3.参见【
行为数据回传附录
-问题咨询流程】对接人工客服；
使用背景
(一) 目前支持的行为类型以及对应的智能投放优化目标、数据指标如下：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广公众号
综合下单次数
如电商商品被下单
付费
PURCHASE
推广公众号
公众号内付费次数
如小说书城付费
预约
RESERVATION
推广公众号
公众号内填单人数
如提交联系信息，预约看车
注册
REGISTER
推广公众号
公众号内注册人数
如注册为会员
（二）目前支持的广告流量包括

1.公众号底部和文中；
2.朋友圈信息流；
3.小程序/小游戏广告位；
原理介绍
（一）对于公众号的粉丝或公众号内进行转化的用户，每个用户都会生成一个openid（参见
公众平台获取openid文档
），将openid与公众号appid作为转化数据的标识之一回传广告平台。
（二）广告平台会通过openid和appid关联到之前投放的公众号关注广告，从而得到用户行为与推广广告的关联。
（三）关联后计算的广告效果会呈现在微信广告投放平台（mp.weixin.qq.com）报表中，并会成为后续智能优化的数据基础。
二、对接步骤
概览
1、准备阶段
1)注册成为开发者；
2)创建数据源，获取存储数据的数据源ID；

2、正式对接
1）获取用户openid；
2）确定行为类型；
3）获取创建时存储的数据源ID
4）构造请求回传数据，需要确保回传成功；

3、例行化
确保线上实际投放时，用户发生转化后，会自动实时运行『2;、正式对接』
4、验证
调用API回传数据，并回传成功；
准备阶段：成为公众平台开发者，创建数据源（一） 注册成为开发者
目标：获取开发者ID、密码和access_token
步骤：
特别说明：请使用已开通广告主身份的公众号或小程序身份进行联调。
对于非同主体广告主账号：
用于回传数据的广告主账号需要先获取授权，即回传的广告主账号需要获取openid对应appid的授权。
注：openid对应appid需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
进行授权，详见
授权操作流程 
点击左边栏，『开发』下『开发配置』，获取AppSecret；
参考说明文档获取
access_token
对于同主体广告主账号：
1. 进入
注册页面
，点击左边栏，『开发』下『基本配置』。同意《微信公众平台开发者服务协议》后，点击『成为开发者』；

2. 获取开发者密码。点击“重置”按钮：

3. 弹窗提示，点击“确定重置”按钮：

4. 点击“开始”按钮：

5. 选择验证方式进行验证：

6. 验证完成之后扫码绑定微信号，绑定成功后重置开发者密码。然后微信上点击确认，进行第二步密码验证：

7. 密码验证后，即可查看开发者密码。由于开发者密码不会直接显示在微信广告投放平台（mp.weixin.qq.com），因此需要开发者保存。开发者密码为重要账号凭据，建议不要外传。

8. 获取access_token。在开发——基本配置中点击“获取access_token”,用之前注册的开发者id和生成的开发者密码调用接口获取access_token。

（二） 创建数据源
目标：创建数据源，生成数据源ID（user_action_set_id） 步骤：
构造请求，创建数据源；
保存数据源ID，用于后续回传数据；
请求地址： user_action_sets/add
请求方法： POST
请求参数：
名称
类型
描述
Type
enum
用户行为源类型，请填入『WECHAT』类型
Name
string
用户行为源名称，必填
description
string
用户行为源描述，字段长度最小 1 字节，长度最大 128 字节
wechat_app_id
string
关注类广告投放账号对应的appid

特别关注：需要填写被推广的公众号的appid
请求示例：
curl "https://api.weixin.qq.com/marketing/user_action_sets/add?version=v1.0&access_token=<ACCE
SS_TOKEN>"\
-H 'Content-Type: application/json' \
-d '{
    "type": "WECHAT",
    "wechat_app_id": "<WECHAT_APP_ID>",
    "name": "webuser_action_set",
    "description": ""
}'
应答字段：
名称
类型
描述
user_action_set_id
integer
用户行为源 id，通过 [user_action_sets 接口] 创建用户行为源时分配的唯一 id
应答示例：
{
"errcode":0, "
"errmsg":""
"data": {
	"user_action_set_id": "<USER_ACTION_SET_ID>"
	}
}
正式对接：获取openid，确定行为类型，回传数据（一） 获取用户openid
目标
：获取访问小游戏用户的openid，作为回传数据的用户标识；
步骤
：
1.获取用户openid，详见
openid获取说明
2.用户发生转化时，记录发生转化的openid；
（二） 确定行为类型
目标
：请与业务人员沟通确认，根据推广目标和oCPM优化目标，确认需要回传的行为类型； 
步骤
： 根据以下建议，确认后续API回传时需要填写的Action_Type：
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广公众号
综合下单次数
如电商商品被下单
付费
PURCHASE
推广公众号
公众号内付费次数
如小说书城付费
预约
RESERVATION
推广公众号
公众号内填单人数
如提交联系信息，预约看车
注册
REGISTER
推广公众号
公众号内注册人数
如注册为会员
（三）回传数据
目标
：根据openid、Action_Type、创建时保存的数据源ID，调用API进行回传，获取成功应答；
步骤
：
1.前提 在传入转化行为数据之前，请确保开发者已经：
注册成为开发者，并获取了可用的在有效期内的token
已创建数据源，并保留user_action_set_id，查询已有的user_action_set_id参见附录；
2.确认上报数据字段，参数说明如下：
名称
类型
必填
限制
说明
user_action_set_id
integer
yes

用于标识数据归属权




url




string




yes

转化行为发生页面的URL，小游戏需要在页面路径前增加『http://www.』， 或直接填写 『http://www.qq.com』

校验逻辑：

1.以『http://www.』 开头；

2.必须为纯小写；

3.必须包含『.』


action_time


integer


yes

行为发生时，客户端的时间点。广告平台使用的是GMT+8的时间，容错范围是前后10秒，
UNIX时间，单位为秒，长度为10位。

如果不填将使用服务端时间填写
action_type
enum
yes

预定义的行为类型，详见上方ActionType定义
openid
string
yes

根据获取到的openid，为28位字符
wechat_app_id

公众号appid
string
yes

生成该openid对应的账号appid，详见
openid获取说明





outer_action_id





string





no

去重标识，平台会基于user_action_set_id，outer_action_id 和action_type三个字段做去重 。

如果历史上报数据中存在某条数据的这三个字段与当前上报数据完全一样的，则当前数据会被过滤掉。

注：字段长度最小1字节，最大长度255字节，且只能为数字，字母，下划线，连接符组成。
action_param
string
no



value

Int

no

代表订单金额，单位为分，需要填写到param中获取，例如商品单价40元，需赋值为4000

source

string

Yes

转化数据发生的渠道：

1)Biz，代表公众号内各种服务或网页

2)Web，代表非公众号的其他渠道

归因方式claim_type

integer

Yes

归因方式：

0）按点击行为归因

1）按关注行为归因

关注归因时， 默认选择1）关注行为归因；

可以咨询对应运营是否需要调整。
3.调用API，回传数据 示例：需要统计“关注公众号”后发生的转化行为，开发者只需要在发生转化时，上报action_type=“COMPLETE_ORDER”，且附上获取的 openid。
回传付费请求示例：
curl -k 'https://api.weixin.qq.com/marketing/user_actions/add?version=v1.0&access_token=<ACCESS_TOKEN>"
-d  '{
           	"actions":[
                           	{
                           		"user_action_set_id":"<USER_ACTION_SET_ID>",
                           		"url":"<URL>",
                           		"action_time":1513077790,
                           		"action_type":"COMPLETE_ORDER",
                           		"user_id":{
                                          	  "wechat_app_id":"<WECHAT_APP_ID>",
                                          	 "wechat_openid":"<WECHAT_OPEN_ID>"
                                 	},
                           		"action_param":{
                                          	  "object":"...",
                                          	  "product_name":"..",
                                          	  "product_id":"12345",
                                          	  "source":"Biz",
                                          	  "claim_type":1
                           		}
                           	}
                        	]
  	}'
-H "Content-Type:application/json"
注：actions为数组列表，不能大于 50KB。数组最小长度 1，最大长度 50。
应答示例：
正确的返回值为：
{"errcode":0," errmsg ":""}

返回错误返回码时，请使用【
行为数据回传附录
】进行排查
例行化：确保线上实际投放时，用户发生转化后，会自动实时运行第2步[正式对接]（一）确保广告实际投放中，用户发生转化后，步骤四能够正常运行，自动获取用户的openid，并通过API回传到广告系统中。
（二）增加API数据回传日志，记录每次调用API回传的内容以及API应答信息，方便后续排查问题
验证：自行验证，上线验证调用API回传数据，并回传成功；
（一)自行验证
确保模拟数据回传API应答正确；
（二)上线验证
创建广告；
正常投放；
确认API数据回传日志，有数据回传且应答信息正确； 无日志可以根据【
行为数据回传附录
-数据源报表查询】，根据raw_action_count是否有值，判断是否成功传入了行为数据；
访问微信广告投放平台（mp.weixin.qq.com）报表，数据指标是否有相应的数值显示；
行为名称
ActionType
推广目标
数据指标
说明
下单
COMPLETE_ORDER
推广公众号
综合下单次数
如电商商品被下单
付费
PURCHASE
推广公众号
公众号内付费次数
如小说书城付费
预约
RESERVATION
推广公众号
公众号内填单人数
如提交联系信息，预约看车
注册
REGISTER
推广公众号
公众号内注册人数
如注册为会员
特别关注

errcode:900351001,errmsg:'wechat open id fetch error'openid无法识别，请确保回传账号已获取openid对应账号的授权。
用于回传数据的广告主账号需要先通过跨主体回传功能获取小游戏账号授权
回传数据的账号为发起授权方，一般为广告主账号；
openid生产方，为接收授权方，一般为小游戏/小程序/公众号等；
注：
1.小游戏需要先开通广告主身份，在
官网
，『推广』-『广告主』-『开通广告主』；
2.进行授权，详见
授权操作流程
3.点击左边栏，『开发』下『开发配置』，获取AppSecret；
4.获取
access_token
无法归因常见问题user_action_sets/add接口， Type字段，用户行为源类型，请填入『WECHAT』类型；
user_actions/add接口，归因方式claim_type使用integer类型；
回传成功，无法归因，投放端报表无数据展示请再次确认数据源对应的appid与推广的小游戏appid是否一致；
通过数据源id查询数据源信息：
curl -G 'https://api.weixin.qq.com/marketing/user_action_sets/get?version=v1.0&access_token=<ACCESS_TOKEN>'  
-d  "user_action_set_id":"<USER_ACTION_SET_ID>"`,
  108: `智能优化（含智能优化oCPM/智能优化oCPC）是微信广告流量的一种出价方式。 你可以根据实际的推广需求，自定义广告的优化目标，并对优化目标设定出价。 广告系统将对投放进行智能优化，精准触达高转化率用户。
智能优化的工作原理广告系统实时预估每次曝光的转化概率，并根据你设置的转化出价，实时计算出每次曝光对你的转化价值；并基于转化价值，智能调控出价，竞拍每次曝光，确保最大化地实现你的优化目标。可以用以下两个公式来简单说明。
单次曝光的转化价值 = 你设置的转化出价 x 曝光到转化的概率

广告系统的实时出价 = 转化价值 x 智能调控因子
智能调控因子由广告的日预算消耗情况、转化成本的达成情况等因素共同决定，其存在的目标是帮助你在预算范围内获得尽可能多的转化量、同时实际转化成本尽量不超出你的预期。
智能优化的收费方式为优化目标设定出价并不等同于按转化收费。广告系统会根据你的优化目标出价，时刻寻找最有可能完成转化的用户。最终实际转化价格将与设置的转化目标出价尽可能接近，但不会完全一致。
智能优化（oCPM）按曝光次数收费，广告会在曝光展示时扣费；单次曝光的价格由转化出价、广告质量与完成转化的预估概率共同决定。下列场景使用oCPM的优化方式：
广告位：朋友圈信息流、公众号文章底部（视频素材）、公众号文章视频贴片、激励式广告
形态：沉浸式横版视频
智能优化（oCPC）按点击次数收费，广告会在点击时扣费。单次点击的价格由转化出价、广告质量与完成转化的预估概率共同决定。下列场景使用oCPC的优化方式：
广告位：公众号文章底部（图片素材）、公众号文章中部、小程序banner广告、小程序插屏广告
形态：展示banner图片、优雅横版大图
长期来看，相比普通竞价CPM/CPC的投放方式，使用智能优化的投放方式为优化目标出价，会让广告在成本更为稳定的前提下，获得更多的的广告曝光机会。
本文简要介绍智能优化的操作指南，如零门槛投放智能优化广告、创建智能优化广告等。
零门槛投放2020年5月起，微信广告智能优化（oCPM/oCPC）已实现所有优化目标的零门槛投放。
请注意：零门槛投放相当于一个账户尚未积累任何转化数据，直接投放智能优化（oCPM/oCPC）广告，可能会造成新广告的成本波动和起量慢，建议耐心投放观察。
此外，对于下单、销售线索、安卓/iOS-激活等可能需要广告主上报转化数据的目标，在使用智能优化功能前，需要广告主保证转化数据已经正确接入上报；投放端前端也会做相应的提示：

（点击查看 
API回传文档
，注意：使用智能优化的前提是准确回传转化数据，比如“推广我的商品”使用转化行为为“下单”回传；“收集销售线索”使用转化行为为“表单预约”回传，详情见回传文档）
创建广告创建智能优化广告需要在“预算花费”模块中完成。
请注意，广告一旦开始投放，优化目标将不能再修改。
以下为推广目标为“推广公众号”，优化目标为“关注”时的公众号底部智能优化广告创建示例。


本文介绍智能优化的优化指南，如使用规则、如何合理出价、关于投放效果和效果优化等。
使用规则在广告开始投放前，可以修改出价方式、优化目标、出价金额、每日预算、投放人群、投放时间等广告信息。
广告一旦开始投放（包括开启投放后暂停广告），将无法再修改出价方式、优化目标；但可以修改每日预算，优化目标出价及投放人群等广告信息。
合理出价1. 为优化目标设置出价
首先，请计算普通竞价CPM/CPC广告近期，使用相似投放方法（相似投放人群及相似素材组合）时，实际的平均转化成本（总消耗/总转化量）。
1）如果主要推广诉求是获得更多转化量，建议优化目标出价高于计算得出的平均转化成本，低于你能承受的最高成本。
2）如果主要推广诉求是稳定成本、不考虑争取更多转化量，建议以平均转化成本作为优化目标出价。
2. 关于调整出价
智能优化通过了解广告主最真实的效果预期来达成使命。因此，你在设置优化目标出价时，只需要填写针对该投放人群的真实成本预期，就能获得最好的投放效果，而不需要通过频繁修改出价来获益。
针对智能优化出价方式中的广告，调整优化目标出价需要注意以下事项：
1）修改优化目标出价可能会引起实际转化成本波动；大多数情况下，修改优化目标出价6小时后，实际转化成本才会逐步稳定。
2）每次修改优化目标出价后，在实际转化成本稳定之前，不要再次修改优化目标出价。
3）优化目标出价修改的幅度过大，可能会引起实际转化成本骤升、曝光量骤减等不必要的损失。
关于投放效果1. 关于实际转化成本
实际转化成本不会和优化目标出价完全一致。
广告系统总是以优化目标出价去寻找最合适的用户，但系统预估与用户的实际行为难免存在偏差。因此，就单条广告、单天的广告数据而言，实际转化成本不会和优化目标出价完全一致。
出价合理、投放策略（投放人群与素材的组合）具有竞争力的广告，随着转化数据逐步累积，多天汇总的实际转化成本会非常接近优化目标出价。
2. 实际转化成本的波动
如果单天实际转化成本高于出价的比例在20%以内，是合理的波动范围，可以放心继续投放。
如果出价不合理，实际转化成本可能与优化目标出价差距较大。广告系统会自动减少广告的曝光量，以减少不必要的损失。针对这类广告，建议调整投放策略（投放人群、素材、出价的组合），或暂停广告。
如果对智能优化广告的实际投放效果有疑问，欢迎咨询公众号“微信广告助手”。
3. 转化成本的影响因素
1）新上线广告

每条广告上线初期，广告处于模型学习期，广告成本可能会产生较大波动。如果成本和预算在可承受的风险范围，建议等待24小时后，再根据效果数据进行投放策略的调整。
2）广告变更

修改广告后（比如修改广告定向、出价；比如暂停广告等操作），可能会使广告重新进入模型学习期，致使实际转化成本出现明显波动。如果实际转化成本和消耗情况在可承受的风险范围内，建议等待6个小时且广告实际转化成本接近优化目标出价后，再根据数据决定是否调整或暂停投放策略。
3）竞争环境

每天的流量情况、广告竞争环境不同，因此即使对优化目标出价保持不变，广告实际转化成本仍然有可能产生波动。但长期来看，投放稳定的智能优化广告，多天汇总的实际转化成本与优化目标出价非常接近。
4）API回传的数据质量

特别注意，投放iOS移动应用推广时，如果iOS API激活回传延迟或不稳定，将造成智能优化广告实际转化成本波动较大、广告效果严重不符合预期等问题；其他需要通过API回传转化数据的优化目标也会面临一样的问题。
效果优化1. 风险控制
如你对实际转化成本存在担心或疑虑，我们建议你在投放初期控制日预算，等投放稳定、实际转化成本接近出价时，再逐渐提升预算，以降低成本风险。 特别注意，低出价不能帮助你规避成本风险，反而往往会导致广告曝光量过少。
2. 获得更多的转化量
根据你的投放经验，合理优化广告素材、提高出价，会提升广告的竞争力，从而获得更多曝光量和转化量。
3. 修改广告投放设置
1）每日预算
修改每日预算可能会使实际转化成本在短时间内明显波动。每日预算的修改会影响广告可能触达的人群范围的大小，过低或过高的预算均会对实际的投放效果产生影响。所以，请务必设置真实的广告预算。
特别注意，投放iOS激活或者电商下单等需要回传转化数据的优化目标时，提高预算的操作可能会导致短时间内实际转化成本骤增。这是由于消耗数据是系统实时更新的；而转化数据依赖于API回传，会出现一定程度的延迟，使得转化成本虚高。这种震荡通常出现在预算调整后的数小时内，一般不会超过6小时。
2）投放人群
投放人群是广告投放策略最重要的因素之一，修改投放人群可能会对广告效果产生巨大影响。 因此，如果投放人群变更幅度较大（如投放人群扩大数倍、投放人群跟之前完全不相同等），建议根据风险承受能力，适当控制日预算。
对于广告实际转化成本符合预期、稳定投放的广告，如果想获得更多转化量，可以逐步扩大投放人群，但要注意控制扩大的幅度。
3）确保数据回传API的数据质量
当进行iOS移动应用推广或者电商推广的智能优化广告投放时，若回传转化数据的API回传延迟或者不稳定，会产生如下影响：
使广告数据报表的激活量展示延迟，进而可能导致对广告效果做出错误判断和相应的错误调整。
使广告系统需要更长的时间学习与调整，可能造成广告在短时间的实际转化成本的剧烈波动。
本文介绍智能优化中的“深度优化”，包括其基本概念、适用场景、使用指南、支持的广告位和优化目标组合等。
什么是深度优化？「深度优化」是为对深度转化成本有要求、同时也会关注浅层成本的广告主提供的投放产品。
广告主可同时设定两个优化目标和出价，系统会优化深度目标的转化成本、使其接近出价；同时也对浅层目标的转化成本进行一定控制，使其不会高于出价太多。

例：广告主投放“推广应用（安卓）”，优化目标选择“激活”，深度优化目标选择“首次付费”
平台会帮广告重点优化“首次付费”行为，使广告的首次付费成本尽可能接近客户设定的“首次付费”出价；同时，对浅层“激活”的成本也会有一定的控制，使其不会超出激活出价太多，但不能保证达成激活成本的达成。
什么场景下适合使用深度优化？希望主要优化深层目标的转化效果、希望保深层目标达成，但同时对浅层目标的成本也有一定要求的客户。
如何使用深度优化？“深度优化 - 优化转化行为”入口目前通过白名单控制，请联系微信广告运营开通投放白名单。
深度优化支持哪些广告位？截止2020年5月，深度优化目前支持的广告位包括：
朋友圈信息流
公众号文章底部
公众号文章中部
公众号文章视频贴片
小程序banner广告
激励式广告
小程序插屏广告
深度优化支持哪些优化目标组合？截至2020年5月，深度优化 - 优化转化行为目前支持的目标组合包括（前面为浅层目标，“：”后为支持的深层优化目标）
推广我的应用-Android应用
激活：注册、首次付费、次日留存、下单
注册：进件、授信
进件：授信（白名单控制）
推广我的应用-iOS应用
激活：注册、首次付费、次日留存、下单
注册：进件、授信
进件：授信（白名单控制）
推广我的公众号
关注：公众号内阅读、公众号内注册、公众号内发消息、表单预约、下单
公众号内注册：进件、授信
进件：授信（白名单控制）
收集销售线索
点击：表单预约
表单预约：有效表单预约、下单
注册：进件、授信
在线咨询：有效在线咨询（白名单控制）
电话拨打：有效电话拨打（白名单控制）
进件：授信（白名单控制）
小游戏推广
注册：首次付费、次日留存
本文介绍优化转化价值，即以ROI来评估转化价值并进行优化的能力，支持推广小游戏、推广商品等。
什么是优化转化价值？优化转化价值
，是微信广告为关注用户转化价值的广告主所提供的优化能力。在优化转化价值功能中，广告主可以直接设定目标ROI，平台会基于广告的转化行为和转化金额，预估流量能带来的转化价值，尽可能使广告达成广告主设定的目标ROI。
请注意，优化转化价值的广告会尽可能为广告挑选高转化价值的用户，优化广告的ROI，
但很难实现ROI的大幅提高
。因此在实际投放时，请根据产品的历史ROI情况设定
合理的ROI目标值
，设定过高的ROI目标会严重影响广告的拿量能力。
ROI = 广告转化金额 ÷ 广告消耗。在不同的场景下，ROI会采用不同的计算方式。请根据行业的特点，选择适合的优化产品，避免影响广告效果。
推广小游戏 - 首日广告变现ROI 推广小游戏 - 首日广告变现ROI 是微信广告为IAA小游戏提供的价值优化能力。客户可设定希望广告达到的变现ROI目标，平台会根据广告带来的变现金额情况，尽可能使广告达到客户设定的ROI。广告变现数据全部由平台进行上报，广告主无需进行数据回传即可投放。
如何定义「首日广告变现ROI」？
广告变现，指的是小游戏广告主投放广告带来的用户，在广告主的小游戏内观看/点击广告，为开发者带来广告分成的行为。
在投放端，我们使用「小游戏首日广告变现金额（预估）」和「小游戏首日广告变现ROI（预估）」指标来统计广告的首日变现。具体的指标定义为
1、
小游戏首日广告变现金额（预估）
：小游戏广告带来的注册用户，在注册后同自然日观看/点击广告，为开发者带来的广告分成。该指标为实时计算，因此和开发者在商业化工具箱内看到的数据可能有少量差异。
2、
小游戏首日广告变现ROI（预估）
：小游戏首日广告变现金额（预估）÷ 花费（元）
如何创建「小游戏首日广告变现ROI」广告？
推广目标选择「推广小游戏」，投放位置任选，购买方式选择「竞价购买」。
出价方式选择「智能优化（oCPM/oCPC）」，优化目标选择「注册」，深度优化勾选「优化转化价值」，价值优化目标选择「首日广告变现ROI」。
在设定ROI目标时，如果希望「小游戏首日广告变现ROI（预估）」达到5%，则在输入框内填写0.05。如下图

「注册 - 首日广告变现ROI」、「广告变现 - 首日广告变现ROI」的优化逻辑是什么？
注册 - 首日广告变现ROI、广告变现 - 首日广告变现ROI等变现ROI类广告目前均已升级为直接优化ROI达成的逻辑；即对于投放“注册-首日广告变现ROI”的广告，系统将主要优化广告对应的ROI效果，使变现ROI尽可能接近客户设置的ROI出价。
「注册 - 首日广告变现ROI」、「广告变现 - 首日广告变现ROI」是否支持赔付？
暂不支持。
推广商品-下单-30天下单金额ROI如何定义「30天下单金额ROI」？
30天下单金额ROI = 30天下单总金额 ÷ 广告消耗

例如：广告从1号开始投放

-1号当天的「30天下单金额ROI」= 1号下单总金额 ÷ 1号的广告消耗

-2号当天的「30天下单金额ROI」= 2号下单总金额 ÷ 2号的广告消耗，其中2号的下单行为中包含1号点击行为产生的下单

-3号当天的「30天下单金额ROI」= 3号下单总金额 ÷ 3号的广告消耗，其中3号的下单行为中包含1号和2号点击行为产生的下单

-广告生命周期的「30天下单金额ROI」= 广告生命周期以及之后30天内产生的总下单金额 ÷ 广告生命周期总消耗
如何创建优化「30天下单金额ROI」的广告？
推广目标选择「推广商品」，投放位置任选，购买方式选择「竞价购买」。

出价方式选择「智能优化（oCPM/oCPC）」，优化目标选择「下单」，深度优化勾选「优化转化价值」，价值优化目标选择「30天下单金额ROI」。

在设定ROI目标时，如果希望「30天下单金额ROI）」达到200%，则在输入框内填写2。如下图

「30天下单金额ROI」的优化逻辑是什么？
「下单-30天下单金额ROI」广告目前已升级为直接优化下单ROI达成的逻辑；即对于投放“下单-30天下单金额ROI”的广告，系统将主要优化广告对应的ROI效果，使30天下单ROI尽可能接近客户设置的ROI出价。
「30天下单金额ROI」是否支持赔付？
成本保障条件
在成本保障周期内，ROI效果不达标：使用优先拿量，实际roi/目标roi 小于70%；若没有使用过优先拿量，实际roi/目标roi 小于 80%。
在成本保障周期内，广告累计下单数不少于6个。
赔付金额计算方式：
广告赔付金额 = （1-实际ROI/目标ROI）× 广告总实际消耗
特别注意：
赔付政策是平台为广告主提供的一项福利政策，旨在保护广告投放效果，帮助广告主稳定投放。
请各位广告主务必关注并充分理解以及以下内容：
1、当系统判定广告主、服务商操作存在作弊行为（如恶意修改预算、恶意调整出价等）或其他违反腾讯广告平台规则的行为时，平台有权对相关广告拒赔；
2、对因系统异常或广告主或服务商作弊、违规操作等行为导致的多赔部分，平台有权通过在广告主账户或子客账户余额中扣款、要求广告主或服务商补缴该部分款项等方式，追回多赔付的款项；
其他ROI优化产品能力微信广告还为其他行业的广告主提供下列的ROI优化能力，目前正在
邀请制内测中
，请联系微信广告运营经理了解产品能力详情及开通白名单。

1、IAP游戏行业：推广应用 - 激活 - 首日付费ROI

2、电商行业：推广商品 - 下单 - 30天下单金额ROI
本文介绍一键起量，包括其基本概念、适用场景、适用指南、成本保障政策等。
什么是一键起量？一键起量，是微信广告推出的一种新的oCPM广告投放方式，帮助广告主在使用后提升广告竞争力，快速拿量，探索转化，提高广告的起量概率。
广告主对一条aid设定了用于一键起量的探索预算后，平台会在开启一键起量功能的6小时内尽可能花完探索预算，帮助广告积累转化数据。开启6小时或花完探索预算后，平台会基于广告主的出价对广告进行oCPM优化，尽可能使广告除探索预算外的消耗转化成本符合广告主的出价。
什么场景下适合使用一键起量？商品大促/新游大推等客户希望广告快速起量，或希望快速获取效果反馈的投放场景。平台会帮助从新广告快速起量，进而快速花费预算，探索转化量
深度优化广告，因转化率低导致广告难以积累转化数据，进而难以起量的情况
预算充分，且对新广告投放前期成本波动容忍度较高的广告
数据回流较快的广告
如何使用一键起量？一键起量功能目前正在内测中，请联系微信广告运营开通白名单。
白名单开启后，广告主可在投放端看到一键起量投放入口如下

请在探索预算中，填入可接受的探索预算金额。提交广告或完成广告修改后，广告一键起量功能即上线生效。
请注意，在一条广告的生命周期内，一键起量仅能使用一次。
成本保障政策一键起量期间的消耗不计入赔付金额计算，但转化计入赔付门槛判断。赔付规则与普通广告规则一致，累计转化数>=6个，根据超成本情况，判断是否进行赔付。
举例：一键起量期间产生了500消耗和20转化，非一键起量期间产生了1000消耗和80转化。计算是否应该赔付时，用20+80=100转化量来看是否满足转化门槛，用1000消耗和80转化计算成本偏差和赔付金额。
一键起量消耗可能存在大于一键起量预算的情况
Q&A起量预算一定会在6小时内花完吗？
不一定；广告探索过程中成本过高，系统会判定为学习失败，并停止探索；如广告自身竞争力较差，也可能无法花完预算
起量期间是否转化成本一定会偏高？
大概率偏高，因系统会进行激进探索，来加速新广告的冷启动进程，从而导致成本偏高
因广告暂停投放/预算花完等原因导致起量中止后，如果再次开启广告，系统还会继续探索吗？
不会
广告结束起量期后，是否量级会大幅下降？
广告结束起量期时，系统会将出价平滑恢复至正常水平，同时，广告获取的转化量逐渐下降，成本也逐渐回落，直至完全恢复正常投放；正常投放时的量级还是需要依赖广告自身竞争力，因此是有可能出现较大的下降的。`,
  109: `成本保障规则
为帮助广告在投放的前期得到充分的探索，促进长期稳定的投放，微信广告推出成本保障政策，平台将承担投放前期的探索风险，当成本偏差较大时进行赔付，广告主可以放心新建广告持续投放。

相关成本保障政策如下：
保障的优化目标范围：激活、下单、表单预约、首次付费、注册、公众号内注册、有效表单预约、关注、关键页面访问、商品详情页浏览、公众号内阅读、公众号内发消息、进件、授信、在线咨询、加企业微信客服、付费；
保障的时间范围：从广告首次投放的那一刻开始，及其之后的3个自然日；
在保障时间范围内，广告累积转化数≥6个，且转化成本超过平均出价的20%以上，则进行赔付；
在保障时间范围内，广告操作限制：每天修改广告出价或者定向的次数不能超过2次。
成本保障赔付金额 = 广告实际消耗 – 转化量 * 平均出价
成本保障状态含义
保障状态是以广告维度进行展示，在广告管理列表的“状态”栏中展示，鼠标悬浮在状态标签上可见具体含义：

特别注意：成本保障状态的展示会有一定的延时，大约是新广告首次曝光后的2-3小时内进行展示，状态的展示不影响广告效果，请放心投放。

广告状态具体含义如下：
状态
含义
成本保障中
广告正在成本保障周期内（首次投放及其之后3个自然日）投放，且广告满足成本保障标准，可以放心投放
不满足保障
在成本保障周期内，因广告频繁操作导致不满足成本保障标准
保障核实中
成本保障周期已结束，该广告预计赔付金额XXX元，系统正在核实最终的赔付状态及赔付金额，请耐心等候
已赔付
该广告在成本保障周期内，满足成本保障标准，赔付金额XXX元已到账，可在“微信广告助手”公众号或微信广告投放平台（mp.weixin.qq.com）“最新消息”查看到账通知
保障已结束
在成本保障周期内，广告因转化数或超成本范围不满足成本保障标准，成本保障已结束
成本保障特别说明
赔付政策是平台为广告主提供的一项福利政策，旨在保护广告投放效果，帮助广告主稳定投放。自2020年12月15日起，我们在原有赔付规则的基础上，增加新的规则条款，12月15日后执行的赔付充值，都会基于新的规则条款执行。请各位广告主务必关注并充分理解下列条款内容，避免影响广告的正常投放。

新增条款如下：
当系统判定广告主、服务商操作存在作弊行为或其他违反腾讯广告平台规则的行为时，平台有权对相关广告拒赔；
对因系统异常或广告主或服务商作弊、违规操作等行为导致的多赔部分，平台有权通过在广告主账户或子客账户余额中扣款、要求广告主或服务商补缴该部分款项等方式，追回多赔付的款项。

成本保障FAQ
1.目前支持成本保障策略的优化目标有哪些？目前仅支持激活、下单、销售线索、首次付费、注册、公众号内注册、有效销售线索、关注、商品详情页浏览、关键页面访问、公众号内阅读、公众号内发消息、进件、授信、在线咨询、加企业微信客服、付费、销售线索收集，后续会继续评估更多优化目标的开放。
2.成本保障政策是否有数据回传的限制？没有限制，无论是SDK、API还是平台落地页工具都支持成本保障政策，但数据的稳定上报是智能优化广告投放的前提，建议广告主保证数据上报的质量。
3.广告累积转化数等于5个且成本超出20%是否能赔付？不能，累积转化数一定要大于等于6个且成本超出20%才能获得赔付。
4.修改定向3次，出价1次能够满足保障政策吗？不可以，只有当每天修改广告出价或定向的次数不能超过2次才能满足。
5.为什么使用微信广告投放平台（mp.weixin.qq.com）报表来计算赔付金额和系统计算的赔付金额会不同？系统计算赔付金额时，是按照转化回溯到点击的口径计算，而投放端报表展示转化数据是按照转化发生的时间进行展示。
举例，微信广告投放平台（mp.weixin.qq.com）报表看某条广告，它在保障期的转化大于20个，成本超出25%，应当赔付；但是后端计算赔付金额时，会将保障期外的转化回溯到点击时间，加上回溯的转化以后，成本可能就没有超出20%，无需赔付。
6.保障的时间范围具体怎么理解？“从广告首次投放的那一刻开始，及其之后的3个自然日”，即广告正式投放后首次被用户拉取开始。比如广告从6月1日新建，6月2日审核通过，6月3日被首次拉取产生数据，则保障范围是6月3日及其之后3个自然日，6月3日-6月6日。
7.广告如果确定需要进行赔付，预计多久才能赔付到账？举例，假如广告首次投放时间是6月1日，我们会在6月5日-6日等待广告在6月1日-4日投放所产生的转化回流，然后一般会在第7个自然日，即6月7日时，对所有系统判定需要进行赔付的广告进行赔付。
8.赔付金额以什么样的形式返还？赔付金额将以专门的赔付款项返还到广告主账户上，在后续的投放时可以直接消耗，但这部分款项不可提现退款。
9.是否支持成本保障状态的筛选及赔付明细查看？支持成本保障状态的筛选，可从广告管理列表入口，点击“添加筛选条件”后勾选“智能优化保障状态”，即可筛选。

每日的赔付金额充值完毕后，系统会通过“微信广告助手”公众号或微信广告投放平台（mp.weixin.qq.com）“最新消息”小蓝条推送消息，可点击查看赔付明细。
10.优先跑量广告如何赔付？在保障时间范围内使用过优先跑量功能的广告，广告累积转化数≥6个，且转化成本超过平均出价的30%以上，才进行赔付。
11.深度优化广告如何赔付？首次投放在2022-07-18及以后的广告，赔付规则请参考以下标准。
在成本保障周期内：
若第二目标支持成本保障，则按照第二目标进行保障；
若第二目标未支持成本保障但第一目标支持，则按照第一目标进行保障
若第一&第二目标均未支持成本保障，则该广告不受成本保障
电商ROI广告：
成本保障判断条件： 
在成本保障周期内，ROI效果不达标：使用优先跑量，实际roi/目标roi 小于 70%；未使用优先跑量，实际roi/目标roi 小于 80%
在成本保障周期内，广告累计下单数不少于6个
赔付金额计算方式： 广告赔付金额 = （1-实际ROI/目标ROI）× 广告总实际消耗


首次投放在2022-07-18之前的广告，赔付规则请参考以下标准。

使用了「深度优化 - 优化转化行为」的广告，平台会在成本保障期间拆分阶段进行保障，阶段一对应第一目标，阶段二对应第二目标。每个阶段的消耗及转化数据请参考投放端报表。
若第一目标支持成本保障，则阶段一在成本保障期间的消耗按照第一目标进行保障，转化门槛&成本偏差需满足政策要求；
若第二目标支持成本保障，则阶段二在成本保障期间的消耗按照第二目标进行保障，转化门槛不限制，成本偏差需满足政策要求；
若第一或第二目标未支持成本保障，则对应阶段消耗不受成本保障；
广告总赔付金额 = 阶段一赔付金额+阶段二赔付金额
使用了「深度优化 - 优化转化价值（内测中）」的广告，平台仅支持对「30天下单金额ROI」目标进行赔付，赔付规则如下
在成本保障周期内，ROI效果不达标：实际ROI/目标ROI小于80%
在成本保障周期内，广告累计下单数不少于6个
广告总赔付金额 =（1 - 实际ROI/ROI目标值）× 广告总实际消耗
我们将于近期将「30天下单金额ROI」的赔付规则更新如下，具体执行开始时间以站内信通知为准，请密切留意
广告赔付金额 = 一阶段赔付金额 + 二阶段赔付金额
一阶段赔付金额 = 一阶段广告消耗 - 一阶段下单平均出价 × 一阶段下单转化量（按照下单oCPM的逻辑计算赔付金额）
二阶段赔付金额 = 二阶段广告消耗 - 二阶段下单金额 ÷ 二阶段平均目标ROI
12.哪些操作会被系统视为作弊行为？恶意修改预算、调整出价等行为都有可能被系统判定为作弊行为。为了对抗违规操作、恶意操作，平台有权独立判断广告主或服务商的相关行为给是否构成作弊行为。
13.我如何知道哪些广告命中了拒赔逻辑？命中拒赔逻辑的广告，即使符合赔付规则，平台也不会对广告执行赔付。同时，若涉及多赔付款项追回，平台将通过站内信等方式通知具体的追回金额和方式，请对站内信保持关注。`,
  110: `本页面为大家介绍微信广告自动扩量的相关信息，包括原理及使用FAQ。
自动扩量功能的原理是什么？广告主开启自动扩量功能后，系统会根据该广告历史投放效果，在广告定向范围外，主动寻找符合优化目标和出价要求的目标用户。通过此功能，系统可以在原始定向范围外，有节奏地扩展目标用户，在保持广告原有的转化质量下，扩展更多的目标用户。
创建流程中，广告主可以在定向模块下方找到自动扩量入口：

如何查看自动扩量的详细效果数据？可以在【投放管理-广告】中，开启【细分：自动扩量】来查看广告的自动扩量详细效果数据：

自动扩量详细数据可以将广告效果数据拆分为扩量/非扩量两部分。你将可以看到这条广告中多少的曝光、转化是由扩量部分带来的，以及扩量与非扩量部分的成本各自是多少。
一、支持区分查看扩量与非扩量效果的指标包括：
费用：平均出价、当前出价、花费
曝光：曝光次数
点击：点击次数、点击率、点击均价、可转化点击次数、可转化点击人数、可转化点击率、可转化点击成本
转化：智能优化转化指标、智能优化转化转化成本、智能优化转化率、下单金额
二、需要注意：
扩量部分指的是原有定向没有覆盖到的、完全由自动扩量功能新增带来的增量部分
在观察效果时，建议首先关注广告整体成本是否达成。广告会有扩量成本偏低、非扩量成本偏高，或反之扩量成本偏高、非扩量成本偏低的情况，属于成本控制中的自然波动。只要整体成本满意，且量级有增加，即可以放心使用自动扩量。
注：不支持细分的指标项，展示‘- -’；支持细分但是数据=0 的指标项，展示‘0’
使用自动扩量功能效果如何？某游戏广告主，使用自动扩量后，转化量提升79%，消耗提升85%，转化成本持平且与出价一致；
某网服广告主，使用自动扩量后，转化量提升77%，消耗提升73%，转化成本持平且与出价一致；
某电商广告主，使用自动扩量后，转化量提升157%，消耗提升172%，转化成本持平且与出价一致；
某金融广告主，使用自动扩量后，转化量提升148%，消耗提升143%，转化成本持平且与出价一致。
自动扩量功能目前支持哪些投放场景？支持所有智能优化（oCPM/oCPA）广告。 目前自动扩量在微信广告投放平台（mp.weixin.qq.com）已全量，没有任何使用门槛。
智能优化（oCPM/oCPC）广告使用自动扩量后成本会上涨吗？只要使用智能优化出价方式 ,成本依然可控。
如果使用了自动扩量功能，目标受众是否一定会扩展？只有当系统认为扩量的人群能为你带来更好的投放效果，即：存在新的不低于原来转化质量的人群时，系统才会主动扩展人群。
如果你的广告定向选择过宽，如通投，或者仅选择了地域定向并且地域不可突破，则此时没有足够的扩量空间，无法扩展人群。
使用自动扩量时，如何选择定向？推荐使用核心人群窄定向+扩量（如：使用兴趣行为定向、人群包等，同时勾选扩量）。
是否需要勾选‘’不可突破定向‘’？不可突破定向：即在扩量时，可以指定不扩量的选项。
自动扩量功能是当能够以接近目标成本提高转化量时，系统就会自动扩展目标用户，同时，当你使用扩量功能时，你可以指定：性别、年龄或地域等为扩量限制定向。如果指定了扩量限制定向，扩量时将不会把广告展示到限制定向范围外的用户。
如：你指定扩量限制定向为地域：北京，那么自动扩量将不会展示给非北京地区的用户。
使用自动扩量时，如何选择优化目标和出价？同原来使用智能优化（oCPM/oCPA）一样，根据你希望扩量的行为来设置优化目标，比如：
当优化目标为激活时，自动扩量功能会在定向范围外，寻找符合你激活出价的目标用户。
当优化目标为下单时，自动扩量功能会在定向范围外，寻找符合你下单出价的目标用户。
使用自动扩量的同时，可以使用自定义人群吗？可以
使用自动扩量的同时，可以导入常用定向吗？可以。
自动扩量可以扩展到不同的广告位吗？自动扩量不会突破广告创建时所选广告位对应的流量范围。
使用自动扩量功能时，预计最大覆盖用户和预计最大日曝光量是否包含了扩量人群？不包括。
哪些因素会影响自动扩量的效果？1）广告原始定向：建议使用窄定向（如自定义人群、行为兴趣等）+自动扩量进行投放，可以较大程度地扩展转化量；反之，如果你的原始定向较宽，则扩量空间较有限。
2）如果没有特殊需求，尽量不要勾选“不可突破定向”，以使系统能够最大范围内为你获取高转化率用户。
3）请保持广告预算充分，避免因预算不足而无法扩量。
4）自动扩量功能是当能够以接近目标成本提高转化量时，系统就会逐步自动扩展目标用户。因此：
• 推广商品投放数据越充分，预估就会越准确。
• 转化数据回流实时、准确，有利于效果提升：如果你通过广告SDK接入转化数据，确保转化数据实时、准确上报，有利于扩量功能的有效发挥。
如果选择了再营销或排除再营销，会被突破吗？不会。
如果选择了定向包排除人群，这些人群还会被曝光到吗？不会。我们的扩量范围不包括你选择的排除人群。`,
  112: `智能诊断是微信广告投放端广告管理的一部分，可以辅助你了解账户中每一条广告的成本与曝光状态，并通过分析定向环境、账户预算余额、广告竞争表现等子项对比分析，给予相应的广告优化方案，帮助你更高效地达成广告投放目标。
智能诊断全流程分析指南关键理解：影响广告曝光的三大因素


Step1 外层快速定位问题广告及优化点


Step2 诊断详情 — 成本评估（仅oCPX广告）


Step3 诊断详情 — 曝光评估概况


Step3.1 诊断详情 —— 定向环境分析

Step3.2 诊断详情 —— 预算余额

Step3.3 诊断详情 —— 竞争表现分析



常见问题1. 哪些广告可以使用智能诊断能力？
广告位：朋友圈、公众号底部、小程序banner、小程序插屏、激励视频等
广告类型：所有竞价广告，其中成本分析目前仅支持oCPX广告
诊断条件：诊断数据每4小时更新，累计曝光超过3000个时诊断结果更具参考性
2. 为什么成本已经跑飞了，综合得分还很高？
目前的综合评估分时为曝光竞争力得分，主要反映广告的曝光情况，暂未纳入成本相关数据进行整合评估，成本状态请参考成本评估模块
该处呈现机制尚未完善，造成困扰十分抱歉，目前已经在紧急优化中。
3. 为什么有时候综合评估分数与曝光不匹配？
综合评估分数为曝光竞争力得分，与曝光量在理论上正相关；但由于广告系统特殊机制，在一定页面会优先拉取广告，是否能立即曝光受用户对当前页面的浏览行为影响。比如有一种情况：用户进入朋友圈后时，多条广告竞争拉取机会该广告具有充足曝光竞争力胜出了并嵌入了朋友圈状态流中，但用户此时并未浏览到广告所在位置（第5条），可能几小时甚至十几个小时后才真正看到该广告。在该情况下，广告是具有曝光竞争力的，但曝光并未在当下产生，故出现与分数不匹配的情况。
因此处理解成本较高，相关算法机制已在优化中`,
  113: `一、基本介绍
人群管理的高级功能是什么？

为了进一步提升投放端数据应用能力，在已有的人群管理功能上增加高级功能。通过高级功能入口，可以跳转到
腾讯广告知数平台
（DMP），实现人群智能拓展（lookalike）和人群洞察分析等能力。
高级功能的入口在哪里？

对于在微信广告投放平台（mp.weixin.qq.com）的人群管理，点击高级功能的按钮入口即可。
该功能的适用范围？

朋友圈竞价广告、公众号底部竞价广告、公众号文中广告和小程序广告。
二、使用指引
创建拓展人群：
在人群管理界面，点击高级功能。点击确认后即可进入人群管理的高级功能。
进入后，在页面的点击创建人群，选择智能拓展
选择需要被拓展的种子人群，然后选择倍数点击创建即可
洞察人群分析：
在人群管理高级功能里面，选择人群洞察，即可分析出人群的年龄、性别和地域`,
  96: `1. 入口
广告主功能开通后，在”广告主 - 概览 - 基础财务信息”模块，点击“充值”按钮，选择充值的方式。

2. 充值流程
充值支持微信支付、网银支付与银行转账三种充值方式，广告主可在对应支付方式允许的充值额度区间内，自定义单笔充值金额，金额数值仅支持整数，其中：
微信支付
通过扫描二维码支付，可实时到账；单笔充值金额为 1000 元到 5 万元。
网银支付
通过个人网银和企业网银支付，可实时到账。其中，企业网银支持工行、农行、建行、招行、光大和浦发等银行；单笔充值金额支持 1000 元到 1000 万元。
银行转账
通过银行直接转账，预计一天内到账。



下图为各个银行储蓄卡及信用卡每日/每笔微信支付限额说明。
`,
  97: `如何开具发票？
你需要提交开具发票的申请，在“广告主 - 账户管理 - 发票管理”，填写相应信息即可，完成后提交。


申请需在每月 
1
 日前完成，逾期将顺延到下月处理。申请完成后，腾讯会在每月月初对上个月的充值金额合并开具发票，每月 
15-20
 日顺丰邮寄发票（如遇周末，顺延至下个工作日）。邮寄费用由腾讯承担。
发票抬头：发票抬头为你的微信公众帐号认证主体全称。
发票类型：支持开具普通发票和增值税专用发票。
开具普通发票：需填写发票邮寄信息，包括联系人、手机号码、所在地区、详细地址、邮编，提交后立即生效。
开具增值税专用发票：除了填写发票邮寄信息外，还需填写及上传一般纳税人资料，包括纳税识别号、企业注册地址、企业电话、企业开户银行、《企业开户许可证》《税务登记证副本》或《一般纳税人资格证书》，提交后将会进入审核状态，审核时间为 
3 
个工作日。`,
  98: `登录广告主账户管理页面，选择“账户管理 - 申请退款”，点击右侧 “申请退款” 按钮，开始退款流程。
目前支持通过微信支付、网银支付、银行转账进行充值并消耗后的余额发起退款。

如果申请退款的金额，大于累计充值总额中未开具发票的部分，系统自动进入退票流程。
退票流程完成后，请再次发起退款流程。
若系统提示退款申请失败，请参照以下格式将退款资料发送到微信广告官方客服邮箱 wxad@tencent.com。

如有额外疑问，也可发送退款疑问至 wxad@tencent.com，待确认完毕后再申请退款。
邮件标题：【退款申请】+ 公众号名称 + 公众号认证主体名称

邮件正文：按照以下表格内容填写 　

退款资料
退款申请书
（加盖公众号主体公章）
营业执照扫描件（加盖公众号主体公章）
申请人身份证扫描件（加盖公众号主体公章）
充值凭证（加盖公众号主体公章）
退款银行账户证明
（非必填项；请参考以下 4 项退款类型，若有对应的符合项，请务必填写并加盖公众号主体公章，退款处理周期需 30 个工作日）

非原路退款：客户方要求退回指定银行账户中（若原充值账户无异常情况，建议申请原路退款）

超期订单：原充值订单距今已超过 10 个月

银证退款：原充值渠道通过线下银行转账方式

退款失败：首次申请退款失败并收到邮件告知补充资料
注意事项
发起退款申请之前，请确认你的广告已全部下线。若申请退款后仍有广告费用产生，该费用从预付款中扣除，最终退款金额以腾讯结算退款当时账户实际余额为准。
退款原则为 “原路退回”，即退款到充值时使用的微信账号（若是绑定银行卡支付，则原路退回银行账户中）、网银账号，处理周期为 7 个工作日。`,
  84: `微信广告附近推
是一款面向线下门店客户的营销解决方案，支持
获取销售线索
和
发放优惠凭证
两条营销链路，可满足商家小预算、低成本、简单操作、持续不断曝光引流的推广诉求。
产品亮点
海量曝光，门店推广新蓝海。
通过购买附近推的套餐，商家可以在拥有亿万用户的微信流量场景内做门店推广。
潜客优选，门店周边强覆盖。
微信广告将广告投放给门店周边最有可能到店的客户群体，结合优惠活动，可高效吸引潜客。
曝光扣费，小额套餐持续投放。
附近推针对不同行业推出定制的投放套餐，满足小预算投放需求。
广告场景
附近推广告支持投放在以下广告位。点击查看
优秀案例

广告链路
附近推支持
发放优惠凭证
和
获取销售线索
两种营销目标，满足不同推广诉求。

售卖方案
附近推基于不同行业的客户营销需求差异，分行业推荐投放套餐，同时支持自定义设置投放套餐，满足个性化营销需求。

餐饮美食行业
生活服务行业
家居行业
教育行业
汽车行业
其它行业
投放小贴士
视频手把手教学，快速上手附近推投放。
Step 1：开通账户
Step 2 - 1：广告创建 - 发放优惠
Step 2 - 2：广告创建 - 收集客资
现在开始投放
无需注册公众号，个人微信号认证商家后，3步即可完成广告创建。小程序投放广告省时省力，可随时随地管理广告。扫码体验附近推投放小程序：

查看 
附近推产品介绍文档
 了解更多详情，如有任何产品疑问或反馈，请 
填写问卷
 告诉我们。
附近推自2020年1月正式上线以来，为众多本地商家带来有效的客户转化，小金额实现高性价比门店推广。
餐饮








家装家具






教育





汽车





生活服务








附近推支持获取销售线索和发放优惠凭证两条营销链路，可点击查看操作指引视频，快速了解附近推投放流程；也可点击查看广告推广页、优惠凭证能力、关联大众点评能力、门店管理能力介绍及广告素材建议。
视频教学，手把手操作指引商家认证


广告创建-发放优惠篇


广告创建-收集客资篇


广告推广页什么是广告推广页
广告推广页类似于“线上的电子传单或优惠发放凭证”，用户在朋友圈看到商家投放的广告，点击外层图片即可跳转到该推广页，进一步了解商家详情及领取商家优惠、预约参与活动等。
推广页简易版和丰富版的区别
附近推为商家提供了两套推广页模版：简易版及丰富版。简易版适用于利用简单素材（单图单文）快速生成简易优惠/活动凭证；丰富版适用于利用更多门店/产品相关素材（多图多文）生成门店主页信息，同时可以内嵌优惠、活动等组件。
商家创建推广页时，可以根据自己的素材储备、营销诉求选择推广页模版。同时，广告投放效果会受到外层和推广页的素材质量、活动优惠力度、文案吸引力等多因素影响，广告上线投放后，商家仍可以修改推广页素材（图文）内容，以此优化投放效果或适配营销诉求。
广告素材行业创意建议
好创意一学就会，好文案一用就对。附近推送你一份行业创意速用宝典，更多行业持续更新中，敬请期待。
正餐行业 >
火锅行业 >
烧烤行业 >
西餐行业 >
日韩料理行业 >
自助餐行业 >
烘焙甜品和咖啡厅行业 >
宠物行业 >
美容行业 >
美发行业 >
运动健身行业 >
家政行业 >
休闲娱乐行业 >
广告文案建议
内容
建议主标题对齐内层突出优惠，如【满100减50】；副标题集中展示产品特点，比如餐饮行业可从从口感、味道、食材等入手。
常见错误案例
例1: 过分修饰较难打动人。如“一段自然的旅途，一场难忘的聚会。”

例2: 仅告知产品名称，未说明详情。如“一节钢琴课。”
广告图片建议
拍摄内容
图片展示的信息，常见分为5种常用类型，如是产品展示类、优惠折扣类、人物形象类、场景类和门店风采类。类型可以叠加使用，如人物形象+优惠折扣。

类型一：产品展示类

选取招牌/营销产品进行拍摄，建议使用纯色或者干净背景，主体突出，产品占画面至少二分之一，整体色调鲜明。

类型二：优惠折扣类

聚焦产品的优惠及亮点，图片文案少、字号选择能看清的大小。

类型三：人物形象类

人物选择名人/明星代言，或选择外貌形象佳且衣着整洁素人，使用纯色或干净背景，光线明亮，人物占画面二分之一，人物可居中，像素清晰，色彩鲜明。人物与产品可有互动行为，勾起用户消费欲望。

类型四：场景类

通过产品制作细节突出菜品精致度以及餐厅厨师工匠精神，或通过与明星、热门IP合作，提升品牌热度。

类型五：门店风采类

可展示聚会等活动主题、门面展示、产品制作细节等，光线明亮，图片清晰，避免出现路人、车辆等杂物。

拍摄技巧
拍摄角度可以选择45度顶视、顶视和平拍。

优惠凭证优惠凭证是什么
优惠凭证是微信广告提供的轻量营销工具，通过简单的设置，便可使用户点击广告时，可领取到一张商户提供的优惠券。
商家设置说明
设置优惠内容，不超过10个字，建议可描述简单易懂的优惠信息；
设置温馨提示，不超过60个字，若无特别限制，建议可设置为无任何使用限制。
用户领取说明
用户点击广告外层，将跳转到优惠凭证落地页，落地页样式可在完成三步广告创建后，预览查看；
点击立即领取，便将获取一张商户提供的优惠券；优惠券可通过服务通知或在腾讯荟聚小程序-->底部“福利”频道-->左上角“商家券”找回；
到店后，用户可点击【立即使用】，进行核销；
商户将可在广告详情页，查看用户领取及核销的相关数据。
附用户体验示意图：

特别提醒
用户领取的优惠，可通过点击“查看已领取的优惠凭证” 查看。

关联大众点评页为方便商家丰富优惠凭证页内容，吸引更多用户到店，支持一键关联点评商家主页，在优惠凭证页展示点评相关信息
操作说明
在【设置优惠凭证】页面，打开关联大众点评商铺页开关，将根据门店名称，自动匹配大众点评商家主页
请务必确认是否关联无误，若发现关联有误，可点击修改，更新关联的店铺
若门店无对应点评商家主页或不想展示点评商家主页，则取消选中或关闭开关即可
展示说明
完成上述操作后，将根据点评商家主页信息，展示对应信息。目前暂支持【推荐菜】及【跳转点评小程序】，具体示意如下：

新增门店一、为什么搜索不到门店？
门店选择页的内容使用的是腾讯地图的数据，如果没有搜索到自己的门店，可能是该门店的位置信息尚未被腾讯地图收录。
二、如何新增自己的门店？
1.查找位置标注服务
在微信内搜索“腾讯位置服务”公众号，点击菜单栏中的【我是地主】-【地主认证】，即可打开位置标注服务。
2.新增位置标注
位置标注服务分为“地图标注”和“地点纠错”两个板块。对于腾讯地图未收录的信息，需要点击【地主标注】 - 【新增标注】进入地点搜索页。
在搜索栏中搜索你想要标注的门店名称。
若门店已存在，可点击“认领”。若发现位置信息与现实不符，可点击“修改位置”进行修正。
“认领”和“修改位置”均需要提供相关的证明材料，请提前准备。
若未搜索到你想要标注的门店，可以在页面最下方点击“马上创建”，根据要求填写详细资料并完成提交。
3.等待审核通过
提交创建后，腾讯地图将对标注内容进行审核。审核通过后，即可在“附近推”的门店选择页中搜索到对应的门店。

查看附近推开放行业，了解行业所需资质

附近推开户、投放、结算等环节常见问题答疑。
基础介绍投放附近推广告需要什么账号？
个人微信号、QQ号均可投放，无需注册公众号。
附近推广告的推荐机制是？
系统自动寻找对你的广告感兴趣的人群，无需盯盘，减少广告投放工作量。
广告如何收费？
按套餐售卖，可以按照系统推荐的行业默认套餐购买，也可以自定义套餐购买

附近推是否有最低充值金额门槛？
否，附近推产品没有充值概念，创建广告后进行当前广告的支付，手机微信支付即可。
单条广告是否限制门店数量？
是。单条广告限制同一城市可选择推广门店不超过10个。
如何选择广告主开户行业？
点击首页“创建广告”，在商家认证页面选择行业，不同行业需要提供的材料不同，且行业选择成功后不可修改，请准确选择对应行业。
商家认证开通广告主账户需要准备什么材料？
需要准备以下资料：商家头像、宣传语、营业执照、法定代表人有效证件（如身份证）、行业资质（可进入附近推查看对应行业所需资质）。
商家认证信息填写后还可以改吗？
暂不支持。
审核不通过可以修改吗？
可以修改。
一个微信号能否开通多个广告主账户？
可以。
已开通的广告主账户是否支持注销账户？
暂不支持。
开通账户是否要求使用法人微信号？
不要求，支持任意微信号申请注册。
一个商户主体可以开通多少个广告主账户？
主体暂无开户数量限制。
商家名称一定要和营业执照相同吗？
不需要，商家名称为广告对外展示的门店名称，需要确保商家名称与营业执照主体存在关联性和对应关系。
广告创建广告创建完成后能否修改？
可以修改。修改后需要重新审核，如在广告正式上线后，修改广告可能影响广告投放效果。
可以同时创建多条广告吗？
可以。
广告什么时候开始投放？
广告审核通过后，将于广告主设置的投放时间开启时开始投放。
优惠凭证可以在微信卡包找到吗？
不可以，用户领取优惠凭证可通过【腾讯荟聚】小程序或服务通知找回。
门店选择找不到我的门店怎么办？
门店选择页使用的是“腾讯地图”的数据，如果没搜索到自己的门店，有可能是你的门店尚未在腾讯地图新增门店。新增门店方式：下载腾讯地图app→点击“反馈”→点击“新增地点”→点击“我是商户，需要入驻或新增商铺”→上传资料完成创建→等待审核通过，审核通过后即可于门店选择页选择门店进行推广。
多门店投放广告，能否同时选择不同省市的门店？
多门店投放只能选择同城门店，门店数量上线为10。
单家门店投放广告，可以选择其他省市的门店吗？
可以。
优惠凭证温馨提示，能否添加微信号及手机号码？
不支持添加微信号，支持添加手机号码。
优惠凭证能否设置优惠有效期？
可以。
广告投放我可以收到自己的广告吗？
可以。在广告创建后添加白名单，白名单用户可在朋友圈收到上线后的广告。每条广告最多配置5个白名单。
可以让亲朋好友们收到我的广告吗？
不一定，由于系统会自动寻找对你的广告最感兴趣的人群，你的亲朋好友不一定符合最佳标准。
开始投放广告后，可以修改广告吗？
可以修改。但因为广告修改后需要重新审核，修改广告可能影响广告投放效果。
广告开始后，可以暂停吗？
可以暂停。暂停操作可能影响广告投放效果，建议长期保持投放。
暂停投放广告后，可以重启吗？
可以重启。
可以退钱吗？
开户失败以及广告未开始/已结束可以退钱，退款功能在账户信息-余额退款页面，退款金额原路返回。
多家商家同时购买套餐投放广告，曝光流量如何分配？
如果多条广告同时定向到了同一个用户，系统会根据数据预判用户可能点击广告、领取优惠凭证等因素的概率，来决定给用户曝光哪一条广告。
是否支持用户多次领取优惠凭证？
暂不支持，单条同一优惠凭证仅支持领取一次。
投放中的广告是否支持修改？
推广人群、广告素材、优惠凭证信息、投放时间（需要审核拒绝且没有消耗）均支持修改。
投放结束没花完的钱怎么办？
可以在广告投放结束后一键退回。
广告效果怎么查看？
广告主可随时进入小程序查看广告观看量，优惠领取量，广告观看量代表看到广告的人数，优惠领取量说明可能到店使用的人数； 也可以从小程序跳转腾讯广告线索管理平台查看广告获取的客资并进行客资跟进。
为了方便广告主了解广告效果，请关注“微信广告助手”公众号，接收每日广告数据推送。
开具发票支持开具什么发票？
支持开具普通发票和增值税专用发票。你可以提前准备好以下信息，与在线客服沟通时可能需要提供：
普通发票
联系人姓名、手机号码、所在地区、邮寄地址、邮编、纳税识别号（当发票抬头为企业时需提供）
增值税专用发票
联系人姓名、手机号码、所在地区、邮寄地址、邮编、纳税识别号、企业注册地址、企业电话、企业开户银行、开户银行账号、《企业开户许可证》、《税务登记证副本》或《一般纳税人资格证书》
开票金额是按照套餐金额还是实际支付金额？
实际金额。
退款是否需要退回已开发票？
退款需要退回已开发票。由于退款导致已开发票金额与实际消费金额不一致，所以退款钱需要将已开发票退回，微信广告再根据你实际产生消费的金额给你重新开具发票。
如何退回已开发票？
请将发票退回至退回地址，收到退回发票后，开始启动退款流程。
普通发票需提供退票信息：
广告主名称、账户APPID、退票原因：申请退款、联系人、联系方式。 退回地址：广东省深圳市南山区深南大道9998号万利达大厦14楼邮件中心；收件人：马硕翌；联系电话：0755-86013388-886091
增值税专用发票： 
请按以下模版提供「增值税专用发票拒收证明」并加盖公章，与发票一并退回。

在PC端点击下载模板
渠道售卖目前产品当售卖策略是什么？
目前开放客户自行选购投放，也支持服务商售卖。服务商售卖目前仅开放部分名单。
新服务商如何参与售卖？
目前附近推已全面开放服务商售卖，若为腾讯广告现有服务商可联系渠道经理沟通咨询，若为新服务商申请售卖可邮件联系 ：v_xmyyzheng@tencent.com 进行咨询。
服务商信息查询点击查询 
附近推服务商名单`,
  85: `微信广告投放平台（PC 端）
为视频号创作者提供了丰富的推广能力，可满足专业化的视频号内容推广需求。
微信广告投放平台更适合有更专业投放需求的客户，需要有认证公众号的条件，从投放平台进行广告主开户及投放。若无认证公众号、或希望更轻便的投放，可选择移动投放端（手机端），可查看 
视频号推广移动投放介绍
注：两端开户账号体系不同，建议开户之前先确定好投放工具。
产品亮点
专业化投放能力：满足专业投放需求，支持服务商代投放
覆盖海量流量：可投放至朋友圈、公众号等广告场景，覆盖微信生态优质流量
专属广告能力：提供更丰富的广告组件能力，满足定制化广告需求
广告场景
投放平台支持将视频号视频及直播推广至以下广告位。如需了解更多，可查看 
优秀案例


投放指南
微信广告投放平台投放全流程简述

注意事项：
账号内容需符合 
视频号运营规范
以及 
视频号直播行为规范
；
账号推广内容需符合 
微信广告外层素材要求
。
1. 账户开通
开放行业推广视频：请查看 
微信广告开户行业要求简介
。
推广直播：部分行业直播广告未开放，若推广类型无法选择直播，则说明行业受限暂未开放直播，详情可与行业经理或微信广告助手（ad_helper）确认。
开通账户使用投放平台进行账户开通前，需首先开通微信公众号：
如何开通微信公众号
如何开通微信广告主
开通账户后，需进行账户充值，完成充值后即可进入广告创建环节。账户充值流程如下：
如何进行账户充值
账号注意事项：
当前仅部分行业账号支持跨主体投放，可以在【工具箱】-【视频号授权】中，发起视频号扫码授权。若无此入口说明该行业暂不支持跨主体投放。如有特殊原因请与对应行业运营经理沟通；
2. 广告创建
注意事项：
投放过程暂不支持修改视频号名称及头像，否则广告会被驳回；
投放过程中，不能设置视频为仅自己可见，也不能设置视频号为私密账号，否则落地页无法正常读取展示；
投放朋友圈时，暂停广告可能因回流问题产生后续曝光，造成继续扣费，属于正常情况，建议合理设置金额。
推广目标一：推广视频
投放样式链路介绍-朋友圈广告位

链路介绍-公众平台广告位

外层样式介绍

内层（落地页）样式介绍

创建流程1.计划层级

2.广告层级

3.创意层级


广告调优


推广目标二：推广直播
投放直播广告前需要先了解的注意事项：
所有节目类直播都必须报备，需提前与行业经理沟通；
部分行业直播广告未开放，若使用新版创建后，推广类型无法选择直播，则说明行业受限暂未开放直播，详情可与行业经理或微信广告助手（ad_helper）确认。
投放样式链路介绍-视频号直播推广

链路介绍-视频号直播预约推广

外层形态样式介绍（直播 & 预约）

内层样式能力介绍（直播） 
注：如需使用转化组件，请详细阅读附录中的转化组件注意事项

内层样式能力介绍（预约）

创建流程1.购买方式及广告位选择

2.时间设置 & 优化目标设置 & 帐号主体校验

注意事项直播转化组件注意事项：
投放前：
转化组件会随广告下线而下线，因此创建转化组件的广告结束时间建议晚于实际直播结束时间；
转化组件与直播间一一绑定，因此用户不管从广告或非广告渠道进入均能看到转化组件；
转化组件需要在直播开播前广告通过审核，转化组件才能生效；
若多条广告配置转化组件会冲突，新生效的转化组件会覆盖旧的；
一旦配置成功生效后无法修改和变更，如广告已上线或处于待投放状态，需要变更都需要关闭直播重新配置。
暂仅支持从朋友圈广告配置，暂不支持从公众平台广告配置；
投放中 & 投放后：
转化组件需要主播在开播后
使用主播端进入“链接”半屏点击推送，才会展示
。

特别留意：
广告转化组件主播点击推送后，会立即展示在直播间内用户端。
新进直播间的用户，广告组件会立即展示（其他类型链接会在进入直播间30s后展示）
，用户关闭组件后，需重新推送才会展示。若主播推送其他非广告链接（企微，公众号等），则当前链接会被替换，无法同时展示多个链接；
转化组件的转化数据会归因到对应产生数据的广告上；若非广告渠道带来的转化，会统一展示在实际生效了转化组件的广告上；（因此，只需给其中一条广告设置“直播间”模块即可，其他的计划不设置“直播间”模块，仅作为广告引流）
视频号直播开播期间，不要复制广告计划，否则会造成直播间配置失效
直播间背景图 & 喝彩图标注意事项：
直播间背景图 & 喝彩图标转化组件会随直播下线而下线
视频号推广移动投放小程序
是微信广告为视频号创作者提供的低门槛内容加热工具，让更多人看到你的视频号视频内容或直播。
移动投放端（手机端）适用于更轻便的投放行为，操作更方便，但可供自定义的选项也更少。若有更专业化的投放需求，且有认证公众号的条件，建议选用微信广告投放平台（PC 端），可查看 
视频号推广专业投放介绍
注：两端开户账号体系不同，建议开户之前先确定好投放工具。
产品亮点
简易推广方式： 操作简单，快速推广
让更多人看见：提升内容播放，实现关注量增长
连接社交生态：让你的内容展示在微信广告
广告场景
视频号移动投放小程序支持将视频号视频及直播推广至以下广告位。如需了解更多，可查看 
优秀案例


投放指南
移动端投放全流程简述

注意事项：
账号内容需符合 
视频号运营规范
以及 
视频号直播行为规范
；
账号推广内容需符合 
微信广告外层素材要求
。
1. 账户开通
开放行业推广视频：
查看广告开户行业要求简介
。
推广直播：部分行业直播广告未开放，若推广类型无法选择直播，则说明行业受限暂未开放直播，详情可与行业经理或微信广告助手（ad_helper）确认。
开通账户仅需两步，即可完成视频号推广账户的开通：
选择类型/行业

提交资质及审核

1. 选择账户类型
支持选择个人账户类型&企业账户类型，审核通过后不可修改
个人仅能开具个人名称抬头的普通发票，企业支持开具企业名称抬头的普通发票/专用发票
该账户类型仅用作推广审核，与视频号本身的认证类型无关（即个人认证的视频号也可采用企业类型进行广告开户）
2.上传资质信息
行业类型：请根据需要投放的内容的行业类型进行选择，并根据提示上传对应的资质证明
如果账户类型为个人，则需要上传个人创作者的身份证以及联系方式
如果账户类型为企业，则需要上传企业营业执照，和企业法人的身份信息以及联系方式
3. 提交并审核
完成资质信息上传后点击提交，我们将会对你的账户信息进行审核，审核时长预计为2个工作日，审核通过后即可推广视频号的视频和直播

开通账户后，可选择进行账户充值或创建广告后进行支付。
账户充值流程如下：

2. 广告创建
投放前需要先了解的注意事项：
投放过程暂不支持修改视频号名称及头像，否则广告会被驳回，需重新创建广告并提交审核；
投放过程中，不能设置视频为仅自己可见，也不能设置视频号为私密账号，否则落地页无法正常读取展示。
推广视频广告链路
视频号视频推广形式-投放朋友圈广告位

视频号视频推广形式-投放小程序激励广告位

广告创建流程
创建流程总览

1. 选择推广视频：
首页点击推广视频按钮，选择需要推广的视频
2. 设置推广内容：
推广样式：我们会将该视频推广到朋友圈广告中，系统会自动拉取该视频的封面图作为朋友圈样式，你也可以手动上传图片；需要输入该视频推广到朋友圈的推广文案
期望获得的曝光量：该曝光量指该视频号视频广告在朋友圈中的曝光量（曝光量为期待值，仅提供参考， 非最终会获得的实际曝光）
推广人群：选择本次推广的目标用户，可以选择智能匹配人群，系统会自动为你匹配合适的人群；也可以选择自定义人群（当前支持年龄、性别、地域等定向维度）
推广时间：选择本次推广的开始时间和结束时间
提交推广订单：设置完推广内容后，点击立即创建，支付推广金额。提交推广后平台将会在2个工作日左右完成对推广内容的审核

投放金额的设置方式

广告位选择-推广至朋友圈/小程序激励浏览广告

定向的设置方式

外层图片&文案的设置方式

推广直播广告链路
视频号直播间推广形式（仅支持朋友圈广告位）

视频号直播预约推广形式（仅支持朋友圈广告位）

广告创建流程
创建流程总览

1. 推广直播
开启直播：需要开启直播，之后进入小程序推广工具点击推广直播
推广样式：我们会将该直播推广到朋友圈广告中，系统会自动拉取该直播的封面图作为朋友圈样式，你也可以手动上传图片；需要输入该直播推广到朋友圈的推广文案
期望获得的曝光量：该曝光量指该视频号直播广告在朋友圈中的曝光量（曝光量为期待值，仅提供参考， 非最终会获得的实际曝光）
推广人群：选择本次推广的目标用户，可以选择智能匹配人群，系统会自动为你匹配合适的人群；也可以选择自定义人群（当前支持年龄、性别、地域等定向维度）
推广时间：选择本次推广的开始时间和结束时间（建议与直播时间相近，直播结束后，对应广告也会联动结束）
提交推广订单：设置完推广内容后，点击立即创建，支付推广金额。提交推广后平台将会在2个工作日左右完成对推广内容的审核

2. 推广直播预约
开启直播预约：需要开启直播预约，之后进入小程序推广工具点击推广直播
推广样式：我们会将该直播预约推广到朋友圈广告中，系统会自动拉取该直播预约的封面图作为朋友圈样式，你也可以手动上传图片；需要输入该直播预约推广到朋友圈的推广文案
期望获得的曝光量：该曝光量指该视频号直播预约广告在朋友圈中的曝光量（曝光量为期待值，仅提供参考， 非最终会获得的实际曝光）
推广人群：选择本次推广的目标用户，可以选择智能匹配人群，系统会自动为你匹配合适的人群；也可以选择自定义人群（当前支持年龄、性别、地域等定向维度）
推广时间：选择本次推广的开始时间和结束时间
提交推广订单：设置完推广内容后，点击立即创建，支付推广金额。提交推广后平台将会在2个工作日左右完成对推广内容的审核

直播时间 & 外层素材的设置方式


现在开始投放
使用微信扫码，快捷开启视频号投放：

注：目前小程序投放端仅支持基础样式推广，有更多需求（如全幅卡片、直播间装饰、人群定向等）的客户，可以通过 
微信广告投放平台（PC端）
进行视频号推广。
微信广告投放平台优秀案例
微信广告投放平台（PC端）助力商家达人实现专业化视频推广和直播推广诉求，满足多种营销目标。如需查看更多案例，可查看
视频号商业化案例库
推广视频朋友圈信息流广告


小程序激励广告


移动投放端优秀案例
推广视频



推广直播



开户帮助
如何选择账户类型？支持选择个人账户类型&企业账户类型，审核通过后不可修改
个人仅能开具个人名称抬头的普通发票，企业支持开具企业名称抬头的普通发票/专用发票
该账户类型仅用作推广审核，与视频号本身的认证类型无关（即个人认证的视频号也可采用企业类型进行广告开户）
个人账户和企业账户有什么区别？适合的视频号账户主体不同

推广个人账户适合有线下身份的个人、线上博主和自媒体申请；推广企业和机构适合非个人主体( 如政府机构、企业、品牌机构、媒体和社会团体等)申请。创作者可根据视频号账户的主体身份选择适合的开通类型。
所需认证资质不同

个人账户资质须创作者身份证；企业账户需要营业执照和法人身份证。
发票开具的主体不同

发票开具的抬头需要与开通推广账户时填写的主体保持一致。即如果需要开具以A公司为抬头的发票，则推广账户填写的主体也需要为A公司。
开通个人的视频号推广账户有什么要求？推广个人视频号的账户，须提供以下3项信息:
所选行业对应的行业资质；
视频号相关的联系人信息；
创作者身份证照片。
开通企业的视频号推广账户有什么要求？推广企业视频号的账户，需填写以下4点要求：
所选行业对应的行业资质；
视频号相关的联系人信息；
企业的营业执照；
企业法定代表人身份证照片。
开通后可以修改账户类型吗？推广账户成功开通后，暂不支持修改账户类型。
视频号（小程序端）账号的开通流程是？
资料审核需要多久？完成材料上传后，我们将在两个工作日内完成审核。
审核未通过的原因是？驳回原因1

身份证正面不符合要求；原因是您所上传的资质证件与要求上传的证件不相符，请准备正确的资质后再次提交申请。
驳回原因2

身份证背面不符合要求；原因是您所上传的资质证件与要求上传的证件不相符，请准备正确的资质后再次提交申请。
驳回原因3

ICP备案网站无法访问，请确认后申请。
视频推广流程
为什么审核通过后会被驳回？推广视频过程中，出现以下情况订单将会下线：
设置账户为隐私账户或设置该视频为自己可见
修改视频号名称或者头像
为什么推广已暂停，还是会扣费？暂停后，会因为曝光延迟，导致产生少量扣费。
如何创建一条视频推广？
选择推广视频

首页点击推广视频按钮，选择需要推广的视频。
设置推广内容
推广样式：我们会将该视频推广到朋友圈广告中，系统会自动拉取该视频的封面图作为朋友圈样式，你也可以手动上传图片；需要输入该视频推广到朋友圈的推广文案
期望获得的曝光量：该曝光量指该视频号视频广告在朋友圈中的曝光量（曝光量为期待值，仅提供参考， 非最终会获得的实际曝光）
推广人群：选择本次推广的目标用户，可以选择智能匹配人群，系统会自动为你匹配合适的人群；也可以选择自定义人群（当前支持年龄、性别、地域等定向维度）
推广时间：选择本次推广的开始时间和结束时间
提交推广订单：设置完推广内容后，点击立即创建，支付推广金额。提交推广后平台将会在2个工作日左右完成对推广内容的审核
直播推广流程
创建了订单，什么时候才开始推广？直播订单符合以下三个条件将开始推广:
订单在通过审核；
符合设置的推广时间；
已经开始直播。 
建议在直播前创建直播推广订单，我们会尽快为你审核，减少推广启动时间。
直播结束后，推广订单是否会结束？直播结束后，对应的推广订单也会自动结束；
因为曝光结束延迟，导致少量扣费。如需减少直播结東后的延迟扣费，建议推广结束时间设置比实际直播结束时间提早30分钟。
为什么直播还没有开始，推广就结束了？设置的推广时间与实际直播时间需要保持基本一致，如果到达推广时间72小时后尚未直播，推广订单会自动结束。
如何创建一条直播推广？
开启直播：需要开启直播，之后进入小程序推广工具点击推广直播
推广样式：我们会将该直播推广到朋友圈广告中，系统会自动拉取该直播的封面图作为朋友圈样式，你也可以手动上传图片；需要输入该直播推广到朋友圈的推广文案
期望获得的曝光量：该曝光量指该视频号直播广告在朋友圈中的曝光量（曝光量为期待值，仅提供参考， 非最终会获得的实际曝光）
推广人群：选择本次推广的目标用户，可以选择智能匹配人群，系统会自动为你匹配合适的人群；也可以选择自定义人群（当前支持年龄、性别、地域等定向维度）
推广时间：选择本次推广的开始时间和结束时间（建议与直播时间相近，直播结束后，对应广告也会联动结束）
提交推广订单：设置完推广内容后，点击立即创建，支付推广金额。提交推广后平台将会在2个工作日左右完成对推广内容的审核
如何创建一条直播预约推广？
开启直播预约：需要开启直播预约，之后进入小程序推广工具点击推广直播
推广样式：我们会将该直播预约推广到朋友圈广告中，系统会自动拉取该直播预约的封面图作为朋友圈样式，你也可以手动上传图片；需要输入该直播预约推广到朋友圈的推广文案
期望获得的曝光量：该曝光量指该视频号直播预约广告在朋友圈中的曝光量（曝光量为期待值，仅提供参考， 非最终会获得的实际曝光）
推广人群：选择本次推广的目标用户，可以选择智能匹配人群，系统会自动为你匹配合适的人群；也可以选择自定义人群（当前支持年龄、性别、地域等定向维度）
推广时间：选择本次推广的开始时间和结束时间
提交推广订单：设置完推广内容后，点击立即创建，支付推广金额。提交推广后平台将会在2个工作日左右完成对推广内容的审核
查看数据
如何快速查广告数据？广告列表
： 查看已创建的广告的状态及数据，点击后进入广告详情页面
基础信息
： 广告详情页面可以查看该广告的基本信息
数据详情
： 广告详情页面下拉，可以查看广告详细数据及变化趋势，包括花费、曝光、点击等详细数据
财务相关
如何充值？在首页点击账户金额即可进入充值支付页面，选择需要充值的额度，使用微信支付成功后会立即到账（若需对公转账，请与行业经理联系；若对公转账，则退款无法走自助退款，也需要走 线下申请退款流程）。
如何申请退款？在首页点击账户金额进入退款页面，点击退款按钮进入退款流程，发起退款后退款将在48小时内审核，审核通过后2-7个工作日退回对应充值账户。其中以下情况暂不支持线上自助退款，需线下退款：
当账户中有广告未结束投放且仍有余额
有尚未退回的发票
发起退款后24小时内
若对公转账，则退 款无法走自助退款，也需要走 线下申请退款流程
如何开具发票？支持开具普通发票和增值税专用发票。你可以提前准备好以下信息，与在线客服沟通时可能需要提供:
普通发票联系人姓名、手机号码、所在地区、邮寄地址、邮编、纳税识别号(当发票抬头为企业时需提供)
增值税专用发票联系人姓名、手机号码、所在地区、邮寄地址、邮编、纳税识别号、企业注册地址、企业电话、企业开户银行、户银行账号、《企业开户许可证》 、《税务登记证副本》 或《一般纳税人资格证书》
开票金额是按套餐金额还是实际支付金额？实际金额。
退款是否要退回已开发票?退款需要退回已开发票。由于退款导致已开发票金额与实际消费金额不一致, 所以退款钱需要将已开发票退回，微信广告再根据你实际产生消费的金额给你重新开具发票。
如何退回已开发票？普通发票需提供退票信息：
广告主名称、账户APPID、退票原因：申请退款、联系人、联系方式。
退回地址：广东省深圳市南山区深南大道9998号万利达大厦14楼邮件中心；收件人：马硕翌；联系电话：0755-86013388-886091
增值税专用发票：
请按以下模版提供「增值税专用发票拒收证明」并加盖公章，与发票一并退回。
在PC端点击下载模板
如何与客服取得联系？请前往“微信广告助手”公众号进行咨询
前往公众号“微信广告助手”
反馈问题`,
  235: `成为腾讯广告服务商，可以为广告客户提供高效的广告投放服务。腾讯广告服务商系统支持多帐号运营管理、数据查看分析、角色分配管理等功能。
一、服务商准入标准
以下标准为充分非必要条件，腾讯公司将根据实际情况对服务商进行筛选。
公司注册资本100万以上，成立时间超过1年且在广告行业领域内的从业时间不低于1年，具有独立法人资格，具备广告相关合法经营权的单位；
良好的公司经营能力：有固定成熟的互联网运营团队，拥有固定的办公场所且面积不得少于100平方米，具备开展广告代理业务的办公条件；拥有具备一定专业水平的市场策划、销售及运营人员，公司员工人数不得少于20人。
具有丰富企业客户服务经验，符合区域定位和布局，其企业过往业务与广告业务相关且高度契合优先；
制定切实可行的商业计划，服务商需季度完成对应的业绩，一个季度未达成，腾讯有权终止合作，并暂停服务商账户权限；
企业具有良好的形象和信誉，有明确的合作动力和诉求，愿意与腾讯广告一起长期开拓效果广告市场；
在2年内，不存在任何因违反《广告法》、《互联网广告管理暂行办法》等相关广告监管领域法律法规而受到过行政处罚；
不存在任何未履行债务及任何未按照已生效的司法判决/行政处罚支付/缴纳相关款项的情况。
二、服务商申请流程
提交申请
官网申请通道，登录QQ账号，提交相关信息和资料。建议注册新QQ账号进行登录，避免因运营人员更换而造成账户运营中断。 如果申请QQ账号已绑定广告主，此QQ账号无法绑定服务商系统。
资质审核
腾讯方将对服务商提交的相关信息和材料进行核实。符合准入标准的服务商，将在提交申请后的1个工作日，开通服务商账号及权限并进行邮件或短信反馈；如果不符合准入标准则直接驳回。
参加宣讲
服务商将在提交申请后的5-7个工作日， 收到短信反馈，邀请参加线上宣讲培训。宣讲内容主要为：服务商后台使用指南、服务商生态、服务商管理规范等。
对公验证
为保障服务商权益和避免出现服务商资质被盗用的风险，所有服务商在开户后，需要进行对公打款验证。通过后，方可开通子客转账功能。（点击查看
服务商对公打款验证流程
）
缴纳保证金
所有服务商需缴纳5万风险保证金，缴纳后开通投放权限。（点击查看
保证金缴纳流程
）
马上申请成为服务商
点击进入
服务商注册页
，仅需三步，即可注册成为腾讯广告服务商。（点击查看
服务商自助开户指引
）

更多腾讯广告服务商相关信息，请查看
腾讯广告官网服务商页面
。`,
  189: `广告管理常见问题1、广告提交后为何不能修改广告的出价方式和优化目标？
修改广告的出价方式和优化目标后，广告投放系统需要一段时间更新广告信息，在此期间广告可能会上线产生消耗，为避免给广告主造成不必要的损失，暂不支持修改已提交广告的出价方式和优化目标。如需更换出价方式或优化目标投放，请新建投放计划或广告。
2、为何不能灵活修改广告的自定义投放时段？
平台安全策略调整，设置自定义时段投放的广告，修改开始时间时只能修改到当前时间的2个小时之后。举例：广告初始设置的投放时段为每天07:00-17:00，在08:00时修改投放时段开始时间点，只能改到10:00之后（含10:00）的某时刻。
3、临近广告上线前修改投放开始时间，为什么会产生消耗？
临近上线时修改广告的开始时间后，系统需要一段时间更新信息，这时广告可能会按修改前的开始时间上线，进而产生消耗。目前投放端已增加相关提示，临近广告上线前1小时修改广告开始时间时触发提示，敬请留意。
4、暂停广告后为何还会持续产生少量花费？
在广告暂停前拉取到广告的部分用户可能在广告暂停后才看到或点击广告，进而产生花费。
5、朋友圈广告上线后为何不能修改素材？
朋友圈广告上线后，可能已经有部分用户在朋友圈中与广告产生互动（点赞、评论等），如果修改素材，可能导致素材内容和用户的互动意愿或内容不相符，为了保证用户体验，暂不支持修改已上线的朋友圈广告素材。
6、广告投放结束后，为什么可能还产生扣费？
微信广告按广告真实曝光/点击进行计费，其中按曝光计费的广告在投放结束后产生的曝光不进行扣费，按点击计费的广告在投放结束后产生的点击将进行扣费。
7、设置预算后，为什么可能会出现低金额超预算情况？
设置各级预算后，系统将尽量将消耗控制在预算范围内，超出的部分将不再计费；但由于临近预算上限时，存在多次曝光同时请求扣费、曝光延时、计费统计延迟等偶现场景的出现，可能会出现低金额超预算情况出现。
若对该情况有疑问，欢迎随时通过公众号「微信广告助手」反馈给我们。
相较于旧版的自助投放系统，新版投放端的优势是什么？朋友圈和公众号广告创建体验统一：同一个投放计划，通过添加广告，相同创意定向不同人群投放（不同售卖价格区间须拆分不同广告）。
自定义广告管理列表，投放计划/广告双维度分析，提高数据分析和广告管理效率。
快速复用已有投放资源：
支持复制投放计划和广告
常用定向保存和使用
推广页统一管理并支持多广告位复用。
提高公众号互选广告询量效率，支持查询一段期间内流量主合作排期。
朋友圈排期广告如果预定‘’可消耗金额‘’显示的量，是否定向条件内的所有用户都会收到？可消耗金额=该定向下库存全量- 已被其他客户锁定消耗的库存。 该地区所有符合定向条件内的人不一定会全部收到广告。
再营销和排除营销是什么？如何设置？再营销
：向与你的业务有过关联的用户投放广告。
公众号粉丝（包含当前关注用户及最近半年取消关注的用户）
最近1年曾领取微信广告卡券的用户
最近1年对你的广告感兴趣的用户（点击广告、广告详情页、对朋友圈广告点赞或发表正面评论）
排除营销
：拓展新用户，不再向与你的业务有过关联的用户投放广告。
公众号粉丝
最近1年曾领取微信广告卡券的用户
最近1年对你的广告感兴趣的用户（点击广告、广告详情页、对朋友圈广告点赞或发表正面评论）
自助投放端内，可在投放设置阶段的设置人群定向页面内勾选此功能。
我应该使用CPM 出价方式还是oCPM出价方式来投放竞价广告？取决于你的实际推广需求以及账户投放情况。如果有明确的转化量目标和转化成本预期，且近期累积了一定的转化数据，建议使用 oCPM 投放方式。刚刚开始朋友圈广告投放的账户，建议先使用 CPM 出价方式累积转化数据。
oCPM 广告转化成本超过出价很多（超出比例大于20%），怎么办？通常情况下，oCPM 广告的转化成本与出价基本一致，但以下3种情况，可能导致单日的转化成本与出价有一定差距：
广告上线不足24小时：系统模型需要一定的学习时间，因此广告刚上线时，有可能会存在广告曝光较少、转化成本远低于或高于出价的情况。 这种情况下，建议保持投放，耐心观察数据。
广告上线超过24小时，但转化量低于30个：广告竞争力不足（由广告素材和投放人群的组合决定）或出价过低，会导致广告曝光量较少、转化量较低，系统无法有效控制转化成本。这种情况下，广告的消耗金额会比较低，以避免预算浪费。这种情况下，建议暂停或调整广告。
大幅度或频繁调整出价、大幅度调整投放人群：每一次调整，系统模型都需要重新学习，让广告转化成本符合当前的出价。如果调整幅度较大，在系统重新学习期间，成本会存在一定的波动：
如果广告成本和消耗超出了承受范围，建议暂停广告。
如果广告成本在承受范围内、但广告曝光量不足，建议重新创建一条广告，进行投放；如果广告成本在承受范围内，广告曝光量持续提升，建议保持投放，耐心观察数据。
如果以上3种情况均不符合，欢迎咨询公众号“微信广告助手”，获得建议与帮助。
常见数据问题Q&A                    问题/现象
                             原因
                      解决方案
人数指标远小于相应的次数指标
次数指标是实时计算的，人数指标是离线计算的会有3个小时的延迟（销售线索人数、落地页按钮点击人数等ocpm优化目标不在此列）
次日查看前一日的人数指标会得到准确数字。
指标“点击人数”，远远大于“视频+文字链+头像昵称”点击人数
朋友圈的点击UV是实时更新的，视频/文字链/头像/昵称的点击人数是离线更新的，有3个小时左右的延迟。
以3小时前的数据为准
数据报告：数据总和>投放管理
数据报告页：会包含已删除的广告的数据
--`,
  190: `
朋友圈广告
 
微信朋友圈广告是基于微信生态体系，以
类似朋友的原创内容形式在用户朋友圈进行展示的原生广告
。
通过整合亿级优质用户流量，利用专业数据处理算法，朋友圈广告为广告主提供了一个国内独一无二的互联网社交推广营销平台。
朋友圈广告当前已开放 36 个一级行业类目，你只需要符合朋友圈广告准入行业要求，即可投放朋友圈广告。
支持的推广目标
推广品牌活动、推广门店、收集销售线索、推广商品、推广应用、推广公众号、推广小游戏、推广视频号
支持的广告样式
常规式广告
组合式卡片广告
全幅广告
全景广告
滑动广告
长按广告
轮播广告
摇动广告
IP 互动广告
人群定向
朋友圈广告支持按照地域、性别年龄、设备类型、学历水平、兴趣行为定向标签、再营销等属性进行定向。
详细了解人群定向
售卖策略
朋友圈广告支持曝光排期购买和曝光竞价购买两种购买方式，按千次曝光收费，按核心、重点、其他城市三大类地域阶梯定价。
详细了解售卖策略
广告素材审核规范
外层文案规范
外层图片规范
推广页规范
朋友圈广告重点规范

公众号广告
 
微信公众号广告是基于微信公众平台生态，以类似公众号文章内容的形式在包括文章底部、文章中部、公众号互选广告、视频贴片等四个广告资源位进行展示的内容广告。
通过整合亿级优质用户流量，利用专业数据处理算法，公众号广告为广告主提供了一个成本可控、效益可观、精准定向的互联网内容营销平台。
您只需要符合公众号广告准入行业要求，即可投放公众号广告。
适用的推广目标
推广品牌活动、推广商品、推广应用、收集销售线索、推广公众号、推广小游戏、推广视频号
支持投放的广告位
文章底部
文章中部
文章视频贴片
公众号互选广告
人群定向
公众号广告支持按照地域、性别年龄、设备类型、学历水平、兴趣标签（商业兴趣 / App兴趣）、再营销、媒体类型等属性进行定向。
详细了解人群定向
售卖策略
公众号底部广告支持按曝光排期购买、按曝光竞价购买和按点击竞价购买，公众号文章视频广告支持曝光竞价购买方式。公众号互选广告按文章收费，文章价格由流量主自主决定。公众号文中广告支持曝光排期 / 点击竞价购买。
详细了解售卖策略
广告素材审核规范
外层文案规范
外层图片规范
推广页规范
公众号广告重点规范


小程序广告
 
微信小程序广告是一个基于微信小程序与小游戏生态，利用专业数据处理算法实现成本可控、效益可观、精准触达的广告投放系统。
广告位在小程序页面内，由小程序流量主决定实际播放位置，流量场景丰富多样。
当前小程序广告已开放 36 个一级行业类目，您只需要符合微信广告准入行业要求，即可投放小程序广告。
适用的推广目标
推广品牌活动、推广商品、推广应用、收集销售线索、推广公众号、推广小游戏、推广视频号
支持投放的广告位
Banner广告
激励广告
插屏广告
格子广告
人群定向
小程序广告支持按照地域、性别年龄、设备类型、学历水平、兴趣标签（商业兴趣 / App 兴趣）、再营销等属性进行定向。
详细了解人群定向
售卖策略
小程序 Banner 广告支持按点击竞价购买和曝光排期购买，激励式广告支持按曝光竞价购买，插屏广告支持按曝光竞价购买和曝光排期购买。
详细了解售卖策略
广告素材审核规范
外层文案规范
外层图片规范
推广页规范

视频号广告
  
微信视频号广告是基于微信生态体系，以
视频号相关能力在微信视频号、微信朋友圈、公众平台流量场景内进行展示的内容广告
。
视频号广告涵盖内容广告与程序化广告。一方面，支持广告主与视频创作者通过互选合作，达成更优质的内容广告；另一方面，通过整合亿万优质用户流量，利用专业数据处理算法，结合视频号短视频动态、直播能力与行业组件能力，为广告主提供成本可控、效益可观、有效曝光的广告形式。
视频号广告当前已开放 36 个一级行业类目，你只需要符合视频号广告准入行业要求，即可投放视频号广告。
支持的推广目标
推广视频号、推广品牌活动（仅支持部分合约广告形态）
投放的广告形式
视频号互选广告
视频号直播推广
视频号动态推广
视频号原生广告
售卖策略
视频号原生广告支持曝光排期购买和曝光竞价购买两种购买方式，合约按千次曝光收费，按核心、重点、其他城市三大类地域阶梯定价。
视频号互选广告营销费用由创作者自主决定，创作者可参考视频时长、制作成本等因素综合定价。目前支持 1-60 秒、60 秒以上两档报价。
视频号直播/动态推广支持多种购买方式，可根据自身诉求选择合适的购买方式和广告投放工具。
通过“视频号推广”小程序，进行基础样式的快速推广，最低 100 元起。
通过
微信广告自助投放系统
，进行专业推广（如全幅卡片、直播间装饰、人群定向等），支持合约和竞价模式。合约模式适合有短时大曝光需求的广告主，快速提升视频号知名度和关注度。效果类广告主可使用竞价投放模式，高效获取目标流量。
素材审核规范
外层文案规范
外层视频规范
视频号广告体验要求
推广页规范

搜一搜广告

搜一搜广告是用户
在微信内搜索时，根据用户搜索词展示的搜索广告
。
通过覆盖微信生态内 10+ 搜索场景，搜一搜广告为广告主提供了承接微信用户商业化搜索意图的广告投放体系。
搜一搜广告当前已开放 36 个一级行业类目，你只需要符合搜一搜广告准入行业要求，即可投放搜一搜广告。
支持的推广目标
推广品牌活动、收集销售线索、推广商品、推广应用、推广公众号、推广小游戏
投放的广告形式
超级品牌专区
搜索结果广告
售卖策略
微信搜索超级品牌专区支持按时间计费购买，搜索结果广告支持点击竞价购买。
广告素材审核规范
外层文案规范
外层视频规范
推广页规范
搜一搜超级品牌专区审核规范
`,
  115: `产品介绍
以朋友圈原生样式投放一条广告，支持单图、多图或视频。
产品特点
采用与用户朋友圈信息流完全一致的经典样式
简洁明了，可供你便捷高效展示品牌形象
可包含门店标识，支持本地推广类目能力
适用场景
如同朋友圈好友动态的形态，制作简洁，文案、图片、视频、链接灵活自由配置，提供多样的展示形式，满足个性化的创意表达，支持全类目推广目标。

广告链路图示  
点击查看
外层素材规范
文案广告外层文案字数不超过 30 个字，不超过 4 行，支持添加 4 个微信表情。
图片单图规格
图片大小：不超过 300KB，不支持 GIF 格式，图片中文字篇幅不超过 30%
图片尺寸：800 × 800 像素（1:1）
图片格式：png, jpeg, jpg 
多图规格
图片数量： 3/4/6 张
单张图大小：不超过 300KB，不支持 GIF 格式，图片中文字篇幅不超过 30%
单张图尺寸：800 × 800 像素（1:1）
图片格式：png, jpeg, jpg 
视频时长：5-30 秒
格式：MP4
文件大小：≤ 100 MB
视频编码：H.264/AVC
格式类型：High Profile
分辨率
横版：1280×720px(16:9)、1280×960px(4:3)
竖版：720×1280px、750×1334px、750×1536px
采样纵横比：1:1
视频码率：≥ 800 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
文字链引导用户访问 “链接详情页” ，可选择以下文案：
了解更多、去逛逛、查看详情、立即体验、立即咨询、立即开通、立即抢购、立即申请、立即秒杀、立即购买、立即预定、立即预约、立即领取、观看直播、进入小程序、领取优惠
使用文字链时落地页需要有相应的动作，否则审核会驳回
可支持产品功能
门店标识门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店
支持所有推广目标（广告主须有线下门店）

@ 好友评论互动功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮
用户@好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流

其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
@明星品牌合作介绍页功能内测中，合作门槛为单次投放 100 万起，如有意向请联系咨询相应渠道经理/微信广告助手（ad_helper）。
展示广告转化数据
展示本账户下相同推广目标的广告，近30日内的总转化目标量；数据 ≥50 时展示
礼包码投放应用下载推广目标时，可配置礼包码。点击广告自动复制礼包码到剪切板，下载应用后可直达跳转使用。
推广目标及对应推广页
推广目标及对应支持投放的广告位
推广页介绍与设计规范
蹊径落地页介绍
竞价推广品牌活动：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、蹊径落地页
门店推广：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、蹊径落地页
销售线索：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、蹊径落地页
商品推广：
原生推广页、简版原生推广页、微信小程序、枫叶落地页
应用推广：
原生推广页、简版原生推广页、App Store、安卓厂商、蹊径落地页
公众号推广：
原生推广页、简版原生推广页、公众号详情页
小游戏推广：
原生推广页、微信小游戏
视频号推广：
视频号动态页
合约推广品牌活动：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序
门店推广：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序
销售线索：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序
商品推广：
原生推广页、简版原生推广页、微信小程序、枫叶落地页
应用推广：
原生推广页、简版原生推广页、App Store
公众号推广：
原生推广页、简版原生推广页、公众号详情页
小游戏推广：
原生推广页、微信小游戏
视频号推广：
视频号动态页


产品介绍
1 + 3主副素材组合投放，打造朋友圈「商品橱窗」。
产品特点
主副素材组合形式突破原生形态，更易吸引用户停留
首次支持视频/图片混合投放，满足用户边看边买等场景
适用场景
大促 / 节日营销：适用于广告主节点营销，主素材突出营销利益点，副素材展示营销商品
商品搭配展示：适用于服饰等品类，主素材突出模特穿搭效果，副素材展示系列商品
新品发布：适用于品牌新品推广，主素材以TVC展示新品功能，副素材展示不同颜色/口味等
朋友圈橱窗广告投放指引
外层素材规范
文案广告外层文案字数不超过 30 个字，不超过 4 行（不支持换行），支持添加 4 个微信表情。
图片主创意素材：1张，1280px x 720px，16:9，小于400Kb
副创意素材：3张，800px x 800px，1:1，小于400Kb
图片格式：png, jpeg, jpg 
视频主创意支持视频
时长：5-30 秒
格式：MP4
文件大小：≤ 100 MB
视频编码：H.264/AVC
格式类型：High Profile
分辨率：1280×720px(16:9)
视频码率：≥ 800 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
文字链引导用户访问 “链接详情页” ，可选择以下文案：
了解更多、去逛逛、查看详情、立即体验、立即咨询、立即开通、立即抢购、立即申请、立即秒杀、立即购买、立即预定、立即预约、立即领取、观看直播、进入小程序、领取优惠
使用文字链时落地页需要有相应的动作，否则审核会驳回。
可支持产品功能
门店标识门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店
支持所有推广目标（广告主须有线下门店）

@ 好友评论互动功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮
用户@好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流

其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
展示广告转化数据
展示本账户下相同推广目标的广告，近30日内的总转化目标量；数据 ≥50 时展示
礼包码投放应用下载推广目标时，可配置礼包码。点击广告自动复制礼包码到剪切板，下载应用后可直达跳转使用。
推广目标及对应推广页
竞价推广品牌活动：原生推广页、简版原生推广页、原生推广页小程序版、微信小程序
门店推广：原生推广页、简版原生推广页、原生推广页小程序版、微信小程序
销售线索：原生推广页、简版原生推广页、原生推广页小程序版、微信小程序
商品推广：原生推广页、简版原生推广页、微信小程序
应用推广：原生推广页、简版原生推广页
公众号推广：原生推广页、简版原生推广页
小游戏推广：原生推广页
落地页跳转能力注意事项：
1）主素材 & 副图区支持分开单独配置跳转目标，但跳转类型需保持一致；
2）在配置原生推广页时，必须使用“引用外层素材”组件；
3）点击主素材跳转原生推广页，原生推广页顶部组件还原主素材及三副图；点击副图跳转原生推广页，顶部组件轮播还原三副图。`,
  116: `产品介绍
多种组件自由组合，提升广告灵活度，精准吸引感兴趣的用户。
产品特点
行动按钮、标签、卖点图等多种基础组件能力，灵活组合
倒计时、直播内容轮播等行业组件，适配各种行业性推广
适用场景
更大的点击热区，点击卡片素材可直达广告推广落地页
更丰富的组件类型，适合行业化推广
外显更多广告核心信息，让用户在广告曝光时即可感受到卖点
外层素材规范
文案标题：可选，少于 10 个字，不支持换行
描述：必填，不支持换行。
当使用行动按钮和卖点图时，文案需少于10个字
不使用行动按钮或卖点图时，文案需少于30个字
图片单图规格
图片大小：不超过 300KB，不支持 GIF 格式，图片中文字篇幅不超过 30%
图片尺寸：800 × 450 像素
图片格式：PNG、JPG、JPEG
视频时长：6-30 秒
格式：MP4
文件大小：≤ 100 MB
视频编码：H.264/AVC
格式类型：High Profile
分辨率：1280×720px(16:9)
采样纵横比：16:9
视频码率：≥ 800 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
文字链引导用户访问 “链接详情页” ，可选择以下文案：
了解更多、去逛逛、查看详情、立即体验、立即咨询、立即开通、立即抢购、立即申请、立即秒杀、立即购买、立即预定、立即预约、立即领取、观看直播、进入小程序、领取优惠
使用文字链时落地页需要有相应的动作，否则审核会驳回
可支持组件类型
为保证用户体验，每条广告可使用最多3个组件，超出后则不能勾选更多。
标签组件
支持从标签库选择，或自定义输入。
最多使用 3 个标签，单标签 2-7 字，标签个数上限 3 个，总字数上限 16 字。
行动按钮组件
按钮文案支持选择，不支持自定义。
可选文案：了解更多、去逛逛、查看详情、立即体验、立即咨询、立即开通、立即抢购、立即申请、立即秒杀、立即购买、立即预定、立即预约、立即领取、观看直播、进入小程序、领取优惠
选择对应文案时，需要在落地页有相关动作或行为，否则会被审核驳回。
素材跳原生推广页时，行动按钮支持单独跳转小程序、H5。当素材跳转小程序、H5 时，行动按钮跳转和素材保持一致。
倒计时组件
广告在线期间只有符合倒计时配置时间周期内展示该组件，即“实际展示倒计时展示时间”等于“设置的倒计时组件时间”
时间描述支持距离活动开始、距离活动结束。
针对电商单品广告，可单独配置价格。
卖点图组件
支持上传一张 80×80 像素的图片，展示广告核心售卖的商品、优惠信息、促销信息等
卖点图组件必须包含行动按钮
视频号直播组件
推广视频号直播时，默认在外层展示直播间状态、直播间点赞氛围
可配置 1-5 条直播间重点内容，用轮播方式展示在素材图上。
可支持产品功能
门店标识
门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页。
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店。
支持所有推广目标（广告主须有线下门店）。
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮
用户@好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
@明星品牌合作介绍页功能内测中，合作门槛为单次投放 100 万起，如有意向请联系咨询相应渠道经理/微信广告助手（ad_helper）。
展示广告转化数据
展示本账户下相同推广目标的广告，近30日内的总转化目标量；数据 ≥50 时展示
礼包码投放应用下载推广目标时，可配置礼包码。点击广告自动复制礼包码到剪切板，下载应用后可直达跳转使用。
推广目标及对应支持的推广页
推广目标及对应支持投放的广告位
推广页介绍与设计规范
蹊径落地页介绍
合约推广品牌活动：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、蹊径落地页、公众号文章、自定义链接
门店推广：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、红包封面、自定义链接
销售线索：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、蹊径落地页、红包封面、公众号文章、自定义链接
商品推广：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、枫叶落地页、红包封面、公众号文章、自定义链接
应用推广：
原生推广页、简版原生推广页、App Store、安卓厂商页、蹊径落地页
公众号推广：
原生推广页、简版原生推广页、公众号详情页
小游戏推广：
原生推广页、简版原生推广页、微信小游戏、自定义链接
视频号推广：
视频号视频、视频号主页、视频号活动页
竞价推广品牌活动：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、公众号文章、蹊径落地页、自定义链接
门店推广：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、自定义链接
销售线索：
原生推广页、简版原生推广页、原生推广页小程序版、微信小程序、公众号文章、蹊径落地页、自定义链接
商品推广：
原生推广页、简版原生推广页、微信小程序、枫叶落地页、公众号文章、公众号文章、自定义链接
应用推广：
原生推广页、简版原生推广页、App Store、安卓厂商页、蹊径落地页
公众号推广：
原生推广页、简版原生推广页、公众号详情页
小游戏推广：
原生推广页、简版原生推广页、微信小游戏、自定义链接
视频号推广：
视频号视频、视频号主页、视频号活动页
`,
  179: `产品介绍
全新尺寸，极度吸引用户。
产品特点
采用更大的视觉尺寸，帮助讲述品牌故事
移动时代，更沉浸体验
适用场景
全幅式广告跳转至首页是全屏视频的原生推广页，给用户带来更好的沉浸式体验。
朋友圈全幅式广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 100 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）
外层素材规范
文案外层文案标题（可选）：少于 10 个字，不允许换行

外层文案详情（可选）：少于 14 个字，不允许换行
视频时长：5 - 30 秒
格式：mp4
文件大小：≤ 30 MB
视频编码：H.264/AVC
格式类型：High Profile
分辨率：1280 x 960 像素
采样纵横比：1:1
视频码率：≤ 2000 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
可支持产品功能
门店标识
门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页。
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店。
支持所有推广目标（广告主须有线下门店）。
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮。
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标及对应推广页
推广品牌活动原生推广页、原生推广页小程序版、微信小程序、自定义链接、视频号动态页
产品介绍
360° 沉浸体验，全方位展现推广产品。
产品特点
创新互动形式，用户转动手机，360° 了解产品
右上角全景标识，凸显广告特殊性
朋友圈全景式广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 100 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。

外层素材规范
文案外层文案标题（可选）：少于 10 个字，不允许换行
外层文案详情（可选）：少于 14 个字，不允许换行
图片图片尺寸：2048 × 1024 像素
图片要求：大小要求在 1.7MB 以内，若超出系统会自动压缩，其中文字占图片篇幅不超过 30%
图片格式：JPG、PNG，不支持 GIF 格式
可支持产品功能
门店标识
门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页。
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店。
支持所有推广目标（广告主须有线下门店）。
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标和对应推广页
推广品牌活动    原生推广页
产品介绍
简洁“滑动”小互动，结合品牌的创意，给用户营造全新奇趣的视频体验，参与成为品牌创意的一份子。
产品特点
可贴合品牌故事设置滑动路径
仅支持视频类型素材
朋友圈滑动式广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 100 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。

外层素材规范
视频时长：5 - 30 秒
格式：mp4
文件大小：≤ 30 MB
视频编码：H.264/AVC
格式类型：High Profile
分辨率：1280 x 960 像素
采样纵横比：1:1
视频码率：≤ 2000 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
可支持产品功能
门店标识
门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页。
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店。
支持所有推广目标（广告主须有线下门店）。
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮。
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标和对应推广页
推广品牌活动原生推广页、原生推广页小程序版、微信小程序、自定义链接

产品介绍
全新的“长按”互动和朋友圈的氛围动效，让用户亲手发现品牌彩蛋惊喜，感受品牌的爱意。
产品特点
可贴合品牌故事设置长按互动，触发视频隐藏情节
用户在长按时，可触发品牌氛围动效
仅支持视频类型素材
朋友圈长按式广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 100 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。


外层素材规范
视频时长：5 - 30 秒
格式：MP4
文件大小：≤ 100 MB
视频编码：H.264/AVC
格式类型：High Profile
分辨率：1280 x 960 像素
采样纵横比：1:1
视频码率：≥ 800 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
可支持产品功能
门店标识
门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页。
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店。
支持所有推广目标（广告主须有线下门店）。
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮。
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标及对应推广页
推广品牌活动原生推广页、原生推广页小程序版、微信小程序、自定义链接
产品介绍
以轮播橱窗的形式展示素材，清晰流畅。
产品特点
外层展示 3-6 张素材，可左右滑动，全方位展示商品
多落地页支持，点击后可跳转到对应页面
朋友圈轮播式广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 300 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。

外层素材规范
文案第一张轮播卡片
标题文案：不超过10字（选填）
描述文案：不超过10字（选填）
其他轮播卡片
标题文案：不超过10字（选填）
图片图片尺寸：960 × 720 像素
图片大小：≤ 500kb
视频时长：5 - 15 秒
格式：mp4
文件大小：≤ 5 MB
数量：3 - 6 个
视频编码：H.265/AVC
格式类型：High Profile
分辨率：1280 x 960 像素
采样纵横比：1:1
视频码率：≤ 2000 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
可支持产品功能
门店标识
门店标识位于广告外层的文字链下方，点击可跳转查看门店详情页
门店详情页主要用来详细介绍门店信息，并可以拉起地图导航、一键拨号等功能，进一步向感兴趣的用户介绍门店并引导到店
支持所有推广目标（广告主须有线下门店）
@ 好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标及对应推广页
推广品牌活动原生推广页、小程序落地页、自定义H5、视频号动态落地页

产品介绍
使用摇动手机的互动方式，结合抽卡玩法，丰富卡片带来多重惊喜，随机领取激发多次尝试。
产品特点
全新简洁的互动形式，破框全屏展示彩蛋氛围
物料元素外显视觉升级，轮播文案即时提示
帮助广告主分发多种物料，用户随机领取可重复扭动
双份社交彩蛋，多一份红包封面，引发分享
彩蛋可一键分享给好友来摇动，让用户“趣”赠送心意

朋友圈摇动式广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 500 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。

外层素材规范
视频时长：5 - 30 秒
格式：mp4
文件大小：≤ 30 MB
视频编码：H.264/AVC
格式类型：High Profile
分辨率：1280 x 960 像素
采样纵横比：1:1
视频码率：≤ 2000 kbit/s
帧率：推荐 24 fps
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率：推荐 44.1 kHz
Scan type：progressive
轮播文案与彩蛋页一一对应，需与彩蛋页内容有相关性
每条3-9个字
轮播组件不支持点击
摇动组件Icon：固定图案，不支持自定义
文案：固定展示为”摇出惊喜“
颜色：固定为春节限定红
可支持产品功能
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮。
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标及对应推广页
推广品牌活动支持跳转 原生推广页、微信小程序、自定义链接
产品介绍
突破边界限制，让你的IP形象“动”起来，实现实时双向交流
产品特点
展示突破边框：品牌表现力更强、更吸睛
IP互动反馈：破框呈现结束后，IP 形象可停留在卡片右下角。当用户进行互动后展示特定视频，根据IP状态，模拟与用户对话进行社交反馈
独立跳转：IP形象支持独立跳转区域

朋友圈 IP 互动式广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 500 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。


外层素材规范
IP文案少于 10 个字，不允许换行
数量：最多10条，每个 IP 状态对应1~2条文案，会随机出其中一条
IP图标IP图标
尺寸：200 x 200 像素
格式：带透明通道PNG
大小：≤50 KB
数量：最多5个，对应 IP 的不同状态
点赞文案仅支持在点赞文案库中进行选择，不支持自定义
点赞动效点赞后将飘起默认爱心动效，不可自定义，在广告素材生成后系统配合生成动效
视频外层视频
时长：5-30 秒
格式：MP4
文件大小：≤ 30 MB
分辨率：1280 x 960 像素
通道视频（RGB & ALPHA 通道视频）
时长：5-30 秒
格式：MP4
文件大小：≤ 20 MB
分辨率：1920 x 1440 像素
通用标准
视频编码：H.265/AVC
格式类型：high Profile
采样纵横比：1:1
视频码率：≤ 2000 kbit/s
帧率：≤ 30 fps( 24 fps)
音频格式：AAC
音频格式类型：LC
音频码率：≤ 96 kbit/sec
音频采样率： 44.1 kHz
关键帧最大间隔帧数：10
关键帧最小间隔帧数：5
Scan typeprogressive
音画时差：< 0.5 秒
Standard非PAL
声道单声道：立体声
可支持产品功能
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮。
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标及对应推广页
推广品牌活动支持跳转 原生推广页、微信小程序、自定义链接

产品介绍
点赞后触发品牌个性烟花，沉浸式体验专属祝福，氛围感拉满
产品特点
● 品牌首赞自动率先绽放烟花，带给用户专属祝福
● 用户每次点赞都有品牌个性惊喜
● 双向祝福点燃节日氛围

朋友圈点赞烟花广告内测中，推广目标暂只支持品牌活动推广，合作门槛为单次投放 300 万起，如有意向请联系相应渠道经理/微信广告助手（ad_helper）。
外层素材规范
文案外层文案标题（可选）：少于 10 个字，不允许换行
外层文案详情（可选）：少于 14 个字，不允许换行
视频● 时长：5 - 30 秒
● 格式：mp4
● 文件大小：≤ 30 MB
● 视频编码：H.264/AVC
● 格式类型：High Profile
● 分辨率：1280 x 960 像素
● 采样纵横比：1:1
● 视频码率：≤ 2000 kbit/s
● 帧率：推荐 24 fps
● 音频格式：AAC
● 音频格式类型：LC
● 音频码率：≤ 96 kbit/sec
● 音频采样率：推荐 44.1 kHz
● Scan type：progressive
可支持产品功能
@好友评论互动
功能入口
用户自然收到广告，点击“评论”，输入框左侧出现“@”按钮。
用户 @ 好友评论互动
点击“@”按钮，调起微信通讯录，选择想要 @ 的好友
输入评论内容，完成发送
被 @ 的用户会收到朋友圈消息提醒，点击后进入消息列表页，从消息列表页可点击进入广告详情页
在符合出广告条件的情况下，广告会插入到被 @ 用户的信息流
其他说明
用户在被 @ 场景下收到广告产生的曝光不扣费
单次评论只能 @ 一名好友，单条广告评论次数不限
可 @ 定向外好友
明星品牌合作介绍页
用户自然收到广告时，公众号的头像显示明星头像、昵称显示明星名称
点击头像昵称进入明星品牌合作介绍页，展示合作关系介绍、品牌名称、品牌头像、品牌介绍
推广目标及对应推广页
推广品牌活动支持跳转 原生推广页、微信小程序、自定义链接
`,
  271: `产品特点
流量规模大，年轻人群占比大，活跃度高
原生横版大图及视频呈现，充分展示广告信息，兼顾品牌和效果诉求
贯穿在订阅号消息内容列表中，契合深度阅读体验，高效转化
适用场景
订阅号消息列表广告位覆盖海量优质用户，以原生横版大图及视频形态贯穿在订阅号消息内容流中，支持竞价和合约投放模式，适配全量推广目标和完善的跳转能力，助力品牌和效果类广告主实现品牌曝光和高效转化。
适用样式及规范
视频式卡片视频式卡片
视频尺寸：960 × 540 像素
视频长度：6-30 秒
大图式卡片素材尺寸：960 × 540 像素
大小不超过 80K，支持 bmp, png, jpeg, jpg 格式
推广目标及对应推广页
竞价推广推广品牌活动：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广门店：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
收集销售线索：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广商品：原生推广页、简版原生页、自定义链接、微信小程序、枫叶落地页
推广应用：原生推广页、简版原生页、自定义链接、App Store
推广公众号：原生推广页、简版原生页、公众号详情页
推广小游戏：原生推广页、微信小游戏
视频号推广（动态推广）：视频号动态
合约推广推广品牌活动：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广门店：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
收集销售线索：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广商品：原生推广页、简版原生页、自定义链接、微信小程序、枫叶落地页
推广应用：原生推广页、简版原生页、自定义链接、App Store
推广公众号：原生推广页、简版原生页、公众号详情页
推广小游戏：原生推广页、微信小游戏`,
  134: `产品特点
支持不同售卖方式，兼顾品牌和效果客户需求
支持不同推广目标，满足不同营销诉求
支持多种创意样式和推广页，按需设置广告的展示和跳转效果
支持 16:9 大图式卡片或 16:9 视频式卡片，凸显品牌格调
适用场景
公众号底部广告提供了海量的曝光机会，丰富的广告形态，完善的跳转能力，支持全量推广目标，各类广告主都可以在这里找到适合自己的广告投放方案。
适用样式及规范
视频式卡片视频尺寸：960 × 540 像素

视频长度：6-30 秒

大图式卡片素材尺寸：960 × 540 像素

大小不超过 80K，支持 bmp, png, jpeg, jpg 格式

图片式 banner素材尺寸：960 × 334 像素

大小不超过 100K，支持 bmp, png, jpeg, jpg 格式

名片式 banner（仅支持推广公众号）
支持的推广目标
推广品牌活动、推广门店、收集销售线索、推广商品、推广应用、推广公众号、推广小游戏
适用推广页类型
推广品牌活动：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广门店：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
收集销售线索：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广商品：原生推广页、简版原生页、自定义链接、微信小程序、枫叶落地页
推广应用：原生推广页、简版原生页、自定义链接、App Store
推广公众号：原生推广页、简版原生页、公众号详情页
推广小游戏：原生推广页、微信小游戏`,
  135: `产品特点
广告出现在公众号文章正文中，采用 16:9 大图样式，充分展示广告信息
广告结合公众号文章展示，提高转化效率
支持多种创意样式和推广页，按需设置广告的展示和跳转效果
支持多种推广目标，满足多样营销诉求
适用场景
适用于多种推广目标，满足不同营销诉求，16:9 大图样式利于展现与传达广告信息，多种落地页能力为广告主提供了更强的转化能力。
适用样式及规范
图片式卡片素材尺寸：960 × 540 像素

大小不超过 80KB，支持 bmp, png, jpeg, jpg 格式

支持的推广目标
推广品牌活动、收集销售线索、推广商品、推广应用、推广公众号、推广小游戏 
适用推广页类型
推广品牌活动：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
收集销售线索：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广商品：原生推广页、简版原生页、自定义链接、微信小程序、枫叶落地页
推广应用：原生推广页、简版原生页、自定义链接、App Store
推广公众号：原生推广页、简版原生页、公众号详情页
推广小游戏：原生推广页、微信小游戏`,
  136: `
产品介绍
微信公众号互选广告，是广告主和流量主通过微信广告平台双向互选、自由达成合作的一种投放模式，广告创意呈现在公众号文章内。
产品特点
真实、全面的数据服务，安全、高效的交易流程
内容场景营销，外层支持图片、视频形态，更具表现力的广告样式
支持广告推荐、内容定制两种合作模式，助力品牌主与公众号粉丝群体深度沟通

合作模式
根据与流量主的合作深度，互选广告支持两种合作模式：广告推荐模式和内容定制模式。
广告推荐模式高效提升品牌声量
广告推荐是支持流量主在文章末尾植入广告宣传语及广告卡片。
广告宣传语作为本次推广想要传递的核心信息，将作为文章内容的一部分放置在广告卡片上方；文章主题及内容无强制要求与广告相关，文章内容经过预览后无需审稿确认即可发布。
广告推荐
按合作文章进行收费
，且流量主会设置承诺曝光，完成承诺曝光，即按照约定价格进行收费，多余的曝光为赠送曝光；
未完成承诺曝光，则按比例进行收费
。
内容定制模式深度塑造品牌形象
内容定制指的是流量主的文章主题、内容均为广告主定制化撰写，文章末尾亦有广告卡片。
内容定制双方可就内容合作的具体需求进行沟通和协商；文章内容经广告主审稿确认后方可发布。
内容定制
按文章进行收费，无承诺曝光
。
适用样式及规范
图片型素材尺寸：960 × 540像素

视频型（4:3）素材尺寸：960 × 720像素

视频型（16:9）素材尺寸：960 × 540像素

支持的推广目标
推广品牌活动、收集销售线索、推广公众号、推广小游戏
适用推广页类型
自定义链接、公众号文章、小程序落地页、原生推广页
`,
  137: `产品特点
出现在公众号文章视频播放过程中，场景更沉浸
素材类型丰富，支持 5 秒图片和 6-15 秒视频，根据公众号视频用户的习惯匹配合适的素材
支持多种推广目标，满足多样营销诉求
适用场景
公众号视频贴片广告内嵌在 Wi-Fi 及 4G 环境下公众号文章内的视频播放过程中，可以更好吸引用户的注意力，增加用户的广告停留时长，提供两种素材类型，展现形式多样。
适用样式及规范
图片型（5秒，不支持手动关闭）素材尺寸：690×388 像素

大小不超过 80KB，支持 bmp, png, jpeg, jpg 格式

视频型（6-15秒，观看6秒后可手动关闭）时长：6-15 秒

格式：MP4

视频编码：H.264/AVC

格式类型：Main Profile

分辨率：960×540 像素

采样纵横比：1:1

文件大小：≤ 1.7MB

视频码率：≤ 800 kbit/s

帧率推荐：24 fps

音频格式：AAC

音频码率：≤ 96 kbit/sec

音频采样率推荐：44.1 kHz

支持的推广目标
推广品牌活动、收集销售线索、推广商品、推广应用、推广公众号、推广小游戏
适用推广页类型
推广品牌活动：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
收集销售线索：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广商品：原生推广页、简版原生页、自定义链接、微信小程序、枫叶落地页
推广应用：原生推广页、简版原生页、自定义链接、App Store
推广公众号：原生推广页、简版原生页、公众号详情页
推广小游戏：原生推广页、微信小游戏`,
  138: `产品特点
支持多种广告样式与推广目标
与公众号底部广告一致的样式标准，便于在小程序流量场景中高效投放
流量主结合不同小程序特点，自定义广告展现场景，提升广告的场景融合度
适用场景
Banner 广告展现场景由小程序流量主自定义，根据各自小程序的特点，灵活设置展现页面与位置。
Banner 广告的常见展现场景为：文章页 - 文章末尾、详情页 - 页面底部、信息流 - 信息流顶部或信息流之间。
适用样式及规范
图片式 banner素材尺寸：960 × 334像素

大小不能超过 100KB，支持 bmp, png, jpeg, jpg 等格式

适用推广目标：推广品牌活动、推广商品、推广应用、收集销售线索、推广小游戏

图片名片式 banner素材尺寸：640 × 316像素

大小不超过 100KB，支持 bmp, png, jpeg, jpg 格式

适用推广目标：推广应用、推广公众号

支持的推广目标
推广品牌活动、推广商品、推广应用、收集销售线索、推广小游戏、推广公众号
适用推广页类型
推广品牌活动、推广商品、收集销售线索：自定义链接、微信小程序（非游戏类目）、原生推广页
推广应用：App Store、原生推广页、简版原生页
推广公众号：公众号详情页、原生推广页
推广小游戏：微信小游戏`,
  139: `产品特点
视频默认有声播放
支持 6-60 秒视频素材（横屏/竖屏）与浏览原生推广页两种形式
观看视频完成后（激励视频样式）或浏览页面 15 秒（激励浏览样式）且被用户主动关闭后，用户将获取该小程序提供的对应激励（如复活/加分等）
适用场景
激励广告展现场景由流量主自定义，根据各自小程序的特点，深度结合场景与情节，用户在查看广告后可获得相应激励奖励。
激励广告的常见展现场景为：积分/金币奖励、解锁新功能、通关/进阶、道具体验。
适用样式及规范
横屏视频(16:9)素材分辨率：960 × 540 像素

大小不能超过100MB，时长为 6-60秒，支持 MP4 格式

适用推广目标：推广品牌活动、推广我的应用、推广我的商品、推广我的公众号、收集销售线索、推广我的小游戏

竖屏视频(9:16)素材分辨率：750 × 1334 像素 与 720 × 1280 像素

大小不能超过 100MB，时长为 6-60 秒，支持 MP4 格式

适用推广目标：推广品牌活动、推广应用、推广商品、推广公众号、收集销售线索、推广小游戏

激励浏览直接浏览原生推广页，缩短外层素材跳转环节

适用推广页类型：原生推广页、视频号动态

备注：仅支持 oCPM 推广

适用推广目标：推广应用、推广商品、推广公众号、收集销售线索、推广小游戏、推广视频号（仅限于新版创建流程）

支持的推广目标
推广品牌活动、推广我的应用、推广我的商品、推广我的公众号、收集销售线索、推广我的小游戏、推广视频号
适用推广页类型
推广品牌活动、收集销售线索：自定义链接、微信小程序（非游戏类目）、原生推广页、蹊径落地页
推广商品：枫叶电商推广页、自定义链接、微信小程序（非游戏类目）、原生推广页
推广应用：App Store、原生推广页、蹊径落地页
推广公众号：公众号详情页、原生推广页
推广小游戏：微信小游戏
推广视频号：视频号动态（仅限激励浏览）
可支持产品功能
互动推广页
微信小程序激励广告增加互动推广能力。应用下载类广告主可制作互动 H5 落地页，与激励视频搭配投放，为用户营造沉浸式互动体验，提升转化效率。
互动推广页位置
用户在小程序中观看激励视频时，如用户未点击放弃试玩，则互动推广 H5 结束页后自动打开。
支持的推广目标
推广我的应用
适用行业
休闲、棋牌、剧情类游戏 App
小说、工具、咨询等垂直行业 App`,
  140: `产品特点
插屏广告，是指小程序在特定场景切换时以卡片方式弹出的广告形式
当用户触发流量主指定场景时，插屏广告就会自动向用户展现，同时支持用户随时关闭插屏广告
适用场景
插屏广告展现场景由小程序流量主自定义，无论是竖屏小程序还是横屏小程序，都可以基于用户实际的操作场景接入插屏广告组件。
插屏广告的常见展现场景为：切换 Tab 时、流程结束页面、视频播放停顿页面等。
适用样式及规范

图片型（16:9）素材尺寸：960 × 540 像素

大小不能超过 200KB，支持 bmp, png, jpeg, jpg 等格式

文案规格：可支持三行文案（第一、第二行必填），每行最多 16 个中文字符。或填写单行广告文案，最多30个中文字符

适用推广目标：推广品牌活动、推广应用、推广商品、推广公众号、收集销售线索、推广小游戏

视频型（16:9）素材尺寸：960 × 540 像素 或1280 × 720 像素

大小不能超过 100M，支持 MP4, MOV, AVI 等格式，视频时长6-30 秒

文案规格：可支持三行文案（第一、第二行必填），每行最多 16 个中文字符。或填写单行广告文案，最多30个中文字符

适用推广目标：推广品牌活动、推广应用、推广商品、推广公众号、收集销售线索、推广小游戏

支持的推广目标
推广品牌活动、推广应用、推广商品、推广公众号、收集销售线索、推广小游戏
适用推广页类型
推广品牌活动、收集销售线索：自定义链接、微信小程序（非游戏类目）、原生推广页
推广商品：枫叶电商推广页、自定义链接、微信小程序（非游戏类目）、原生推广页
推广应用：App Store、原生推广页、简版原生页
推广公众号：公众号详情页、原生推广页
推广小游戏：微信小游戏`,
  141: `产品特点
支持小游戏推广目标
基于开发者设定，格子广告一次曝光展示 1 个或多个不同的格子广告
自动拉取小游戏头像/昵称，作为广告外层图片与文案，同时支持自定义上传与修改文案
适用场景
格子广告展现场景由流量主自定义，根据各自小程序的特点，灵活设置展现页面与位置。格子广告的常见展现场景为：小游戏场景切换、通关场景、更多游戏推荐页。
适用样式及规范
方形头像素材尺寸：512 × 512 像素
大小不能超过 120KB，支持 bmp，png，jpeg，jpg 等格式
文案规格：可以完整展示至少 4 个文字，超出 4 个文字的部分可能会被省略号代替
支持的推广目标
推广我的小游戏
适用推广页类型
推广我的小游戏：微信小游戏`,
  252: `产品特点
全屏展示，用户充分沉浸关注推广内容，不被其他信息影响
视觉优雅，适配横版素材，基于素材进行背景填充与展示
展示场景
封面广告在用户进入小程序时进行展示，5 秒后自动关闭，期间用户可随时跳过
适用样式及规范
横版大图（16:9）微信广告投放平台（mp.weixin.qq.com）
素材尺寸：960 × 540 像素
大小不能超过 200KB，支持 bmp, png, jpeg, jpg 格式
腾讯广告投放平台（ad.qq.com）
素材尺寸：1280 × 720 像素
大小不能超过 140KB，支持 png, jpeg, jpg 格式
文案：最多展示20个字，超过部分将通过省略号代替
按钮：展示投放端选择的按钮文案
竖版大图（9:16）腾讯广告投放平台（ad.qq.com）
素材尺寸：1080 × 1920 像素
大小不能超过 140KB，支持 png, jpeg, jpg 格式
微信广告投放平台（mp.weixin.qq.com）不支持。
支持的推广目标
收集销售线索、推广商品、推广应用、推广公众号、推广小游戏
适用推广页类型
收集销售线索：原生推广页、自定义链接、微信小程序（非游戏类目）
推广商品：原生推广页、自定义链接、微信小程序（非游戏类目）、枫页落地页
推广应用：原生推广页、自定义链接、AppStore（iOS）、厂商应用市场（安卓）
推广公众号：原生推广页、公众号详情页
推广小游戏：微信小游戏
支持的投放方式
微信广告投放平台（mp.weixin.qq.com）：仅支持按形态投放，选择“优雅横版大图”形态即可投放。
腾讯广告投放平台（ad.qq.com）：支持多广告位通投，同步支持单个广告位定投，横版大图16:9和竖版大图9:16均可投放。`,
  253: `
产品介绍
沉浸式视频号原生视频广告体验，看见更多好内容。
产品特点
在视频号流内自然展现，深度融入优质内容环境
优质内容引发用户互动，社交扩散带动品牌破圈
半屏落地页不打断观看，边看边买加速转化
适用场景
视频号原生广告提供沉浸式原生视频体验，支持广告主以短视频形式全方位呈现产品及卖点，加速品牌破圈与流量转化，开拓视频号内的长效经营阵地。
合作流程
合约推广：视频号原生广告合约合作门槛为单次投放 5 万起。如有意向，可登录
腾讯广告投放平台
自助投放，或详询对应行业 / 渠道运营经理。 
点击查看投放指引
竞价推广：视频号原生广告支持各类常用推广目标&落地页，投放需符合行业准入规则，如有意向，可登录
腾讯广告投放平台
自助投放，或详询对应行业 / 渠道运营经理。 
点击查看投放指引
外层素材规范
视频分辨率：720px × 1280px，1280px × 720px，1280px × 960px
格式：MP4/MOV/AVI、不支持图片素材
时长
合约广告：5秒 - 60分钟
竞价广告：5秒 - 90秒
视频大小
合约广告：≤ 1GB
竞价广告：≤ 100MB
视频编码：H.264
视频封面图分辨率：720px × 1280px，1280px × 720px，1280px × 960px
格式：JPG/JPEG/PNG
图片大小：≤ 140KB
文案字数：1 - 30个中文，不可折行
其他能力：支持“#话题”，不支持“文字链”、“地理位置”及“添加活动”，支持4个emoji表情
广告组件自定义图片
尺寸：800 × 800像素
格式：支持 bmp, png, jpeg, jpg 格式
大小：≤ 300KB
组件文案
标题：≤ 10个汉字
描述：≤ 14个汉字
行动按钮
基础形态：2 字绿色按钮
展开形态：4 字绿色按钮
文案选项：不支持自定义，可选“了解 / 了解更多”或“购买 / 立即购买”等
推广目标及对应推广页
推广页介绍与设计规范
竞价推广品牌活动：
原生推广页、原生推广页小程序版、微信小程序、蹊径落地页、自定义链接
门店推广：
原生推广页、微信小程序、蹊径落地页、自定义链接
销售线索：
原生推广页、原生推广页小程序版、微信小程序、蹊径落地页、自定义链接、
商品推广：
原生推广页、原生推广页小程序版、微信小程序、枫页落地页、自定义链接
应用推广：
原生推广页、App Store、蹊径落地页
公众号推广：
原生推广页、公众号详情页
小游戏推广：
原生推广页、微信小游戏
合约推广品牌活动：
原生推广页、微信小程序、自定义链接
人群定向
视频号原生广告支持支持地域，年龄，性别等基础定向能力，同时支持“微信再营销”定向，支持自动扩量能力。
产品介绍
沉浸式原生视频体验，观看直播内容。
产品特点
在视频号流内自然展现，深度融入优质内容环境
点击直接进入直播间，快速实现用户触达
直播间匹配橱窗能力，促进转化
适用场景
视频号原生广告提供沉浸式原生直播拉流体验，支持用户快捷进入直播间进行直播观看，加速直播推广和流量转化。
合作流程
可登录
腾讯广告投放平台
自助投放，或详询对应行业 / 渠道运营经理。 
点击查看投放指引
外层素材规范
自动拉取直播间实时内容，无需额外上传素材
推广目标及对应推广页
视频号推广：直播间落地页`,
  259: `
产品介绍
沉浸式视频号原生视频广告体验，看见更多好内容。
产品特点
在视频号流内自然展现，深度融入优质内容环境
优质内容引发用户互动，社交扩散带动品牌破圈
半屏落地页不打断观看，边看边买加速转化
适用场景
视频号原生广告提供沉浸式原生视频体验，支持广告主以短视频形式全方位呈现产品及卖点，加速品牌破圈与流量转化，开拓视频号内的长效经营阵地。
合作流程
合约推广：视频号原生广告合约合作门槛为单次投放 5 万起。如有意向，可登录
腾讯广告投放平台
自助投放，或详询对应行业 / 渠道运营经理。 
点击查看投放指引
竞价推广：视频号原生广告支持各类常用推广目标&落地页，投放需符合行业准入规则，如有意向，可登录
腾讯广告投放平台
自助投放，或详询对应行业 / 渠道运营经理。 
点击查看投放指引
外层素材规范
视频分辨率：720px × 1280px，1280px × 720px，1280px × 960px
格式：MP4/MOV/AVI、不支持图片素材
时长
合约广告：5秒 - 60分钟
竞价广告：5秒 - 90秒
视频大小
合约广告：≤ 1GB
竞价广告：≤ 100MB
视频编码：H.264
视频封面图分辨率：720px × 1280px，1280px × 720px，1280px × 960px
格式：JPG/JPEG/PNG
图片大小：≤ 140KB
文案字数：1 - 30个中文，不可折行
其他能力：支持“#话题”，不支持“文字链”、“地理位置”及“添加活动”，支持4个emoji表情
广告组件自定义图片
尺寸：800 × 800像素
格式：支持 bmp, png, jpeg, jpg 格式
大小：≤ 300KB
组件文案
标题：≤ 10个汉字
描述：≤ 14个汉字
行动按钮
基础形态：2 字绿色按钮
展开形态：4 字绿色按钮
文案选项：不支持自定义，可选“了解 / 了解更多”或“购买 / 立即购买”等
推广目标及对应推广页
推广页介绍与设计规范
竞价推广品牌活动：
原生推广页、原生推广页小程序版、微信小程序、蹊径落地页、自定义链接
门店推广：
原生推广页、微信小程序、蹊径落地页、自定义链接
销售线索：
原生推广页、原生推广页小程序版、微信小程序、蹊径落地页、自定义链接、
商品推广：
原生推广页、原生推广页小程序版、微信小程序、枫页落地页、自定义链接
应用推广：
原生推广页、App Store、蹊径落地页
公众号推广：
原生推广页、公众号详情页
小游戏推广：
原生推广页、微信小游戏
合约推广品牌活动：
原生推广页、微信小程序、自定义链接
人群定向
视频号原生广告支持支持地域，年龄，性别等基础定向能力，同时支持“微信再营销”定向，支持自动扩量能力。
产品介绍
沉浸式原生视频体验，观看直播内容。
产品特点
在视频号流内自然展现，深度融入优质内容环境
点击直接进入直播间，快速实现用户触达
直播间匹配橱窗能力，促进转化
适用场景
视频号原生广告提供沉浸式原生直播拉流体验，支持用户快捷进入直播间进行直播观看，加速直播推广和流量转化。
合作流程
可登录
腾讯广告投放平台
自助投放，或详询对应行业 / 渠道运营经理。 
点击查看投放指引
外层素材规范
自动拉取直播间实时内容，无需额外上传素材
推广目标及对应推广页
视频号推广：直播间落地页`,
  185: `产品介绍
微信视频号互选广告，是广告主和视频号流量主通过微信广告平台双向互选、自由达成合作的一种投放模式，广告创意呈现在视频号内容中。

产品特点
内容场景营销，创作者内容创意支持，原生视频形态
真实、全面的数据服务，安全、可靠、可衡量
创作者经过全面评估，合作流程标准化线上化
合作流程
视频号内容营销费用由创作者自主决定，创作者可参考视频时长、制作成本等因素综合定价。目前支持 1-60 秒、60 秒以上两档报价。
视频号互选广告广告主及创作者可就内容合作的具体需求进行沟通和协商，视频内容经广告主审稿确认后方可发布。


`,
  186: `推广视频号直播
在微信广告已经支持的流量场景中，推广你的直播间，达到快速获客、提升场观的效果。或推广即将开始的直播预约，提前预热。
标的类型
视频号直播间、视频号直播预约
推广场景
朋友圈信息流
公众平台场景：公众号文章底部、公众号文章中部、支付订单详情页、小程序插屏
购买类型
竞价及合约
在朋友圈推广视频号直播
推广直播预约推广目标：视频号推广     
购买类型：竞价及合约
支持的广告形态：
购买类型
广告形态
竞价广告
组合式卡片广告
合约广告
组合式卡片广告
推广直播间推广目标：视频号推广
购买类型：竞价及合约
支持的广告形态：
购买类型
广告形态
竞价广告
组合式卡片广告
合约广告
组合式卡片广告、全幅式广告
推广直播间时，广告外层默认展示直播间状态及直播间点赞组件
在公众平台流量推广视频号直播
推广直播间推广目标：视频号推广
购买类型：竞价
支持的广告形态：
购买类型
广告样式
竞价广告
大图式卡片
大图式卡片规格：960 × 540 像素
直播间配置能力
投放朋友圈广告时，支持在直播间中对背景图和喝彩图标进行特殊配制，并且添加广告组件，引导用户在看直播时完成表单填写、添加企业微信等营销能力。
直播间配置能力当前正在内测中，有需要请联系微信广告助手。
背景图配置广告主使用推流或拉流直播时，支持上传直播间背景图
图片尺寸：750 × 1624 像素
图片格式：仅支持 png，jpg 格式；文件大小 ≤ 400K
喝彩图标配置当前喝彩图标默认为8个一组，支持广告主自定义1-4个，在一组内随机出现，可重复配置同样图标。
图片尺寸：200 × 200 像素
图片格式：仅支持 png 格式；文件大小 ≤ 30KB
跳转组件跳转页面类型：原生推广页

顶部组件的图片或轮播图素材作为外显图片
文案类型：
标题文案：0-15 个字
描述文案：展示在标题下方，支持 0-10 个字
按钮文案：仅支持选择，不支持自定义
可选项：了解更多、查看详情、立即购买、立即预约、立即咨询、立即申请、立即预定、领取优惠、立即领取、去逛逛`,
  187: `推广视频号动态
推广视频号动态到微信广告流量场景，在朋友圈以原生形式呈现，在公众号小程序与场景相结合，可上滑展示广告主更多视频。
广告场景
朋友圈信息流
公众平台流量：公众号文章底部广告、公众号文章中部广告、支付订单详情页广告、小程序插屏广告、小程序激励广告
购买类型
竞价及合约
在朋友圈推广视频号动态
可使用常规图片和组合式卡片广告两种形态推广视频号动态。推广视频号时，头像昵称跳转到视频号。
购买类型
广告样式
竞价
常规横版图片*、常规竖版图片*、组合式卡片广告
合约
常规横版图片*、常规竖版图片*、组合式卡片广告、全幅式卡片广告
*视频号常规样式和视频号分享到朋友圈的样式保持一致，支持横版图片和竖版图片两种规格，图片上会自动覆盖播放按钮，不支持视频跳转。图片规格：1280 × 720 像素、720 × 1280 像素
在公众平台流量推广视频号动态
可使用大图式卡片广告和激励浏览两种形态推广视频号动态。推广视频号时，头像昵称跳转到视频号。
购买类型
广告样式
竞价
大图式卡片、激励浏览（激励广告）
*大图式卡片规格：960 × 540 像素；激励浏览：直接浏览视频号动态，缩短外层素材跳转环节
视频号动态落地页链路
当视频号动态作为广告落地页时，默认带更大的转化按钮，可进行更多的跳转和关注能力
关注视频号落地页按钮为视频号关注按钮，从广告场景进入的视频流中都展示该关注按钮。
跳转到原生推广页落地页按钮可跳转到原生推广页，在原生推广页中完成更多的跳转和转化，如跳转小程序、填写表单、下载 App 等。
按钮文案仅支持选择，不支持自定义。
可选文案：查看详情、了解更多、立即购买、立即预约、立即咨询、立即申请、立即预定、领取优惠、立即领取、去逛逛、立即体验、立即抢购、立即开通、立即秒杀`,
  258: `产品介绍
微信生态全新流量场景，打造可长期沉淀的品牌门户。
产品特点
覆盖微信生态内 10+ 搜索场景，充分承接搜索流量
开阔的展示区域凸显官方品质，全方位塑造品牌形象
提供丰富的私域组件，便捷满足用户多元需求
适用场景
超级品牌专区深度连接品牌内容与用户需求，帮助品牌实现品牌塑造及私域转化等营销诉求。用户通过主动搜索品牌词来获取品牌信息、了解咨询品牌服务，同时进入品牌公众号、小程序等私域进行信息获取和消费转化。
外层素材规范
品牌背景必选配置项，可配置视频或图片素材
比例：16:9
推荐尺寸：1280 × 720 像素
视频
视频格式：MP4 / MOV / AVI
视频时长：15～60s
文件大小：≤ 100MB
采样纵横比：1：1
帧率：推荐 24 fps
图片
图片格式：JPG / JPEG / PNG
文件大小：≤ 140KB
基础信息品牌名称（必填）
字数要求：≤ 12字 
*不同机型可展示字数不同，若超出机型最大展示字数则将省略。
落地页：公众号主页 / 小程序主页 / 视频号主页
*若不配置则点击无效果。
门店地址（可选）
文案：「门店地址」文案固定，不可自定义
落地页：小程序 / 自定义链接
在线客服（可选）
文案：「在线客服」文案固定，不可自定义
落地页：品牌微信客服
联系电话（可选）
文案：「电话」文案固定，不可自定义
号码配置：可配置1～3个电话号码，座机请添加区号
官方账号可配置数量：可配置 1～50 个官方账号（公众号 / 视频号 / 小程序）
若不配置「进店组件」或「热门活动」，则最大账号数量为 3
若配置「进店组件」或「热门活动」，则最大账号数量为 2
展示规则：
若配置账号数量 ≤ 则最大账号数量，则外显全部账号
若配置账号数量 ≥ 则最大账号数量，则显示「更多官方账号」按钮，点击「更多官方账号」进入账号二级页，查看完整账号列表
可支持组件类型
进店组件（二选一）官方账号 & 行动按钮
进店组件需绑定官方小程序
*官方账号具体规格请参见前章
行动按钮配置项：「进店」、「了解」、「前往」
商品系列 Tab（可选）
数量：0 或 2～4个
名称：可自定义
总字数：≤ 12 字（可自由分配给不同 Tab）
商品图片
图片尺寸：800 × 800 像素
图片格式：支持 jpg / jpeg / png 格式
文件大小：每张图片 ≤ 300KB
商品名称 & 营销标签
商品名称字数：≤ 20 字（建议 8 字以内）
*不同机型可展示字数不同
营销标签字数：2～4 字
信息栏底色
默认从商品图片自动取色，同时支持自定义颜色，每张商品卡可单独配置底色
热门活动（二选一）可添加 1～6 张卡片，展示顺序自定义
卡片类型：支持「普通卡片」、「选择卡片」、「行动卡片」和「视频号直播卡片」
卡片搭配：支持不同类型组合使用
跳转路径：
「普通卡片」、「选择卡片」、「行动卡片」支持小程序、原生页或自定义链接，
「视频号直播卡片」支持跳转至视频号直播
推广目标和对应推广页
推广页介绍及设计规范
推广品牌活动品牌背景：视频号视频（仅当素材为视频时可配置）、微信小程序、原生推广页 、 自定义链接
基础信息：公众号主页 、小程序主页 、视频号主页
官方账号：公众号主页 、小程序主页 、视频号主页
进店组件：官方微信小程序
热门活动：
5.1 「普通卡片」、「选择卡片」、「行动卡片」支持跳转至微信小程序、原生推广页 、自定义链接
5.2 「视频号直播卡片」支持跳转至视频号直播`,
  270: `产品介绍
微信生态全新流量场景，助力更短链路获取高效曝光与转化。
产品特点
覆盖微信生态内 10+ 搜索场景，充分承接搜索流量。
支持品牌词、品类词、通用词等多种搜索词售卖，助力流量获取。
提供丰富的推广页类型，满足多元营销需求。
外层素材规范
文案标题文案：标题文案字数不超过 30 个字符， 不支持微信表情。
描述文案：建议描述文案字数不超过 30 个字符， 不支持微信表情。
品牌形象：支持 2-12 个字符，不支持微信表情。
图片图片大小：不超过 400KB，不支持 GIF 格式
图片尺寸：800 × 800 像素（1:1）
图片格式：png, jpeg, jpg, bmp
支持的推广目标及推广页
竞价推广销售线索：
原生推广页、原生推广页小程序版、微信小程序、蹊径落地页
商品推广：
原生推广页、原生推广页小程序版、微信小程序、蹊径落地页
品牌活动：
原生推广页、原生推广页小程序版、微信小程序
应用推广：
原生推广页、蹊径落地页
公众号推广：
原生推广页
小游戏推广：
原生推广页、蹊径落地页`,
  130: `
适用样式及规范
大图式卡片素材尺寸：960 × 540 像素

大小不超过 80KB，支持 bmp, png, jpeg, jpg 格式

视频式卡片视频尺寸：960 × 540 像素

视频大小：不超过 100MB

视频长度：6-30 秒

图片式 banner素材尺寸：960 × 334 像素

大小不超过 100KB，支持 bmp, png, jpeg, jpg 格式

图片式卡片（仅支持推广公众号）素材尺寸：960 × 334像素

大小不超过 100KB，支持 bmp, png, jpeg, jpg 格式

支持的推广目标
推广品牌活动、推广门店、收集销售线索、推广商品、推广应用、推广公众号、推广小游戏
适用推广页类型
推广品牌活动：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广门店：原生推广页、原生推广页小程序版、自定义链接、微信小程序
收集销售线索：原生推广页、简版原生页、原生推广页小程序版、自定义链接、微信小程序
推广商品：原生推广页、简版原生页、自定义链接、微信小程序、枫叶落地页
推广应用：原生推广页、简版原生页、自定义链接、App Store
推广公众号：原生推广页、简版原生页、公众号详情页
推广小游戏：原生推广页、微信小游戏`,
  131: `原生推广页
全屏原生体验，让用户沉浸在天马行空的创意之中
推广页特点
支持丰富功能组件，原生、全屏的沉浸式浏览体验
针对不同推广目标，支持不同模板与跳转行动按钮
特别注意，
原生推广页体验要求广告外层素材与内层顶部素材须一致
。如设置视频广告时仅可以选择顶部素材为视频的自定义原生推广页。
原生推广页使用手册
为更好地协助广告主简便、高效创建原生推广页，微信广告全面升级了原生推广页编辑器，优化了创建流程，并提供了行业优秀模板，全新编辑工作区与货架组件等新能力。
原生推广页使用手册
原生推广页—自定义模板样式规范
推广页整体规范最终输出的文件总大小 ≤24M，其中除长视频外的资源大小 ≤4M
模块间不可重叠
分享缩略图由系统自动截取（如果是原生图文广告，自动截取外层图正中最大尺寸的正方形图片；如果是原生视频广告，自动截取视频首帧画面正中最大尺寸的正方形图片）
顶部组件规范顶部图片规格要求

顶部轮播图规格要求

顶部视频规格要求
朋友圈信息流广告

公众号、小程序广告

图片组件规范图片规格要求

轮播图规格要求

全景图规格要求

视频组件规范视频规格要求

视频自动播放触发条件：画面露出50%时开始播放，移出50%则停止
声音播放逻辑：原生图文广告，视频自动播放默认无声；原生视频广告，视频自动播放默认有声。可手动通过声控按钮控制声音开关。
需要注意的是，如若视频时间太长，低端机型可能加载卡顿，导致音画不同步的问题。
文本组件规范文字颜色：自定义
字体：暂时无法支持居中，用户浏览时呈现手机的默认字体（如有特殊字体需求，请使用图片模块）
字体大小：14~36 像素
字体类型：可选择普通或加粗
顶部及底部边距：默认 22 像素，如需调整，可点击“更多高级设置”
按钮组件规范可选样式：实心或空心的直角按钮，颜色可自定义，按钮文案不超过10个字
按钮尺寸： 80 X 380 像素
排列方式：居中，一行只有一个按钮，且不能叠放在其他模块上
模块背景：无（按钮置于背景色上，可通过调节页面颜色设置按钮背景色）
按钮功能：可根据推广目标选择设置跳转普通外链、跳转公众号原生介绍页、跳转微信卡券领取页、跳转移动应用下载页，
但须与推广目标保持一致性
。如推广目标为公众号关注，则自定义原生推广页中必须有一个按钮跳转关注公众账号，同理，如推广目标为移动应用推广，则详情推广页中需有一个按钮跳转下载应用。
按钮文案：应用下载的文案必须为：应用下载、APP 下载、立即下载、下载四种之一
翻页效果组件规范翻页效果组件可以应用于不同的页面内容之间，做页面信息的区分。加了翻页效果的页面将会分为两段，用户需要滑动才能进行翻页。
其他建议规范长视频建议不连续使用
一屏内建议不同时出现两个视频
全景图片建议不连续使用
轮播图片建议不连续使用
为了阅读体验更优，图片内字体大小建议不小于 18 像素
为了广告效果更优，页面总长度建议控制在 10 屏以内
原生推广页—行业模板使用
预览模板
将鼠标移动至对应的模板封面上，点击“预览模板”，可以在线浏览模板内容，或者扫描右侧的二维码进入手机端浏览模板。
使用模板
将鼠标移动至对应的模板封面上，点击“使用模板”，即可进入编辑器使用该模板。
使用空白模板
点击“使用空白模板”，进入编辑器，自定义创建你的原生推广页。
简版原生页简介
简版原生页是使用原生推广页特性的推广页形式，可以在使用朋友圈常规样式时，选择该页面类型。
推广页特点
简版原生页无需单独制作，是一种根据外层素材自动拼接的推广页。
目前分为两种类型：默认模板和自定义页面。
默认模板是将外层素材、公众号头像和名称、文案、转化按钮拼接为简版原生页
自定义页面则是将外层素材与相对应的页面拼接为简版原生页
简版原生推广页介绍
简版原生页-自定义页面的投放流程
进入投放的创意环节，选择简版原生页

配置好文案、图片后，选择自定义页面
再选择自定义页面的类型，包括 H5、枫页、公众号详情页（与推广目标相关）
填写页面链接即可完成配置

当使用自定义页面时，由于系统不知道自定义页面中的实际点击和转化行为，因此使用 oCPM 的优化“跳转按钮点击”是无效的
当使用自定义页面，且选择公众号文章时，在简版原生页无法通过公众号文章跳转到小程序
简版原生页-自定义页面的H5设计建议
由于简版原生页自定义模板拼接的H5是从原生页内打开，并不具备 H5 常见的顶部导航栏（返回、分享、关闭），因此，如果投放自己的 H5，建议按照如下规范进行设计
若有返回操作，建议在 H5 底部增加操作栏
避免用户想返回上一页时，退出页面。例：电商场景，用户购买时，点击商品跳转后，想看别的商品，无法返回
底部操作栏除了返回，也可以增加其他按钮。例：刷新，回到主页等
底部操作栏，需要根据全面屏和非全面屏进行适配
避免底部操作栏因没有适配，给用户带来不便 例：非全面屏底部高度，应用于全面屏时，全面屏底部的小黑条遮住你的按钮； 全面屏底部高度，应用于非全面屏时，会造成非全面屏底部过高
底部操作栏高度建议 80~120 像素（基于 iPhone8 尺寸，750x1334 像素，仅供参考）
自定义链接
自定义链接页面，自定义你的广告创意
推广页特点
自定义你的推广页，更灵活展示所需信息

自定义链接详细介绍

适用广告位及推广目标
朋友圈信息流：推广品牌活动、推广门店、收集销售线索、推广商品、推广应用
公众平台流量：推广品牌活动、推广门店、收集销售线索、推广商品、推广应用
自定义链接样式规范
基础规范兼容目标
主流移动设备：iPhone 和安卓主流型号，特别是全面屏的手机；
操作系统：iOS 10.0+ 与 Android 10.0+；
链接需遵守《微信外部链接内容管理规范》，请参考
《微信外部链接内容管理规范》
。
链接的参数配置，
可见示例
 (包括了channel、aid、traceid和extend与comp_id等参数，你也可以按照自己需求添加对应参数）
加载速度、请求数与资源压缩
以 3G 网络环境 100kb/s 的网络速度计算，详情页首次加载过程中，可以在 
2s
 内看到 Loading 页面；
原则上页面中不超过 1 个的样式文件请求、2 个的脚本文件网络请求；
图片资源应当进行压缩，JPG 图片使用 80% 以下质量，PNG 图片使用 
TinyPNG 
进行压缩；
详情页平均单页资源不超过 300 KB，总资源包大小不超过页数乘以300KB（不包括视频资源）；
应当对小图片进行 
CSS 雪碧图
 合并，因低版本系统及低端设备渲染问题，单张图片尺寸不超过 2000x2000 像素，超过时需切分成多张雪碧图；
资源文件格式标准
文件类型
格式
大小
其它备注
背景音乐
mp3
小于 80 KB
开头和结尾音轨建议做使用淡入淡出处理
分享缩略图
jpg
小于 6 KB
尺寸为 120x120 像素
视频文件
mov/mp4/avi
暂无要求
分辨率>=960×540，视频码率>=1500kbps，画面比例 4:3或16:9
资源部署
详情页链接及所有资源必须采用 https 协议；
详情页应只包含静态文件资源，涉及数据交互使用 AJAX 进行数据提交；
不允许在页面中添加非腾讯域名的资源；
若页面中包括视频，提供视频文件，由运营经理上传至腾讯视频服务器后再提供视频地址；
开发及测试要求开发及测试要求
微信广告对朋友圈广告详情页的 
用户体验
 有着严格的要求，这么做的目的是为了让用户可以更好的了解和认识你的品牌和产品。 我们关注用户体验主要体现在如下几个部分：
分享 应满足如下要求：
场景
说明
分享行为
页面上无分享按钮，页面上无诱导分享行为，包含但不限于分享后才能看到特定的信息，分享后才能进行下一步流程，分享后可以获得奖励等
分享文案
分享时“文案”和“图片”可以正常显示，分享后链接可以访问
页面首屏的加载速度
场景
说明
白屏时间
正常3G网络（250kb/s ~ 750 kb/s）下，不超过2秒
首屏加载时间
首次加载耗时超过2秒时，需加个loading页面预加载页面资源
文件大小
每一页加载文件不超过 300KB，整体文件大小控制在 2MB
兼容性
在不同操作系统和屏幕大小的情况下详情页的体验正常，以下的每一项测试都应提供对应的
截图
场景
说明
关注机型
横屏
横屏时的体验：

若不支持横屏或横屏后的体验不佳，请使用横屏提示
不限
小屏幕
小屏幕时的体验：

文字和按钮出现在合理位置，不会出现错位、重叠或者显示不全的情况
iPhone 4

iPhone 4s
15:9屏幕
屏幕比例特殊时的体验：

页面各元素、文字和按钮应出现在合理位置，不会出现错位、重叠或者显示不全的情况
魅族 MX 4
虚拟键
使用了虚拟键或者 SmartBar 的 Android 机型的体验：

开启和关闭虚拟键或者 SmartBar，屏幕可视尺寸发生变化，页面各元素、文字和按钮应出现在合理位置，不会出现错位、重叠或者显示不全的情况
华为 Mate 8
文本框
输入文字时的体验：

输入时键盘不能遮挡输入框
Android机型
二维码
长按识别二维码时的体验：

可以正确识别二维码
不限
JavaScript
关注点
说明
压缩
所有的JavaScript文件都需要进行压缩
合并
尽可能合并JavaScript文件，请求不超过2条
图片
关注点
说明
压缩
所有的图片都需要进行压缩，png 格式图片推荐使用 TinyPNG 进行压缩
尺寸
单张图片尺寸不得超过 2000 x 2000 像素
合并
每一页加载文件不超过 300KB，整体文件大小控制在 2MB
无冗余
没有无用和重复的图片请求
音乐
关注点
说明
开关
每一页都有明确的音乐开关按钮
音量
音乐要求淡入淡出处理（开始时音量从小到大，结束时音量从大到小）
格式
音乐文件格式须使用 mp3 格式
大小
音乐文件大小须压缩至 80KB 以下
视频
视频播放时，须停止音乐；视频暂停或播放结束时，须播放音乐
视频
关注点
说明
部署
视频文件需要上传至腾讯视频
翻页
视频播放过程中，离开当前页面时，需要停止视频的播放
提示
视频文件很大时，对用户进行友好提示，建议在 WiFi 环境下观看
安全
关注点
说明
协议
所有资源的协议必须使用https，请不要使用http
自测与提测申请
请按照“测试要求”进行自测，并根据实际情况填写“自测报告”和“屏幕截图”，自测
全部通过
后才可以提交至微信广告；
至少提前 
5个工作日
 提交至微信广告；
微信广告会进行测试，发现问题后反馈给广告客户进行优化，直至详情页用户体验、性能、兼容性符合要求；
提测申请及部署申请邮件内容
内容
要求
基本信息
公众号名称、微信号、AppID、原始ID
体验地址
提供H5的体验地址
修改说明
非首次提交时，需要详细说明本次提测修复的缺陷以及修复方案
自测报告
根据“测试要求”进行自测，根据实际情况填写“自测列表”
屏幕截图
根据“测试要求”进行自测，根据要求指定机型的屏幕截图或照片，以 zip 格式压缩
源代码压缩包
以 zip 格式压缩（不得包含空文件，.svn/.git/.DS_Store/Thumbs.db/.log 等系统文件）。
广告详情页地址
若使用了微信授权登录，为方便测试，提供无需微信登录也可进行测试的地址
压力测试规范详情可见
《微信广告压力测试规范》
原生推广页小程序版
全屏原生体验，还有小程序的优良体验
推广页特点
在保留原生推广页的能力之外，额外支持小程序的能力。
支持一键获取销售线索
支持获取用户地理位置匹配最近门店

原生推广页小程序版详细介绍
适用广告位及推广目标
朋友圈信息流：推广品牌活动、推广门店、收集销售线索、推广商品
公众平台：推广品牌活动、推广门店、收集销售线索



微信小程序
小程序可以在微信内被便捷地获取和传播，同时具有出色的使用体验。
小程序特点
使用简单：不用下载，不用安装，微信内直接可以使用，不用占据手机内存，用完即走。
开发成本低：对比APP应用开发，微信小程序开发成本更低。
社交传播：小程序适合在微信群里快速传播，连接直达用户。这给社交电商，社交产品的快速发展提供了机会。
私域流量：微信小程序可以管理私域用户，共享微信生态、通过小程序进行用户裂变，潜力巨大。

如何制作微信小程序本文不做详细介绍，可详细参照：
微信公众号开发者平台
开发者指南
适用广告位及推广目标
朋友圈信息流：推广品牌活动、收集销售线索、推广门店、推广商品等
公众平台：推广品牌活动、收集销售线索、推广门店、推广商品等

微信广告还支持微信小程序、微信小游戏、公众号文章页、公众号小主页、视频号视频、视频号直播、视频号主页、App Store 应用详情页等推广页。
公众号小主页公众号小主页是常用推广页形式之一 ，可满足提供公众号知名度，培养潜在粉丝的公众号推广诉求。
适用广告位及推广目标
朋友圈信息流：推广公众号
公众号文章底部：推广公众号
公众号互选广告：推广公众号
公众号文章视频贴片：推广公众号
公众号文章公众号文章可快速实现，建议使用排版工具。公众号文章可直观呈现品牌主的推广价值主张，快速实现信息有效传递。
适用广告位及推广目标
朋友圈信息流：推广品牌活动、推广门店
公众号文章底部、互选：推广品牌活动
微信小游戏助力微信小游戏获得更强曝光与更多优质用户。微信小游戏须符合微信公众平台及微信广告相关审核规范。
适用广告位及推广目标
朋友圈信息流：推广小游戏
公众号文章底部、中部、互选、视频贴片：推广小游戏
小程序 Banner：推广小游戏
视频号视频支持直接跳转视频号特定视频，助力视频播放和关注转化，以优质内容吸引用户。
适用广告位及推广目标
朋友圈信息流：推广视频号
公众号文章底部、中部、订阅号列表：推广视频号
小程序插屏广告：推广视频号
视频号直播支持直接跳转视频号直播，助力直播。
适用广告位及推广目标
朋友圈信息流：推广视频号
公众号文章底部、中部、订阅号列表：推广视频号
小程序插屏广告：推广视频号
视频号主页支持直接跳转视频号主页，引导用户了解关注视频号。
适用广告位及推广目标
朋友圈信息流：推广视频号
公众号文章底部、中部、订阅号列表：推广视频号
小程序插屏广告：推广视频号
App Store 详情页App Store详情页为 iOS 移动应用推广下的推广页形式。用户点击广告外层文字链可直接跳转至 App Store 详情页（须获取用户授权），最短路径完成应用推广，提升下载效率。
适用广告位及推广目标
朋友圈信息流：推广移动应用
公众号文章底部：推广移动应用
公众号文章视频贴片：推广移动应用
安卓厂商页安卓厂商页为安卓移动应用推广下的推广页形式。用户点击广告外层文字链可直接跳转至安卓厂商应用页（须获取用户授权），最短路径完成应用推广，提升下载效率。
适用广告位及推广目标
朋友圈信息流：推广移动应用
公众号文章底部：推广移动应用
公众号文章视频贴片：推广移动应用
蹊径推广页腾讯广告官方
落地页建站工具
，能够满足各行业广告主对 
APP下载引流
及
客资收集、加粉等
的建站需求，提升广告转化率。
蹊径推广页介绍
枫叶落地页枫叶落地页服务直营电商广告主，支持为落地页添加商品、商品库、售后服务等能力，助力电商在微信生态内发展。
枫叶落地页介绍
`,
  133: `微信广告有哪些资源位，产品形态是怎样的？微信广告目前主要有朋友圈广告、公众号广告和小程序广告三大广告位，分别出现在朋友圈信息流、公众号文章及小程序页面三大流量场景。 详情可参考：
朋友圈广告产品形态详细介绍
公众号广告产品形态详细介绍
小程序广告产品形态详细介绍
朋友圈广告的收费策略是怎样的？朋友圈广告按曝光次数计费，区分核心、重点、其他城市三大类地域阶梯定价，支持曝光排期购买和曝光竞价购买两种购买方式。
售卖策略说明
公众号广告的收费策略是怎样的？公众号底部广告支持曝光排期购买和点击竞价购买；公众号互选广告按文章收费，文章价格由流量主自主决定。
售卖策略说明
小程序广告的收费策略是怎样的？小程序 Banner 广告支持点击竞价/排期曝光购买，小程序插屏广告支持曝光竞价/曝光排期购买，小程序激励广告按曝光竞价购买。
售卖策略说明`,
  45: `微信广告平台为公众号流量主提供
流量分享
和
内容定制
两种变现合作模式，公众号流量主可根据自身需求，自主选择以下方式进行变现：
程序化广告
：通过接入广告组件，快速将公众号内的指定流量分享给广告主作广告展示，获得广告收入。
返佣商品
：在编辑图文消息时挑选并插入合适的返佣商品，按实际成交订单金额的一定比例获得广告分成。
公众号互选广告
（定向邀请制）：通过公众号互选平台接受广告主合作邀约，并在公众号内定制和发布创意内容，按照与广告主约定的报价获取广告收入。
开通流程
只需满足以下条件，公众号创作者即可申请成为流量主：
公众号关注用户达到 500 人
符合平台运营规范
申请流程
：登陆 
微信公众平台
 → 流量主 → 申请开通 → 同意协议 → 选择要开通的广告位 → 提交

*温馨提示：开通流量主功能后请及时补充财务资料，以免影响结算
`,
  261: `公众号流量主可通过开通广告位，快速将公众号内的指定流量分享给广告主作广告展示，获得广告收入。
公众号流量主可开通程序化广告位包括：
底部广告
、
文中广告
、
视频后贴广告
。
流量主可轻松实现流量变现，持续获取收入，依托于高价值的内容，实现品牌塑造和内容变现的双赢。
底部广告
展示位置
图文消息内容区底部 ，即公众号文章内容区与评论区（若有）之间。
展现逻辑
系统会根据广告素材的定向和阅读文章的用户画像，匹配当前状态下最适合展示给用户的广告，流量主无须额外操作。
文中广告
展示位置
图文消息内容区中部，具体展现位置由流量主决定，也可托管给广告系统。
展现逻辑
系统会根据广告素材的定向和阅读文章的用户画像，匹配当前状态下最适合展示给用户的广告；流量主可设置文中广告的行业。
          
文中广告流量主合作指引
视频后贴广告
展示位置
当用户处于 Wi-Fi 及 4G 环境下时，公众号视频播放过程中或播放完成后展现。
展现逻辑
系统会根据广告素材的定向和阅读文章的用户画像，匹配当前状态下最适合展示给用户的广告；广告素材包括 5 秒图片、6-15 秒视频。
              
视频后贴广告流量主合作指引
财务结算
公众号程序化广告支持个人结算和企业结算两种结算方式，详见
财务结算页面
。`,
  262: `产品介绍
公众号创作者开通流量主功能后，可在编辑图文消息时，通过官方提供的商品选品页来挑选并在文章内嵌入合适的
返佣商品
。
用户在阅读该推文时点击商品卡片直达商品所在的小程序下单购买，带来实际成交后，流量主可获得因商品成交带来的销售分成。
展示位置
图文消息内容区，具体展现位置由流量主决定。

公众号返佣商品创作者操作指引
产品亮点
商品来源丰富
：目前已接入多家平台电商、生活服务类平台及品牌小程序，并持续接入新商家，为流量主提供丰富的带货商品及优质好货。
自主选择商品
：流量主在选品页自行选择推广的商品，选品页展示各商品推广佣金比例和预计收入，返佣商品收入直观透明。
商品带推文，创作成本低
：发文简便，部分商品提供推文，支持一键导入推文，降低创作成本。
收入透明有保障
：官方结算链路，流量主收入有保障，佣金结算效率高。
变现指南
公众号返佣商品广告支持自主选择，一次返佣商品广告合作必须经历以下步骤：
1. 账户开通登陆 
微信公众平台
，开通流量主功能，并在流量主模块下的“广告管理”中开通“返佣商品”广告位。
公众号关注用户达到 
500
 人且符合平台运营规范，运营者可提交申请，审核通过后即可开通流量主功能。


2. 选品页选品在编辑图文信息时，在文章编辑器栏的“返佣商品”入口点击进入选品页面，在选品页勾选合适的返佣商品，点击“确定” 即可插入到文章内。

3. 文章发布完成文章内容编辑和返佣商品插入后即可正常发送文章，文章上线后，该文章内容即包含返佣商品。当前群发和发布功能均支持返佣商品的推广。

4. 数据及收益查看文章上线之后，创作者可在“流量主-返佣商品-返佣商品数据”查看商品推广效果数据和收益详情。

财务结算
流量主每单税前实际收入=用户实付金额*佣金率*90% 。微信公众平台为流量主提供快捷的返佣推广功能，每单收取流量主结算佣金的10%作为服务费。
点击查看 
财务结算详细流程`,
  263: `产品介绍
公众号互选广告
是流量主和广告主通过公众号互选平台双向选择、自由达成广告合作的一种广告模式，广告创意呈现在公众号内容中。
流量主可根据账号自身粉丝数量等情况，自主定价；广告主通过系统发起合作需求后，流量主根据自身意愿，接受或拒绝合作。
达成合作的公众号互选广告将展示在流量主与广告主达成一致的、特定一篇公众号图文消息中。 
展示位置
图文消息内容区。

公众号互选广告创作者合作指引
产品亮点
自主定价
：流量主可依据账号自身情况，自主定价；多种合作模式，对应不同合作深度。
海量商机
：覆盖海量优质广告主，流量主可选择接受或拒绝合作。
专业服务
：广告合作及结算流程均通过微信公众平台后台进行，标准化、线上化，保证交易安全可靠。
合作模式
公众号互选广告支持以下4种合作模式，流量主可根据自身需求进行接单：
模式A. 原创定制合作方式
：流量主配合客户的推广需求，提供
全篇文章内容的定制撰写服务。
合作报价：
文章一口价。品牌可在文章内有多次露出，不承诺广告曝光量、文章阅读量。
模式B.  供稿直发合作方式
：流量主根据客户提供的内容材料，
简单编辑后进行文章推送。
合作报价
：文章一口价。品牌可在文章内有多次露出，不承诺广告曝光量、文章阅读量
模式C.  种草合集合作方式
：流量主的一篇文章中，将
展示多个客户的推广内容。
合作报价：
流量主按照坑位具体情况定价。不承诺广告曝光量、文章阅读量。
模式D.  广告推荐合作方式
：流量主在
文章末尾
植入客户的广告卡片。
合作报价
：按广告曝光计费，上线后 7 天内未达到承诺曝光量则按比例扣费。

一、财务资料
1. 收款规则
基本定义
收款账户：流量主填写广告收入的收款银行账户名称，可能是公司名称或者个人姓名。
开户主体：公众号注册时填写的主体名称，可能是公司名称或者个人姓名。
收款类型
个人主体：支持主体收款、委托第三方个人收款、委托第三方企业收款
企业主体：支持主体收款、委托第三方企业收款

温馨提示：
企业主体账号不支持委托个人收款。
若不同开户主体的帐号委托同一个收款账户，最多支持关联50个帐号开户主体。
账户变更
  
若流量主收款账户或邮箱发生变更，可在公众平台自助提交修改申请。收款账户变更，需要后台审核，通过即完成修改；邮箱及联系方式信息变更，无需审核。结算信息页面也会展示修改完成后的部分信息。
修改流程如下： 登陆微信公众平台，进入流量主模块，在“财务管理”-“互选收入管理”页面的“结算信息”板块，点击“修改”按钮进入结算信息变更页面。

变更规则
个人账户收款：支持只变更银行账号、变更其他个人账户收款、变更其他企业账户收款
企业账户收款：支持只变更银行账号、变更其他企业账户收款

温馨提示：
个人主体的帐号委托企业账户收款后，不支持改为原本的个人主体或其他个人账户收款。
使用同一结算主体的流量主帐号，修改其中一个帐号的结算信息后，名下所有帐号的结算信息会同步更新，系统会以最新修改完成的信息为准。
若委托第三方收款，第三方结算主体已提交过结算信息，新委托的帐号需提交与已提交过的结算信息一致的信息。
若是委托收款的，当银行账户信息发生变更时，需提交新的委托收款协议。
2. 结算信息要求
使用同一个结算主体的流量主帐号，须提交同一个的银行账户（如：账户名、开户行、开户支行、开户省市、银行账号）、营业执照及结算邮箱。
3. 审核
提交结算信息后，审核结果将在7个工作日内反馈。
注：工作日不包含周末及节假日，如遇周末或节假日暂不处理，顺延至下一个工作日。
二、收入结算
1. 结算规则
公众号互选广告将于广告投放后的第3天开始结算，结算单将于开始结算后的15天内发送到你的结算单邮箱中（如遇法定节假日，将会推迟）。
若你是企业用户，需要按结算单邮件的要求邮寄与结算金额等额的增值税专用发票给腾讯公司。腾讯公司将在收到正确的发票及结算单后30个工作日内将结算金额打入你的结算银行账户。
若你是个人用户，无需邮寄发票，腾讯公司将为你代扣代缴个税，并接受税务局委托，代征增值税和附加税费，在出具结算单后15个工作日内，将最终结算金额打入你的结算银行卡。
2. 结算流程
一次结算会依次经历四个结算状态：结算中、已结算、付款中、已付款。
结算中：腾讯公司会在此阶段核验结算信息，并在核验完成后准备结算单。
已结算：进入此阶段，表明结算单已出具并发送至流量主的结算单邮箱，若未收到，可申请补发。若为企业结算主体，请按结算单的实际收入金额开具发票，并邮寄发票和结算单至指定地址；腾讯公司将核验发票信息，确认无误后进入付款流程。
付款中：进入此阶段，表明发票已核验完成，款项支付中。
已付款：进入此阶段，表明款项已付出；各银行具体到账时间有差异，一般在1-3个工作日内到账。
三、企业开票
1. 开票规则
企业账号需要按结算单的实际收入金额开具增值税专用发票，与结算单一并邮寄至腾讯指定地址。公众号互选广告的发票不可以和其他类型广告合并开票。
2. 需邮寄的资料
增值税专用发票发票联及抵扣联，须加盖公司发票专用章。
与发票对应的结算单，须加盖公司公章、并填写盖章日期。
 3. 收件信息
收件单位：腾讯成都BPO中心

地址：四川省成都市高新区天府大道中段1366号天府软件园E5栋9楼

邮编：610041

收件人：施进燕

联系电话： (+86) 028-85225111

注：本电话只用于发票接收，其他流量主问题请咨询公众号“微信广告助手（ad_helper）”。
4. 开票信息
公司名称：腾讯科技（深圳）有限公司
发票类型：增值税专用发票
纳税人识别号：9144030071526726XG
开户行及账号：招商银行深圳汉京中心支行 817281823910001
开票地址电话：深圳市南山区高新区科技中一路腾讯大厦35层 0755-86013388
货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
 四、个人缴税
 1. 个税说明
个人账号无需邮寄发票，个人账户的收入属个人劳动报酬，根据《中华人民共和国税收征收管理法》及其实施细则等税收有关规定，腾讯公司从2019年11月1日起接受税务机关委托，为个人流量主代征增值税和附加税。
2. 增值税及附加税费计算方法
每次劳务收入超过500元（包含本数），腾讯代征3%的增值税，并按照增值税应纳税额代征附加税费，适用综合税率为6%（即，按照一般综合税率12%，实行减半征收）。如因税法或税局征管要求调整，需要更改上述规则的，腾讯公司会另行通知。
增值税应纳税额 = 劳务报酬（大于等于500元）/(1+3%) x 3%
附加税费应纳税额 = 增值税应纳税额 x 6%
3. 个人所得税计算方法
1）应纳税所得额的计算
劳务报酬所得以个人当月取得的同一项目下的多次收入合并为每次收入所得，定额或定率减除规定费用后的余额为应纳税所得额。
每次收入不超过4000元的，定额减除费用800元；每次收入在4000元以上的，定率减除20%的费用。
应纳税所得额 = 劳务报酬（少于4000元） - 800元
应纳税所得额 = 劳务报酬（超过4000元）×（1 - 20%）
2）应纳税额的计算
应纳税额 = 应纳所得税额 × 适用税率 - 速算扣除数
劳务报酬所得适用超额累进税率，累进税率分别为20%、30%和40%，即：纳税人每次劳务报酬所得的应纳税所得额不超过20000元的部分，适用20%的税率；超过20000元至50000元的部分，适用30%的税率；超过50000元的部分，适用40%的税率。
具体可以参考以下税率表：

案例一  A流量主当月收入为400元，则
该流量主收入少于500元，腾讯公司不代征增值税和附加税费。
且该收入扣减800后，个税的应纳税所得额为0，则腾讯公司不代扣代缴个税

案例二  A流量主当月收入为800元，则
增值税应纳税额 = 800 / (1+3%) x 3% = 23.3元
附加税费应纳税额 = 23.3 x 6% = 1.4元
流量主在扣除增值税、附加税费以及800后，个税的应纳税所得额为0，则腾讯公司不代扣代缴个税
因此腾讯公司代征增值税23.3元，代征附加税费1.4元，不代扣代缴个税

案例三  B流量主当月收入为3090元，则
增值税应纳税额 = 3090 / (1+3%) x 3% = 90元
附加税费应纳税额 = 90 x 6% = 5.4元
个税应纳税所得额=3090 - 90 - 5.4 -800 =2194.6元
个税应纳税额 = 2194.6×20%=438.92元
因此腾讯公司代征增值税90元，代征附加税费5.4元，代扣代缴个税438.92元

案例四  C流量主当月收入为10300元，则
增值税应纳税额 = 10300 / (1+3%) x 3% = 300元
附加税费应纳税额 = 300 x 6% = 18元
个税应纳税所得额=（10300-300-18）×（1-20%）= 7985.6元
个税应纳税额 = 7985.6×20%=1597.12元
因此腾讯公司代征增值税300元，代征附加税费18元，代扣代缴个税1597.12元

案例五、D流量主当月收入为82400元，则
增值税应纳税额 = 82400 / (1+3%) x 3% = 2400元
附加税费应纳税额 = 2400 x 6% = 144元
个税应纳税所得额=（82400-2400-144）×（1-20%）= 63884.8元
个税应纳税额 = 63884.8×40% - 7000 =18553.92元
因此腾讯公司代征增值税2400元，代征附加税费144元，代扣代缴个税18553.92元
4. 您的义务
您需自行履行年底个人所得税综合申报义务，以及自行承担个税税款的多退少补，您个税税款的调整或其他相关税费的缴纳（如有）与腾讯公司无关。
5. 关于代征税款的公告
根据《中华人民共和国税收征收管理法》及其实施细则等税收有关规定（以下简称“税收政策规定”），本公司受税务机关委托，对通过本公司获取劳务收入（包括劳务报酬、稿酬支出、特许权使用费等）发生应税项目的个人（以下简称“纳税人”），代征纳税人所获取劳务收入应缴纳的增值税、城市维护建设税、教育费附加及地方教育费附加，计税依据及税率按照相关税收政策规定执行。除此之外的税费代扣代缴以及结算事宜仍按照相关合同约定执行，纳税人需按照税收政策规定履行其纳税相关义务，以及自行承担补缴或退还的相关税款，税务机关对于纳税人税款的调整与腾讯公司无关。 该公告自2019年11月1日起执行。

我是创作者
1.公众号互选广告的合作流程公众号互选广告是流量主功能的一个广告位。参与公众号互选广告合作需先申请开通流量主，具体合作流程：
开通流量主-互选广告功能
进行公众号互选广告设置，设置报价、承诺曝光量和排期信息
广告主选择流量主进行广告合作 
流量主在24小时内确认广告合作 —— 5 编辑文章插入广告并发送预览 —— 6 合作当天发文达成合作 —— 7 数据跟踪&广告收入结算，流量主自助查看投放数据。
2.广告推荐和内容定制在合作上有什么差异？广告推荐模式的合作内容为50字以内的广告宣传语+广告卡片，微信广告鼓励流量主在文章内容和评论区进行配合但不强求；内容定制的合作内容为全篇文章，亦带有广告卡片。广告推荐需承诺曝光量，内容定制无承诺曝光量。<br />
广告推荐模式在发文前按内容规范自检后只需提前发送预览给到广告主，无需广告主确认可直接发文；内容定制模式在流量主发送预览后必须得到广告主的线上确认才可进行发文。对于内容定制合作需更多线下沟通，确认合作后一般提前7天给大纲，提前3天给初稿，提前1-2天给到最终预览。

广告推荐
内容定制
合作内容
广告宣传语+广告卡片
全篇内容定制+广告卡片
承诺曝光量
有
无
合作流程
无需广告主确认即可发文
需广告主确认才可发文
3.公众号互选广告和公众号广告、公众号底部广告的关系？公众号互选广告和公众号底部广告同属于微信公众号广告的两种不同的广告资源。对于流量主来讲，有三个广告位：公众号底部广告、公众号文中广告和公众号互选广告。公众号底部广告位于文章阅读数下方，根据不同的人群定向展现不同的广告；公众号互选广告位于公众号文章内容中，是广告主和流量主双向互选的广告。
收到互选广告的内测邀请之后，选择开启互选广告广告位即可。


4.如果公众号底部广告和公众号互选广告两个广告位同时开启，会怎么样？流量主同时开启公众号底部广告和公众号互选广告，对于有互选广告合作的文章，展示互选广告的广告宣传语及广告位，不出现底部广告位；对于无互选广告合作的文章，照常展现底部广告位。
5.公众号互选广告设置中的文章价格和广告收入的关系？公众号互选广告流量主设置的文章价格即为结算后到手价格（税前）。对于“广告推荐”合作模式，如果完成承诺曝光量，单次广告合作的税前广告收入即为设置的文章价格；如果未完成承诺曝光量，结算价格按照曝光量的完成比例计算；对于“内容定制”合作模式，流量主税前广告收入即为设置的文章价格。
6.公众号互选广告设置中的承诺曝光量是什么意思？承诺曝光量，可以不做理解对于“广告推荐”的合作模式，文章的实际结算价格需按照承诺曝光量进行计算；对于“内容定制”的合作模式，一般无。
1. 承诺曝光量，是流量主承诺为合作文章中的广告大图带来的曝光量；
2. 交易达成后将会根据承诺曝光量的达成情况进行结算。如果实际曝光量 >= 承诺曝光量，按照公众号互选广告设置中的文章价格分成计费；如果实际曝光量 < 承诺曝光量，按照实际完成比例结算 【实际曝光量/承诺曝光量 * 文章价格】。
特别注意：广告曝光量和文章阅读数没有必然联系。目前文章下方显示的阅读数指的是阅读人数的概念。
7.公众号互选广告设置中的流量主标签是什么？流量主标签分为内容标签和粉丝标签，根据公众号内容和公众号粉丝属性提炼。暂不支持修改，如有问题，可联系微信广告助手公众号反馈。
流量主标签目前仅用于广告主在投放广告时方便筛选，广告主无法单独查看某个流量主的标签信息。
8.公众号互选广告合作中哪些数据会展示给广告主？开通公众号互选广告功能，会将流量主的粉丝数区间（10w-50w、50w-100w、100w以上） 、文章价格、承诺曝光量和可接单广告的日期提供给广告主。流量主与广告主达成公众号互选广告合作，完成广告发文，会提供广告位的曝光、点击以及文章的阅读数等数据。
9.如何收到公众号互选广告的新广告单提醒？在流量主-账户设置-数据推送模块，可以绑定相关公众号运营者的微信号。绑定微信号后会收到每日广告数据推送，以及公众号互选广告的新广告单提醒。

10.公众号互选广告合作流量主发文规范？公众号互选广告合作属于商业合作，请针对商业合作场景进行适当调整；流量主在发文时如不符合互选广告发文规范，广告主有权取消合作。
1. 不得涉及黄赌毒、违法乱纪、政治敏感、以未经核实的信息或者片面传播信息散播谣言等内容；
2. 不得涉及天灾人祸、违法乱纪案件、生老病死、意外伤亡等可能令人情绪不安的内容报道，若无法配合选题请联系微信广告助手公众号协调；*举例：a) 如“聂树斌死后21年最高法再审改判，河北高院道歉”，诸如此类的案件新闻不适合承接公众号互选广告；b) 如“在家人的陪伴和注目下...... 他喝下了这杯安乐死的药剂”，涉及生老病死的内容不适合承接公众号互选广告。*
3. 不得涉及广告主指定的竞品相关信息露出，测评类内容如汽车测评、3C数据产品测评，需避开广告主指明的所有竞品；
4. 不得涉及其他任何商业广告行为，导购类流量主内容视具体情况请联系微信广告助手公众号评估；*举例：如文章本身在推介一个展览或进行其他的内容合作，不适合再承接公众号互选广告的内容合作。*
5. 不得涉及明显违背合作品牌核心价值或产品特性的内容，不得涉及以偏激报道煽动民族情感的内容；*举例：如“除了航天高特，这项中国制作也屡次征服世界”、“这件东西从180万跌倒20万！只因中国工匠打破了垄断！德国工匠彻底傻了...”，类似这样的内容尤其是第二项不适合承接奔驰之类的德系汽车品牌。*
6. 不得转载带有原创声明的文章；*举例：转载文章会在文末有转载声明的内容，影响公众号互选广告的广告体验。如果确认要转载文章，请提前取得转载授权。*
7. 不得在文章末尾编辑影响阅读体验的文案和图片，包括二维码，往期文章推荐、关注推荐等。如有必要的原创声明，请调整露出位置至文首；
8. 日常发文不得模仿公众号互选广告样式；
9. 公众号互选广告合作属于商业合作，接单后请预留排期，不得取消合作；
10. 公众号互选广告不支持定时发布，请手动发布。
11.如何将广告内容发送预览给广告主？编辑好文章内容插入广告并针对广告宣传语进行润色修改后，可以在互选广告-待投放广告模块，发送预览给到广告主侧。对于广告推荐模式，建议提前1-2天发送预览，一般情况下无需等待广告主回复确认直接发文即可。对于内容定制模式，需双方线下沟通并由广告主在系统确认文章OK后流量主才可发文。广告主会通过公众号互选广告设置预留的商务联系人进行联系沟通，对于流量主侧未按照广告要求进行发文或者不符合发文规范的，广告主侧有权取消合作。
12.公众号互选广告收入如何提现？我们将在每天（如遇法定节假日，将会推迟），对你前一天的收入进行结算，并发送结算单到你的结算单邮箱。
如你是企业用户，你需要邮寄与结算金额等额的增值税发票给腾讯公司，腾讯公司将在收到发票后30个工作日将结算金额打入你的银行卡；
如你是个人用户，无需邮寄发票，腾讯公司将在结算日后30个工作日内将结算金额打入你的银行卡，并代扣代缴个税。
如果未收到结算单，请发送邮件至：wxad@tencent.com，邮件标题：【未收到结算单】+公众号名称+公众号APPID。
详细信息请查看 
微信公众平台流量主收入提现流程
 
13.公众号互选广告的发票是否可以和其他类型广告合并开票公众号互选广告的发票不可以和其他类型广告合并开票，请单独开票。
我是广告主
1.公众号互选广告和公众号广告、公众号底部广告的关系？公众号互选广告和公众号底部广告是同属于微信公众号广告的两种不同的广告资源；
公众号互选广告，是广告主和流量主通过微信广告平台双向互选、自由达成广告合作的一种投放模式，广告创意呈现在公众号文章内，且将成为内容的一部分长期保留；而公众号底部广告则出现在流量主公众号文章后、“精选留言”前的“广告”区域，微信广告系统将根据广告主的人群标签选择，为用户推送合适的广告。
2.公众号互选广告是如何收费的？公众号互选广告按文章收费，文章的合作价格由流量主自主决定，对所有广告主一致；对于“广告推荐”合作模式，流量主会设置承诺曝光量，若最终合作文章广告曝光量未达到承诺值，将按实际曝光量/承诺曝光量的比例进行扣费。“内容定制”合作模式无承诺机制。
如：某“广告推荐”合作文章合作价格为1000，承诺曝光量为10000，实际曝光量为5000，则实际扣费金额=1000×(5000/10000)=500元。
3.如何投放公众号互选广告？首先，需要符合 
微信广告准入行业要求
 。公众号互选广告推广目标支持推广品牌活动、推广公众号、推广小游戏、收集销售线索。在投放公众号互选广告前，需要基于营销目标制定投放方案，选择合适的合作模式。目前，“广告推荐”和“内容定制”模式均支持自助投放。
4.公众号互选广告已接入哪些流量主，流量主准入的门槛是怎样的，如何查找这些流量主的相关信息？目前，公众号互选广告已接入近20个行业数百个优质流量主，且在持续开放中；我们会综合考虑公众号的粉丝量级、是否原创、阅读量、合作意向等因素，逐步邀请公众号参与公众号互选广告合作；
你可以通过登录微信公众平台的“广告主”模块，进入投放管理-公众号广告-公众号互选广告的创建流程，在“预定合作”步骤查看当前已接入的流量主列表及相关信息。
5.公众号互选广告可以看到哪些效果数据？单篇广告文章发布后，可在系统上查看广告曝光量、点击量、点击率、每千次展示均价、总花费等关键指标数据；
整个投放周期结束后，微信广告侧将于3-5个工作天后提供结案报告，不同的合作模式会有不一样的评估指标：
* 广告推荐模式下，除了系统上的基本数据外，还将包括整体文章阅读pv和uv、基于流量主类型、曝光人群、点击人群等纬度的洞察；
* 内容定制模式下，除了系统上的基本数据外，还将包括整体文章阅读pv和uv、文章分享、点赞及评论数量，基于流量主类型、曝光人群、点击人群等纬度的洞察。
6.公众号互选广告如何进行询量和锁量？广告主可随时在系统上查询可选流量主的报价和排期等信息，用于制定广告计划，但该查询结果仅供参考，并不等于和流量主达成了合作；实际报价、承诺曝光量和排期需要等完成账户充值后、在系统上提交广告计划时为准，流量主接单后双方才达成合作，此时流量主档期将被锁定。
7.为什么我邀请的流量主没有接单？没有接单怎么办？公众号互选平台为广告主和流量主提供双向互选、自由交易的合作机制；如果流量主当天接到多个订单，或认为广告主提交的素材、推广主题等不符合流量主文章调性，有可能不接单；在广告主发送合作邀请的24小时内，如果流量主拒单或没有接单，锁定的金额将即时退回广告主账户内，广告主可根据实际情况尝试调整排期或广告方案。
8.流量主接单后，是否还能修改广告创意或取消投放？流量主接单后，意味着双方已经达成合作，请遵守合作契约；
在文章发布日的前一天零点前，广告主可修改广告素材、落地页链接，支持取消投放，但不支持修改推广背景、广告宣传语和服务要求；
在文章发布日的前一天零点后，以上行为均不支持；
请注意，广告是文章内容的一部分，文章发布后不可修改或撤回；如因不可抗因素需要修改创意或取消投放，请联系渠道、销售或“微信广告助手”，微信广告侧会进行相应评估。
注：若文章上线日是1月1日，那么“文章发布日前一天的零点”为12月31日零点。
9.什么是承诺曝光量？和文章阅读量有什么不同？广告曝光量指文章末尾卡片的露出次数，不同于文章阅读量（每打开文章即算一次阅读），广告曝光量对于广告主而言是更有效的衡量指标；“承诺曝光量”为流量主根据历史文章阅读情况设定的承诺值，文章上线后7天内若实际广告曝光量未达到承诺曝光量，则按比例扣费，超出承诺部分的曝光均为赠送。
10.为什么我想要合作的流量主在系统上搜寻不到？系统上搜寻不到的原因包括 1）广告主搜索的关键词和系统词库不一致； 2）暂时还不在公众号互选平台的流量主库里；
对于第一种情况，建议试试不同的关键词，如想要搜索“军武次位面”，可尝试“军”、“军武”、“次”等关键词；
对于第二种情况，如果单笔投放预算在50万元或以上，可支持定向邀请流量主，详情请联系相应的渠道/销售。
11.流量主接单后，我还需要做些什么？流量主接单后，表示双方合作已经达成，在广告推荐模式下，广告主无需进行任何操作；
建议绑定自身微信号（工具箱->消息推送->添加推送），如果订单有变动、或流量主发送文章预览等，可即时在手机上查看。
12.如果流量主发送的文章预览不符合已提交的服务要求，该怎么办？流量主在文章发布前，会通过系统向广告主发送全文预览；如果流量主文章内容与广告主提交的“服务要求”不符，如出现了竞品、负面信息、敏感词等，可在投放端相应广告的“广告管理”界面查看相应流量主的商务联系方式，联系其进行沟通修改。
请注意，在广告推荐模式下，文章主题和内容无需与广告强相关，请在文章主题或内容上给予流量主发挥的空间，勿因此联系流量主修改。
13.内容定制模式为什么没有承诺曝光量？在内容定制模式下，文章主题和内容均为广告定制，品牌在文章中会有较多露出，故不适合仅仅通过文末广告图片的曝光来评估广告效果。
14.内容定制模式文章内是否有广告卡片？内容定制模式有文末广告卡片，可以自行根据推广目标选择是否启用。启用的卡片可以直接跳转到广告主设置的链接中，需要提交相应图片素材及落地页链接；选择不启用，则文章内不会出现广告卡片。
15.内容定制模式需要准备什么？内容定制模式需要提交推广背景、服务要求、撰文要点、素材、落地页链接等信息，才能在系统上提交广告计划，流量主接单后才意味着合作达成。
16.流量主接单后，我还需要做些什么？请在“投放管理”界面查看相应流量主的商务联系方式，联系其进行详细沟通，包括撰文要点、补充素材等；
因内容定制涉及到内容及细节上的修改和调整，建议广告主、代理、流量主三方通过微信群直接沟通，以提升沟通效率；
在文章细节全部确认无误后，流量主会通过系统向广告主发送全文预览，广告主在微信广告投放平台（mp.weixin.qq.com）上确认后，文章方可发布。`,
  46: `一、广告位管理
流量主可以在“广告管理”页的“广告位管理”板块开通和关闭广告位。
可供开通的广告位包括底部广告、文中广告、视频后贴广告、返佣商品广告、公众号互选广告。其中返佣商品广告还可通过文章编辑器快速开通，公众号互选广告只能通过邀请开通。
初次开通广告位时，会校验是否满足 500 个关注用户且符合平台运营规范。若不符合条件，即无法开通广告位。
若关闭广告位，24 小时内将不可再次开通。

二、广告屏蔽
流量主可以在"广告管理"页的"广告屏蔽”板块设置广告主黑名单，支持屏蔽公众号、应用、小程序及小游戏，对公众号全局广告进行屏蔽。
设置后，名单中广告主的广告将不会出现在流量主的公众号中。如果要取消屏蔽，做删除操作即可。

针对 iOS 应用，如何获取 Apple ID？
打开App Store

搜索并找到应用

选择应用，点击下载倒三角下拉菜单，复制链接

网址链接中，id 后面的一串数字就是应用的 Apple ID
针对Android应用，如何获取应用宝包名？
打开
应用宝官网

搜索并找到应用

查看应用主页的链接，apkName=后的字母组合就是应用宝包名

针对微信公众号，如何获取微信号？
若在屏蔽功能中按微信公众号名称搜索无结果，可直接搜索微信号查找。获取微信号指引如下：
打开微信公众号主页，点击公众号主页

在公众号简介-基础信息中找到微信号

针对小程序/小游戏，如何获取原始账号ID？
若在屏蔽功能中按小程序/小游戏名称搜索无结果，可直接搜索原始账号ID查找。获取原始账号ID指引如下：
进入小程序，点击右上角

点击半屏页顶部的小程序/小游戏简介

点击简介页面的更多资料

在更多资料中即可找到原始账号ID

三、公众号互选广告
流量主在“互选合作”页的“广告合作”板块可查看订单，收到订单后需在 24 小时内接单。
流量主在“互选合作”页的“待投放广告”板块可查看订单状态，文章内插入广告后可点击“管理广告”，发送预览给广告主。
流量主在“互选合作”页的“已投放广告”板块可查看广告投放数据和广告详情。
流量主在“互选合作”页的“互选广告设置”板块可进行价格、接单日历、商务联系方式等设置。
`,
  47: `一、数据查看
流量主在“概览”页可查看账户收入趋势、分广告位昨日关键数据指标及昨日产生收入TOP10文章。

流量主在“数据统计”页的“广告位数据”板块可分广告位查看所选时段的关键数据、关键指标趋势图及每日数据明细，并可下载表格进行更灵活的分析。

流量主在“数据统计”页的“文章收入”板块可查看文章发布后7日内的收入数据（不包含返佣商品数据和公众号互选广告数据）。

流量主在“财务管理”页的“收入数据”板块可查看分广告位分日收入明细数据。

二、返佣商品数据
返佣商品需要理解预估收入与实际收入这两个概念。
当商品被下单后，会产生预估收入，代表若交易成功，预计流量主可以获得的佣金收入。而实际收入会受到退货、退款、使用优惠券、商家活动折扣等因素的影响，不一定等于预估收入。
预估收入 = 订单金额 * 商品佣金比例 - 平台技术服务费；
实际收入 = 用户实付金额 * 商品佣金比例 - 平台技术服务费。
“概览”页及“数据统计”页的“返佣商品”板块展现的是返佣商品的预估收入；“概览”页的“账户收入”及“财务管理”页的“收入数据”板块中展现的返佣商品收入均为实际收入。

一般来说，在下单后的第二日，返佣商品的预估收入就会展现，而实际收入会在交易确认后，由电商平台将实际佣金金额传输给微信广告，并体现在佣金确认当日的账户收入中。`,
  48: `一、违规行为定义
流量主违规行为是指流量主使用微信广告平台展示服务时违反法律法规规定、
《微信公众平台服务协议》
 
《微信平台广告展示服务协议》
等广告展示服务相关的协议、规定、规范性文件等的相关行为。
二、违规处罚类型
对于广告展示违规行为，腾讯有权单方视情节轻重对流量主账户采取如下一项或多项措施：
警告：
腾讯向流量主发出系统警告通知，并要求流量主限时整改；
终止文章的广告展示服务：
永久关闭流量主相关违规文章的广告展示相关权限。终止后，相关文章不能再使用广告展示服务；
冻结账号操作权限：
暂时关闭流量主账号的广告展示相关权限，无法展示任何广告内容。期间允许流量主登录微信公众平台广告展示服务管理界面，但无法进行任何操作，不能使用广告展示服务，不产生广告展示收入。冻结解除后，流量主操作恢复广告展示，可以就恢复后的广告展示获得收入新增；
终止账号的广告展示服务：
永久关闭流量主账号的广告展示相关权限。终止后，流量主不能再使用广告展示服务；
扣除广告展示收入：
扣取流量主文章/账号的未结算展示收入作为违约金。为维护广告主权益，腾讯有权将扣除的展示收入用于处理纠纷及赔偿损失，若不足，腾讯有权进一步向流量主追偿；
同一收款主体（同一自然人或同一公司主体，下同）下的流量主账户违规记录达到一定数量的（具体以微信广告单方确定为准），微信广告有权视其违规情节严重程度及影响程度，自行决定暂停该收款主体的流量主申请资格（即暂停以该自然人或公司主体注册的全部公众号的流量主申请），以及冻结该收款主体下所有流量主账号的操作权限，并将该收款主体下所有流量主账号的全部未结算的广告展示收入作为违约金进行扣罚。
三、违规行为分类
1. 一级违规
1.1 违反国家法律法规
发布谣言或含有政治、色情、赌博、毒品、侵权、虚假信息等违法内容的图文消息及文章。包括但不限于流量主公众账号名称，或公众账号内发布的图文消息或文章（含标题）内存在危害国家安全、敏感政治、淫秽、色情（色情擦边、性暗示等）、毒品、赌博、虚假、谣言、侮辱、诽谤、恐吓或骚扰、低俗、侵犯他人知识产权或人身权或其他合法权益、可能对他人/企业或其他机构造成损害的内容等违法违规信息。
1.2 违反微信公众平台运营规范
流量主因违反微信公众平台运营规范，账号被永久封禁或注销。
1.3 刷开通
流量主的账号为利用第三方运营平台、外挂软件等方式，通过刷访问用户数量得以开通的情况的，包括僵尸用户刷量、漏洞刷量、外挂软件刷量等。
一级违规处罚手段
一经发现，终止流量主账号的广告展示服务，并扣除未结算的全部广告展示收入作为违约金。
2. 二级违规
2.1 恶意作弊行为
2.1.1 通过技术手段制造虚假流量，伪造曝光、点击、效果数据等；
2.1.2 自行或委托第三方反复手动产生曝光、点击、效果数据等；
2.1.3 通过外部渠道恶意引导用户点击广告，产生效果数据。
2.2 违规遮盖广告
通过编辑内容或者修改样式等方式遮挡广告位，诱骗用户进行操作。包括但不限于：通过上浮关闭按钮、图片或文字等进行虚假指引。
二级违规处罚手段
（1）首次发现，冻结流量主账号的操作权限30天，并扣除未结算的全部广告展示收入作为违约金；
（2）第二次发现，终止流量主账号的广告展示服务，并扣除未结算的全部广告展示收入作为违约金。
3. 三级违规
3.1 诱导点击
流量主在账号内可控的位置，通过明示或暗示的方式诱导用户反复访问、点击广告。
3.2 违规编辑
流量主通过非正常内容编辑方式，对文字进行隐藏、折叠等处理，以获得更高广告曝光次数。
3.3 空白文
文章正文内容信息极少，如空白文章、无实质内容等，以获得更高广告曝光次数。
3.4 伪原创
滥用/违规使用原创声明功能，以获得更高的广告展示收入。
3.5 违规导流
3.5.1 为违规文章导流，以获得更高的广告展示收入；
3.5.2 利用导流场景，在昵称、简介、视频/文章内容等地方以获取更多内容及其他奖励等作为噱头，诱导用户进入公众号，涨粉之后下发违规内容或进行违规交易或以其他形式获取不当利益；
3.5.3 图文以涉及封建迷信、违规擦边（如低俗擦边、标题党擦边）、使用了生僻字/绕过字体形式对抗等的标题吸引用户点击查看，文章的主要目的是诱导用户点击跳转到其他的图文页、第三方网页、小程序等。
三级违规处罚手段
（1）针对3.1-3.4：
①首次发现，终止文章的广告展示服务，并扣除违规文章全部未结算的广告展示收入作为违约金；
②第二次发现，终止文章广告展示服务并扣除违规文章全部未结算收入作为违约金，冻结账号操作权限1天；
③第四次发现，终止文章广告展示服务并扣除违规文章全部未结算收入作为违约金，冻结账号操作权限7天；
④第六次发现，终止文章广告展示服务并扣除违规文章全部未结算收入作为违约金，冻结账号操作权限15天；
⑤第八次发现，终止文章广告展示服务并扣除违规文章全部未结算收入作为违约金，冻结账号操作权限30天，并扣除账号的全部未结算收入作为违约金；
⑥第十次发现，终止文章广告展示服务并扣除违规文章全部未结算收入作为违约金，冻结账号操作权限90天，并扣除账号的全部未结算收入作为违约金；
⑦第十二次发现，终止文章广告展示服务并扣除违规文章全部未结算收入作为违约金，终止账号广告展示服务，并扣除账号的全部未结算收入作为违约金；
（2）针对3.5：
从首次发现起，依次冻结流量主的账号操作权限1天、7天、15天、30天、90天、终止账号广告展示服务。从冻结账号操作权限30天开始，每次处罚均扣除账号的全部未结算收入作为违约金。
4. 四级违规
4.1 违反微信公众平台运营规范
4.1.1 流量主文章因违反微信公众平台运营规范被进行删除等处罚；
4.1.2 流量主账号因违反微信公众平台运营规范被暂时封号/封禁广告相关能力。
四级违规处罚手段
（1）若流量主文章被进行删除等处罚，则扣除相应文章未结算的全部广告展示收入作为违约金；
（2）若流量主账号被微信公众平台暂时封号或封禁广告相关能力，则依据平台处罚天数，同等冻结流量主账号的广告操作权限，冻结期间不扣除广告展示收入。
5. 其他违规
5.1 不正当获取流量
流量主通过违法违规等不正常手段获取流量，包括但不限于发布违法违规等内容以获取流量、产生广告收益等情况。
其他违规处罚手段
一经发现，终止流量主账号的广告展示服务。
四、附则
本细则是微信公众平台广告展示服务规则，属于
《微信平台广告展示服务协议》
有效组成部分，腾讯有权根据自身运营管理需要更新本细则，上述更新一经正式发布，流量主即应遵守。
在本细则中未作明确的广告展示违规行为，腾讯有权根据
《微信公众平台服务协议》
《微信平台广告展示服务协议》
《微信公众平台运营规范》
等协议、规则进行处理。`,
  76: `视频号流量主可按照广告主要求进行创意内容制作，并在视频号内发布，根据收益规则获得变现收入。视频号流量主可根据自身需求，自主选择以下方式进行变现：
视频号小任务
：参与视频号变现任务，按照要求创作视频，并按视频效果结算收益。
视频号互选广告
：通过视频号互选平台接受广告主合作邀约，并在视频号内定制和发布创意内容，按照与广告主约定的报价获取广告收入。
开通流程
1. 视频号小任务
创作者符合以下条件，即有机会参与小任务：
创作者有效关注人数（粉丝数）在 100 及以上
持续发表优质原创内容
创作者可在微信内登录视频号，前往 “创作者中心-创作者服务-视频变现任务” ，查询是否满足参与权限。
2. 视频号互选广告
创作者符合以下条件，即可申请开通视频号互选广告：
视频号有效关注用户 1 万及以上
成功完成实名认证及视频号认证
持续发表原创优质内容
满足以上条件的创作者将会在移动端收到私信邀约。通过点击私信中的H5链接，创作者可快速了解视频号互选平台核心能力，一键同意邀请后即可成为视频号流量主。
另外，创作者也可在 PC 端登陆
视频号助手
，进入“创作者变现”页面，点击“立即开通”成为流量主。


`,
  267: `产品介绍
视频号小任务
是视频号生态内服务于创作者变现的现金任务撮合产品。
小任务以现金活动为载体，鼓励广大创作者按照要求创作视频，并按视频效果结算收益。满足条件的创作者可在 “创作者中心-视频变现任务” 中找到广告主发布的丰富任务，参与投稿并获得现金收益。
参与门槛
创作者符合以下条件，即有机会参与小任务：
创作者有效关注人数（粉丝数）在 100 及以上
持续发表优质原创内容
创作者可登录视频号，前往 “创作者中心-创作者服务-视频变现任务” ，查询是否满足参与权限。
产品亮点
新增变现途径：百粉创作者即有机会参与
有效关注人数（粉丝数）在 100 及以上、并持续发表优质原创内容的创作者，即有机会参与小任务活动。
任务接单灵活：多种广告任务激励创作
创作者可在小任务里持续发现丰富商机，自由挑选感兴趣的任务参与，探索不同领域里的变现玩法。
现金奖励丰富：按照视频质量与效果获得收益
创作者按照不同任务活动规则创作投稿视频，投稿视频表现越好，可能带来越高收益。参与更多活动，或者在活动内基于不同创作角度持续多篇投稿，都有机会带来更多收益回报。
接单指南
创作者只需 “筛选任务-发表视频-提现收益” 3 步，即可参与小任务，快速变现。
1. 筛选任务登录视频号 “创作者中心 - 视频变现任务” ，创作者即可选择感兴趣的变现任务参加。

2. 发表视频点击活动描述，可查看任务参与条件和要求。创作者需仔细查看任务描述和参与条件，如
话题要求
、
@ 要求
、
口播要求
、
内容要求
等。根据要求完成视频制作后，点击“参与”按钮，即可上传投稿视频。

3. 提取收益审核通过，即为投稿成功。次日，创作者即可在 “活动主页-活动描述 - 投稿视频” 或 “创作者中心-创作者服务-视频收入” 中 查看预估收益。活动结束后第 7 个工作日将展示可提现收益，收益可直接提现至微信零钱账户。

现在开始参与
在微信内登录视频号，进入 “创作者中心-视频变现任务” ，即可选择感兴趣的任务，参与小任务变现。更多问题可咨询“微信广告助手” 公众号。
收益提现规则
收益提现方式：可进入 “创作者中心-视频收入” 中查看收益，并按相应提现规则进行提现。  
收益提现时长：发起提现后，一般在 7-14 工作日到账至零钱。 
收益计税方式
收益计税规则：根据法律要求，视频号小任务产生的收益需缴纳个人所得税，平台将代扣代缴。
个人所得税计算规则：个人所得税，按照当月收入（如分次取得，则为当月累计数）减去委托代征的增值税和附加税的余额后，按照 “劳务报酬” 计算，与单次提现金额无关。
更多问题
Q:  收入提示提现成功，但是未到账零钱账户怎么办？A：（1）若提现进度显示处理中，请耐心等待；
（2）若提现进度显示已到账，则表明资金已到达零钱，可以前往“我”->“服务”->“钱包”->“零钱”->“零钱明细”中查询零钱明细。    
Q: 每日可以提现几次？A：每日可提现 1 次。
1. 为什么我参与不了小任务？小任务面向有效粉丝不少于 100 的原创优质作者开放，请持续发表原创优质内容，逐步达到小任务参与门槛。创作者可以在 “创作者中心-创作者服务-视频变现任务” 查询是否满足参与权限。
2. 为什么我的视频没通过审核？请仔细阅读活动参与条件，未通过审核的原因可以在“视频号私信”中查看。创作者可参考原因进行修改，并再次参与任务投稿。如有疑问也可通过“微信广告助手”咨询。
3. 我的最终收益与什么指标相关？奖励金额将根据视频质量、推广组件播放量、转化效果等综合决定，具体以小任务活动规则为准。
4. 什么内容更容易获得推荐？请注意按照以下平台鼓励的方向进行创作：
（1）内容贴切：在符合小任务要求的基础上尽情发挥创作才能，按照命题产出贴合广告主调性的内容。
（2）原创优质：在创意内容、剪辑技术等多方向探索，创作高清画质的优质内容，避免照搬照抄。
（3）积极正向：记录真实生活、展现创作者的所思所想，传递积极向上的能量。
5. MCN 机构参与小任务是否有政策活动？目前，针对符合门槛的 MCN 机构，会根据视频号小任务参与效果给予激励，具体政策可通过“微信广告助手”咨询。`,
  268: `产品介绍
视频号互选广告
是流量主和广告主通过视频号互选平台双向选择、自由达成广告合作的一种广告模式，广告创意呈现在视频号内容中。
视频号互选平台
在视频号互选平台上，广告主可根据品牌调性、目标人群等维度与匹配的流量主合作；流量主接受合作邀约后，将结合品牌需求及粉丝偏好为广告主定制创意内容，最终发布在视频号内。
展示位置
视频消息内容区

视频号互选广告合作指引
产品亮点
可观的合作收益
：内容合作广告形式，收入回报丰厚
丰富的客户资源
：全腾讯系客户资源，持续拓展商机
专业的服务平台
：官方平台安全高效，数据精准透明
合作流程
视频号互选广告支持自助接单，一次视频号互选合作须经历以下步骤：

1. 开通账号登陆 PC 端
视频号助手
，进入“创作者变现”页面，点击“立即开通”，成为视频号流量主。
申请通过后，请及时填写财务资料，并完成合作设置。

2. 接受任务新的广告订单会通过通知中心发送提醒给流量主，流量主也可在“任务管理-待接受”模块查看新的广告订单。
流量主确认广告合作之后，可在“任务管理-任务列表”中查看待投放的广告信息。接单前请认真查看推广要求。
接单之前，流量主可以向下修改本次订单合作价格，不限次数。
接单之后，本单报价不可修改。
3. 制作上传在“任务管理-任务列表-制作中-上传视频”，选择正确的视频素材插入至合作任务中。
在“动态描述”内填写最终版文案，发布视频的文案将以此处填写文案的为准；上传视频后，如果需要修改文案，需要广告主在待确认视频状态时驳回视频并修改。

4. 正式发表在“任务管理-任务列表-待发表”中选择待发表的视频，点击“正式发表”按钮。

5. 收入结算合作视频正式发表后，可在“任务管理-已发表”处查看效果数据和广告详情。

一、财务资料
 1. 收款规则
基本定义
收款账户：流量主填写广告收入的收款银行账户名称，可能是公司名称或者个人姓名。
开户主体：视频号注册时填写的主体名称，可能是公司名称或者个人姓名。
收款类型
个人主体：支持主体收款、委托第三方个人收款、委托第三方企业收款
企业主体：支持主体收款、委托第三方企业收款、委托个人收款（仅支持个体工商户和已注销企业-个体工商户可由经营者代收；已注销企业可由指定权利义务继受人代收）

温馨提示：
媒体、政府、企业、其他等非个人类型帐号不支持委托个人收款。
个体工商户和已注销的企业可委托个人账户收款，个体工商户可由经营者代收，已注销企业可由指定权利义务继受人代收。
若不同开户主体的帐号委托同一个收款账户，最多支持关联50个帐号开户主体。
账户变更
若流量主收款账户或邮箱发生变更，可在
视频号助手平台
自助提交修改申请。收款账户变更，需要后台审核，通过即完成修改；邮箱及联系方式信息变更，无需审核。结算信息页面也会展示修改完成后的部分信息。
修改流程如下： 进入创作者变现页面-财务管理-财务资料，点击右侧“修改”按钮进入结算信息变更页面，根据页面提示提交资料，提交完成后将进入审核状态，会在7个工作日内审核完毕。

变更规则
个人账户收款：支持只变更银行账号、变更其他个人账户收款、变更其他企业账户收款
企业账户收款：支持只变更银行账号、变更其他企业账户收款、变更个人账户收款（仅支持个体工商户和已注销企业-个体工商户可由经营者代收；已注销企业可由指定权利义务继受人代收）

温馨提示：
使用同一结算主体的流量主帐号，修改其中一个帐号的结算信息后，名下所有帐号的结算信息会同步更新，系统会以最新修改完成的信息为准。
若委托第三方收款，第三方结算主体已提交过结算信息，新委托的帐号需提交与已提交过的结算信息一致的信息。
若是委托收款的，当银行账户信息发生变更时，需提交新的委托收款协议。
 2. 结算信息要求
使用同一个结算主体的流量主帐号，须提交同一个的银行账户（如：账户名、开户行、开户支行、开户省市、银行账号）、营业执照及结算邮箱。
 3. 审核
提交结算信息后，审核结果将在7个工作日内反馈。
注：工作日不包含周末及节假日，如遇周末或节假日暂不处理，顺延至下一个工作日。

 二、收入结算
1. 结算规则
视频号互选广告将于广告投放后的第3天开始结算，结算单将于开始结算后的15天内发送到你的结算单邮箱中（如遇法定节假日，将会推迟）。
若你是企业用户，需要按结算单邮件的要求邮寄与结算金额等额的增值税专用发票给腾讯公司。腾讯公司将在收到正确的发票及结算单后30个工作日内将结算金额打入您的结算银行账户。
若你是个人用户，无需邮寄发票，腾讯公司将为您代扣代缴个税，并接受税务局委托，代征增值税和附加税费，在出具结算单后15个工作日内将最终结算金额打入您的银行卡。
2. 结算流程
一次结算会依次经历四个结算状态：结算中、已结算、付款中、已付款。
结算中：腾讯公司会在此阶段核验结算信息，并在核验完成后准备结算单。
已结算：进入此阶段，表明结算单已出具并发送至流量主的结算单邮箱，若未收到，可申请补发。若为企业结算主体，请按结算单的实际收入金额开具发票，并邮寄发票和结算单至指定地址；腾讯公司将核验发票信息，确认无误后进入付款流程。
付款中：进入此阶段，表明发票已核验完成，款项支付中。
已付款：进入此阶段，表明款项已付出；各银行具体到账时间有差异，一般在1-3个工作日内到账。
三、企业开票
1. 开票规则
企业账号需要按结算单的实际收入金额开具增值税专用发票，与结算单一并邮寄至腾讯指定地址。
 2. 需邮寄的资料
增值税专用发票发票联及抵扣联，须加盖公司发票专用章。
与发票对应日期的结算单，须加盖公司公章、并填写盖章日期。
3. 收件信息
收件单位：腾讯成都BPO中心

地址：四川省成都市高新区天府大道中段1366号天府软件园E5栋9楼

邮编：610041

收件人：施进燕

联系电话： (+86) 028-85225111

注：本电话只用于发票接收，其他流量主问题请咨询公众号“微信广告助手（ad_helper）”。
4. 开票信息
公司名称：腾讯科技（深圳）有限公司
发票类型：增值税专用发票
纳税人识别号：9144030071526726XG
开户行及账号：招商银行深圳汉京中心支行 817281823910001
开票地址电话：深圳市南山区高新区科技中一路腾讯大厦35层 0755-86013388
货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
四、个人缴税
1. 个税说明
个人账号无需邮寄发票，个人账户的收入属个人劳动报酬，根据《中华人民共和国税收征收管理法》及其实施细则等税收有关规定，腾讯公司从2019年11月1日起接受税务机关委托，为个人流量主代征增值税和附加税。
2. 增值税及附加税费计算方法
每次劳务收入超过500元（包含本数），腾讯代征3%的增值税，并按照增值税应纳税额代征附加税费，适用综合税率为6%（即，按照一般综合税率12%，实行减半征收）。如因税法或税局征管要求调整，需要更改上述规则的，腾讯公司会另行通知。
增值税应纳税额 = 劳务报酬（大于等于500元）/(1+3%) x 3%
附加税费应纳税额 = 增值税应纳税额 x 6%
3. 个人所得税计算方法
1）应纳税所得额的计算
劳务报酬所得以个人当月取得的同一项目下的多次收入合并为每次收入所得，定额或定率减除规定费用后的余额为应纳税所得额。
每次收入不超过4000元的，定额减除费用800元；每次收入在4000元以上的，定率减除20%的费用。
应纳税所得额 = 劳务报酬（少于4000元） - 800元
应纳税所得额 = 劳务报酬（超过4000元）×（1 - 20%）
2）应纳税额的计算
应纳税额 = 应纳所得税额 × 适用税率 - 速算扣除数
劳务报酬所得适用超额累进税率，累进税率分别为20%、30%和40%，即：纳税人每次劳务报酬所得的应纳税所得额不超过20000元的部分，适用20%的税率；超过20000元至50000元的部分，适用30%的税率；超过50000元的部分，适用40%的税率。
具体可以参考以下税率表：

案例一   A流量主当月收入为400元，则
该流量主收入少于500元，腾讯公司不代征增值税和附加税费。
且该收入扣减800后，个税的应纳税所得额为0，则腾讯公司不代扣代缴个税

案例二  A流量主当月收入为800元，则
增值税应纳税额 = 800 / (1+3%) x 3% = 23.3元
附加税费应纳税额 = 23.3 x 6% = 1.4元
流量主在扣除增值税、附加税费以及800后，个税的应纳税所得额为0，则腾讯公司不代扣代缴个税
因此腾讯公司代征增值税23.3元，代征附加税费1.4元，不代扣代缴个税

案例三  B流量主当月收入为3090元，则
增值税应纳税额 = 3090 / (1+3%) x 3% = 90元
附加税费应纳税额 = 90 x 6% = 5.4元
个税应纳税所得额=3090 - 90 - 5.4 -800 =2194.6元
个税应纳税额 = 2194.6×20%=438.92元
因此腾讯公司代征增值税90元，代征附加税费5.4元，代扣代缴个税438.92元

案例四  C流量主当月收入为10300元，则
增值税应纳税额 = 10300 / (1+3%) x 3% = 300元
附加税费应纳税额 = 300 x 6% = 18元
个税应纳税所得额=（10300-300-18）×（1-20%）= 7985.6元
个税应纳税额 = 7985.6×20%=1597.12元
因此腾讯公司代征增值税300元，代征附加税费18元，代扣代缴个税1597.12元

案例五  D流量主当月收入为82400元，则
增值税应纳税额 = 82400 / (1+3%) x 3% = 2400元
附加税费应纳税额 = 2400 x 6% = 144元
个税应纳税所得额=（82400-2400-144）×（1-20%）= 63884.8元
个税应纳税额 = 63884.8×40% - 7000 =18553.92元
因此腾讯公司代征增值税2400元，代征附加税费144元，代扣代缴个税18553.92元

4. 您的义务
您需自行履行年底个人所得税综合申报义务，以及自行承担个税税款的多退少补，您个税税款的调整或其他相关税费的缴纳（如有）与腾讯公司无关。
5. 关于代征税款的公告
根据《中华人民共和国税收征收管理法》及其实施细则等税收有关规定（以下简称“税收政策规定”），本公司受税务机关委托，对通过本公司获取劳务收入（包括劳务报酬、稿酬支出、特许权使用费等）发生应税项目的个人（以下简称“纳税人”），代征纳税人所获取劳务收入应缴纳的增值税、城市维护建设税、教育费附加及地方教育费附加，计税依据及税率按照相关税收政策规定执行。除此之外的税费代扣代缴以及结算事宜仍按照相关合同约定执行，纳税人需按照税收政策规定履行其纳税相关义务，以及自行承担补缴或退还的相关税款，税务机关对于纳税人税款的调整与腾讯公司无关。 该公告自2019年11月1日起执行。

我是创作者
1.视频合作需要保存多长时间？建议保留你的合作视频，后续作为合作案例展示。如需删除合作视频，建议在视频发表 7 天后操作，避免影响最终结算。若遇特殊情况需立刻删除，建议你提前与广告主或腾讯侧运营经理沟通协商，双方达成一致后操作。
2.每天可合作多少条视频广告？目前在相同发表日期，视频号流量主仅可接受一单合作任务。如当天收到多个广告主的任务需求，流量主接受其中一条后，另外的任务将自动拒绝。
3.已接受的任务是否可取消合作？流量主接受任务后，如因不可抗因素无法正常发表，请与广告主沟通协商，可由广告主主动取消任务，系统将不进行扣费与结算。如广告主已确认该条视频通过，进入到待发表环节，此时你可主动取消任务，系统将不进行扣费与结算。 
4.接受任务前是否可联系广告主？接受任务前，流量主在后台填写的商务联系人等信息对广告主不可见。接受任务后，广告主方可通过该联系方式与你联系。
5.合作价格可以更改吗？流量主可根据商单的需求情况灵活更改合作价格，修改合作价格不影响进行中的任务。
6.视频号互选广告收入如何提现？流量主设置的合作价格即为视频报价，任务完成后，流量主的广告收入为合作价格的 90%。如流量主为个人主体收款，平台将基于分成后的收入为流量主代扣代缴个税，并接受税务局委托，代征增值税和附加税费，并将最终结算金额打入流量主的银行卡。
7.视频号互选广告收入如何提现？我们将在次月 1 号和次月 15 号之前（如遇法定节假日，将会推迟），分别发送上半月和下半月的结算单，到你的结算单邮箱中。 如你是企业用户，你需要邮寄与结算金额等额的增值税发票给腾讯公司，腾讯公司将在收到发票后 30 个工作日将结算金额打入你的银行卡； 如你是个人用户，无需邮寄发票，腾讯公司将在结算日后 30 个工作日内将结算金额打入你的银行卡，并代扣代缴个税。
8.收款银行账号或结算单邮箱有变更，如何修改？可以登录视频号助手页面自助提交变更申请。具体操作如下：
进入创作者变现页面-财务管理-财务资料，点击右侧“修改”按钮进入结算信息变更页面，根据页面提示提交资料，提交完成后将进入审核状态，会在7个工作日内审核完毕。
我是广告主
1.视频号互选平台是如何收费的？视频号互选平台按视频号内容定制收费，合作价格由视频号创作者自主决定。
2.视频号互选广告投放需要准备什么？视频号互选广告推广需要明确制作要求及推广文案，可以在投放平台明确相关的投放信息。
3.视频号创作者接单后，我还需要做些什么？创作者接单后，表示双方合作已经达成，后续创作者还会发送视频定制内容等信息给到广告主，广告主可决定是否确认；
如果视频内容确认，后续创作者发布该内容后会获得约定的广告合作收入。
4.如果创作者发送的文章预览不符合已提交的服务要求，该怎么办？如果创作者发布的视频内容与广告主提交的“服务要求”不符，如出现了竞品、负面信息、敏感词等，可在视频内容确认时不通过该内容审核即可。
5.不同阶段任务未达成的收费是怎样的？互选广告分为不同的订单状态，不同状态下的收费情况不同，参考如下：
* 广告主发起取消：广告主确认终稿前，取消任务全额退款给广告主。确认终稿后，取消任务全额不予退还；
* 流量主发起取消：确认终稿后，流量主主动发起取消任务，全额退款给广告主；
* 其余情况：如超时未发表、超时未接单，超时未确认等，全额退款给广告主；
此外保留腾讯协商介入的权利，若腾讯做出相关判定的，应当予以遵守。
6.流量主接单后，是否还能修改推广要求或取消投放？关于修改：制作要求下单后均不可修改。推广文案在流量主提交审稿信息前可修改，已提交审稿信息则不可修改推广文案信息，只可进行 视频确认或者驳回 以及 合作取消。
关于取消：广告主在流量主视频发布前均可取消投放，其中广告主确认终稿前，取消任务全额退款给广告主。确认终稿后，取消任务全额不予退还。`,
  269: `微信视频号团队致力于为用户提供优质的服务体验和网络信息，为了更好地维护安全、有序、绿色的网络信息空间，确定以下运营基本原则，不仅作为平台使用者一切权责的基础，更期待你与微信视频号团队携手共同维护平台运营秩序、规范自律、互融共进。
诚实使用
使用虚假的信息创建帐号、故意误导他人、干扰真实的平台数据以及其他弄虚作假的行为，将损害平台每一位用户的权益，这是不被允许的。
分享好的内容
平台提倡分享优质的内容信息。不允许传播对他人有害、令人极度不适、不利于青少年身心健康等不良信息。
不干扰他人
用户自主使用视频号的前提是不得干扰其他用户的使用，包括直接或间接的干扰。

点击 
微信视频号内容运营规范
，查看完整内容运营规范。
为确保小任务视频内容健康且体验良好，平台会对参与小任务的视频进行审核。审核分为基础广告审核和相关性审核，了解以下审核要点和常见问题，合规创作高效过审。
一、广告审核常见问题
广告审核主要对视频和广告植入合规性进行审核，确保符合法律及平台审核规范要求。常见易错点：
广告中不得出现脏话和不文明用词。
驳回原因示例：
请勿宣传违反社会公序良俗的内容，请修改【牛掰、卧槽、牛逼、tm】。
过审指引
：建议删除不文明用词。
广告中不得使用最高级、顶级词汇。

驳回原因示例：
请勿使用顶级或禁用词汇修饰推广商品或服务，如【最全、天花板、王者、最万能】等，如果属实，请修改后重新投稿。
素材过审指引
：建议删除顶级词汇相关素材，广告中禁止使用“国家级”、“最高级”、“最佳”、“顶级”、“第一品牌”、“极品”、“至尊”、“最受欢迎”、“极致”等绝对化用语。
不能使用未授权的明星名义、形象素材、表情包等。

驳回原因示例：
涉及明星【明星表情包】肖像或名义，请修改后重新投稿。
素材过审指引
：建议删除明星肖像相关素材。
不支持使用人民币做为不良形象的素材推广，不得出现损毁人民币的场景。

驳回原因示例：
禁止使用人民币场景、人民币相关信息【人民币与虾比对】等内容，请优化删除。
素材过审指引
：建议删除人民币与虾对比的不良形象，可支持支付场景演绎，但仍不得出现人民币图样。
禁止使用低俗导向内容对用户造成负面影响。如低俗语言，姿势动作不雅，擦边动态等。

驳回原因示例：
请勿使用低俗导向内容，如【低俗语言】，请修改。
素材过审指引：
建议删美女半夜约这种游戏相关素材，素材内容不得使用色情语言描述，不得使用让人引起歧义的不明场景语言的描述。
禁止妨碍社会公共秩序或者违背社会良好风尚，不允许任何违法犯罪行为的描述作为推广素材。
素材投放示意
驳回问题详情
素材过审指引
素材示例-暴力行为
请勿宣传违反社会公序良俗的内容，如【暴力行为】请修改。
建议删除砸在电脑的相关素材。
素材内容不得介绍暴力细节、表达施暴后的快感等，不得在视频中出现打、砸、摔东西等场景。
素材示例-诱导沉迷上瘾
请勿宣传违反社会公序良俗的内容，如【诱导沉迷上瘾】请修改。
建议删除玩游戏从早到晚的相关描述。
素材示例-违背道德秩序
请勿宣传违反社会公序良俗的内容，如【违背道德秩序】请修改。
建议删除小三代替原配的相关描述
广告内容不得通过利诱手段涉及诱导分享好友及诱导关注公众号等活动形式的作弊行为。

驳回原因示例：
请勿出现以奖励或其他方式，强制或诱导用户操作的描述，包括但不限于诱导点击，诱导关注、诱导分享或诱导下载，请删改【诱导点击】。
素材过审指引：
建议删除关注我领福利相关描述。
二、相关性审核常见问题
广告审核主要对视频是否满足广告主任务要求进行审核，在制作视频前需要认真阅读【任务要求】和【任务指引】，逐条对照任务要求。
以「淘特App」小任务为例：
任务要求
（1）口播要求：必须提及“上淘特，搜啥都便宜，认准金冠标，价格不怕比，还能赢免单”
（2）话题要求：添加指定话题：淘特大狂欢 搜索赢免单
（3）@要求：@淘特官方
内容建议
视频可围绕“上淘特，搜啥都便宜，认准金冠标，价格不怕比，还能赢免单（每晚8点中奖概率更大）”的传播信息进行创作。
内容包括但不限于以下几个方向，视频融入淘特“金冠标”或者免单截图更佳：
a.真实分享淘特免单的经历
b.花式解说免单攻略
c.爆笑点评淘特免单活动
d.种草淘特金冠标的品与免单玩法
e.玩转淘特免单贴纸
优秀植入示例

`,
  78: `一、流量主违规行为定义
流量主违规行为是指流量主使用微信视频号展示服务时违反法律法规规定、《微信视频号运营规范》等广告展示服务相关的协议、规定、规范性文件等的相关行为。
二、流量主违规行为处罚措施
对于广告展示违规行为，腾讯有权单方视情节轻重对流量主账户采取如下一项或多项措施：
警告： 
腾讯向流量主发出系统警告通知，并要求流量主作限时整改；
冻结账号操作权限：
 允许流量主登陆微信视频号广告展示服务管理界面，但无法进行任何操作；视频号内的所有文章将暂停广告展示功能，冻结期间不产生展示收入；冻结解除后，流量主操作恢复广告展示位置，可以就恢复后的广告展示获得收入；
扣除广告展示收入： 
扣取流量主所有未结算展示收入作为违约金。为维护广告主权益，腾讯也有权将扣除的展示收入用于处理纠纷及赔偿损失，相关损失腾讯有权进一步向流量主追偿；
终止广告展示服务：
 关闭流量主广告展示相关的所有权限，流量主不能再使用广告展示服务，不能再登录微信视频号广告展示服务管理界面和进行任何与广告展示服务相关的操作，包括但不限于申请结算展示收入、提现等操作，流量主自被处罚当月起，展示收入不予结算；
其他：
 其他依照《微信视频号运营规范》等广告展示服务相关的规定腾讯有权采取的措施。
三、违规行为的内容和定级
同一主体（公司）下的违规记录流量主账户达到一定数量，微信广告有权视其违规情节严重程度及影响程度，暂停该主体（公司）流量主申请资格。
1. 账号维度
1.1 一级违规
1.1.1 违规行为
发布谣言或含有政治、色情、赌博、毒品、侵权、虚假信息等违法内容的视频内容。包括但不限于视频号帐号名称，或视频号内发布的视频内容（含标题）内存在危害国家安全、敏感政治、淫秽、色情（色情擦边、性暗示等）、毒品、赌博、虚假、谣言、侮辱、诽谤、恐吓或骚扰、低俗、侵犯他人知识产权或人身权或其他合法权益、可能对他人/企业或其他机构造成损害的内容等违法违规信息。
利用第三方运营平台、外挂软件等方式刷访问用户数量以开通流量主帐号，包括僵尸用户刷量、漏洞刷量、外挂软件刷量等。
1.1.2 处罚手段
终止流量主广告展示服务并扣除未结算广告展示收入，依法追究相关法律责任或采取其他处罚。
1.2 二级违规
1.2.1 违规行为
通过技术手段制造虚假流量，包括但不限于代理服务器、作弊程序、作弊软件等任何不正当方式伪造点击量、下载量、曝光量的行为。
制造无效流量，包括但不限于开发者自行或委托第三方进行反复手动点击、下载、曝光的行为。
1.2.2 违规处罚手段
首次，暂停广告接单服务30天，扣除未结算广告展示收入；第二次，终止广告展示服务，扣除未结算广告展示收入。情节严重者将直接终止广告展示服务并扣除未结算广告展示收入，依法追究相关法律责任或采取其他处罚。
2. 视频维度
2.1 违规行为
2.1.1 诱导点击广告
包括但不限于流量主在运营者可控的位置，如视频标题、视频内容、作者评论等，通过明示或暗示的方式诱导、鼓励、煽动用户反复访问、点击视频号内的广告展示页面。
2.1.2 内容低俗
视频标题低俗，与内容不符，且使用低俗、暴露图片诱导用户点击，对广告主利益及公众平台生态造成损害。
2.2 违规处罚手段
终止流量主违规视频内容的广告展示服务并扣除该视频内容未结算的广告展示收入，依法追究相关法律责任或采取其他处罚。情节严重者将上升账号维度处罚并扣除未结算广告展示收入，依法追究相关法律责任或采取其他处罚。
3. 其他违规
3.1 一级违规
3.1.1 违规行为
流量主因违反公众平台规范被永久封号。
3.1.2 违规处罚手段
终止流量主广告展示服务并扣除未结算广告展示收入，依法追究相关法律责任或采取其他处罚。
3.2 二级违规
3.2.1 违规行为
流量主因违反公众平台规范被删除视频内容。
3.2.2 违规处罚手段
终止流量主违规视频内容的广告展示服务并扣除该视频内容未结算的广告展示收入，依法追究相关法律责任或采取其他处罚。情节严重者将上升账号维度处罚并扣除未结算广告展示收入，依法追究相关法律责任或采取其他处罚。 
3.3 三级违规
3.3.1 违规行为
流量主通过违法违规等不正当手段获取流量的方式，包括但不限于通过发布违法违规内容获取流量以产生广告收益等情况。
3.3.2 违规处罚手段
一经发现，永久停止广告合作，未结算收入仍可结算。
四、附则
本细则是微信视频号平台广告展示服务规则，属于《微信视频号运营规范》有效组成部分，腾讯有权根据自身运营管理需要更新本细则，上述更新一经正式发布，流量主即应遵守；
在本细则中未作明确的广告展示违规行为，腾讯有权根据《微信视频号运营规范》等规则进行处理。
本细则自公布之日起生效。`,
  50: `小程序流量主可通过接入广告组件，快速将小程序内指定位置分享给广告主作广告展示，按月获得广告收入。
开通流程
当满足以下条件，小程序开发者即可申请成为流量主：
小程序累计独立访客（UV）>1000
无刷粉行为且未曾有严重违规记录
申请流程
：登陆 
微信公众平台
 → 点击左侧面板进入“
推广-流量主
”页面 → 申请开通 → 同意协议 → 选择要开通的广告位 → 提交。
温馨提示：开通流量主功能后请及时补充财务资料，以免影响结算。
`,
  49: `符合一定条件的小程序运营者可自愿将小程序内指定位置分享给广告主作广告展示，即可成为小程序广告流量主，按月获得广告收入。
小程序流量主可开通广告位包括：
Banner广告
、
激励广告
、
插屏广告
、
视频贴片广告、视频广告、原生模板广告
、
封面广告
。
流量主可轻松实现流量变现，持续获取收入，依托于高价值的内容，实现品牌塑造和内容变现的双赢。
Banner广告
展示位置
小程序页面内，由小程序流量主决定实际播放位置。
展现逻辑
系统会根据广告素材的定向和浏览小程序的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告，广告位置需由流量主自定义。
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。按单日广告收入流水的50%比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小程序广告流量主操作指引
激励广告
展示位置
流量主在小程序中自定义广告入口与奖励内容，用户主动点击，触发广告。
播放逻辑
视频默认有声播放，不区分网络条件，用户可随时点击关闭声音
视频开始播放后，出现广告卡片，点击跳转广告落地页
视频播放过程中，用户可随时关闭广告
用户播放完视频，并手动点击“关闭广告”按钮返回小程序下发奖励内容
视频不支持循环播放
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小程序广告流量主操作指引
插屏广告
展示位置
流量主在小程序中自定义广告场景，用户触发该场景时，插屏广告将自动向用户展现。
展现逻辑
系统会根据广告素材的定向和浏览小程序的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告，广告位置需由流量主自定义。
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小程序广告流量主操作指引
视频贴片广告
展示位置
包含视频内容的小程序，流量主可自定义广告出现的具体视频。当用户点击播放视频内容时，视频前贴广告将在视频播放前展示。
播放逻辑
广告视频在任何网络状况下都播放，是否自动播放依据小程序本身视频内容播放逻辑
仅支持视频播放前配置视频前贴广告位，视频默认有声播放
全屏模式下不展示视频前贴广告
广告素材播放期间不可点击暂停
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小程序广告流量主操作指引
视频广告
展示位置
在小程序页面内接入，由流量主决定广告实际展示的位置，广告区域露出一定比例开始播放，用户离开广告素材后暂停播放，返回后继续播放。
播放逻辑
广告区域露出 50% 后开始播放，在 4G + WIFI下自动播放
广告默认静音播放，用户可点击打开/关闭声音
广告播放结束后将自动重播，广告不支持暂停播放
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小程序广告流量主操作指引
原生模板广告
展示位置
原生模板广告共计 5 种画布类型，组成 15 种默认模板，且可对圆角、边距等元素自定义编辑。可适配场景较多，流量主可根据小程序实际场景创建自己适配的模板，在最恰当的场景展现广告。
展现逻辑
系统会根据广告素材的定向和浏览小程序的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告，广告位置需由流量主自定义。
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小程序广告流量主操作指引
小程序原生模板广告产品手册
封面广告
展示位置
用户进入小程序时，展示广告内容，用户可随时跳过，或自动倒数5秒后自动跳过。
展现逻辑
系统会根据广告素材的定向和浏览小程序的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告。
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
接入方式
小程序流量主在后台直接开启封面广告开关即可，并可根据自身需求调整接入的场景值。`,
  72: `广告位管理
流量主可在“广告位管理”中选择自由开启或关闭广告位。

注：封面广告开关状态调整后，1小时内不可再次调整；其他广告位可随时调整开关状态。

1. 创建广告位 点击“新建广告位”开始创建，输入广告位名称即可，如计划插入多个广告位，需要分别新建。


2. 获取代码 获取广告位代码片段，系统将生成广告位的代码片段，开发者点击“复制代码”留用。


3. 嵌入代码-测试-发布：嵌入代码片段至希望展示广告的位置，并在发布前通过测试预览广告位展示情况。 
注：请务必完成主流机型的适配测试，由于适配原因带来的违规问题，将受到同等处罚。 可在广告管理-广告位管理处，查看组件审核状态（审核中、审核驳回、审核通过），审核通过后小程序线上即可展示广告。
流量主可以在"广告管理"页的"广告屏蔽”板块设置广告主黑名单，支持屏蔽公众号、应用、小程序及小游戏，对小程序及小游戏全局广告进行屏蔽。
设置后，名单中广告主的广告将不会出现在流量主的小程序及小游戏中。如果要取消屏蔽，做删除操作即可。

针对 iOS 应用，如何获取 Apple ID？
1. 
打开 App Store

2. 搜索并找到应用

3. 选择应用，点击下载倒三角下拉菜单，复制链接

4. 网址链接中，id后面的一串数字就是应用的Apple ID

针对Android应用，如何获取应用宝包名？
1. 
打开
应用宝官网

2. 搜索并找到应用

3. 查看应用主页的链接，apkName=后的字母组合就是应用宝包名

针对微信公众号，如何获取微信号？
若在屏蔽功能中按微信公众号名称搜索无结果，可直接搜索微信号查找。获取微信号指引如下：
打开微信公众号主页，点击公众号主页

在公众号简介-基础信息中找到微信号

针对小程序/小游戏，如何获取原始账号ID？
若在屏蔽功能中按小程序/小游戏名称搜索无结果，可直接搜索原始账号ID查找。获取原始账号ID指引如下：
进入小程序，点击右上角

点击半屏页顶部的小程序/小游戏简介

点击简介页面的更多资料

在更多资料中即可找到原始账号ID

一、功能步骤
打开
微信广告投放平台
-We分析/实验工具—新建实验（
筛选广告监测指标
）—实验调试及发布—效果分析—决策全量。
二、实验场景
流量主可通过灵活流量分配，进行实验找到：
合适的广告位类型（如：接入banner还是原生模板）
合适的广告位置（如：接入位置是首屏顶部还是腰部）
合适的广告组合（如：是否增加广告位&频次设置）

同时，实验也可观察用户体验情况，帮助大家更好平衡广告变现和用户体验之间的关系。
详细功能说明指引可参考
广告实验工具详细操作指引
针对小程序封面广告组件，支持
流量主无需任何开发，即可使用AB实验和用户人群屏蔽能力
，为广告收入与用户体验平衡保驾护航。以下为产品能力详细介绍。
能力一：AB实验能力
场景：封面广告只能全量打开，对用户的体验有所影响。
诉求：如何实现控量实验，并且科学量化地协助评估用户影响，放心变现？
1、配置和发布实验
进入
We分析平台
，点击左下方开通【洞察分析】能力。
侧边栏选择【AB实验 - 实验看板】，点击选择【新建实验】，在实验类型中选择【小程序封面广告实验】配置参数并发布生效，无需代码开发。



2、开启封面广告
进入
微信公众平台
 ，在流量主后台广告位管理板块，开启封面广告广告位（若已开启，可跳过此步骤）。

3、分析实验数据
实验发布后，可在【We分析 - AB实验 - 实验数据】中，查看实验结论和数据情况。

4、结果固化
若已有实验结论和数据，已可支撑决策，则可以通过【结束】实验来释放流量。

如决策【开通封面广告】，结束实验并选择实验组全量发布即可；
如决策【不开通封面广告】，可在结束实验后，在流量主后台关闭封面广告，或者删除实验后重新新建实验观察。

能力二：用户人群屏蔽能力
场景：打开封面广告，持续有小部分用户产生客诉，或需保护特定用户使用体验。
诉求：如何实现针对用户人群或特定画像用户进行屏蔽，缓解内外部压力？
1、屏蔽操作
进入
We分析平台
平台，点击左下方开通【洞察分析】能力。
侧边栏进入【AB实验 - 实验看板】，点击【新建实验】；实验类型选择【小程序封面广告实验】，实验流量选择【定向屏蔽】并上传人群包，完成实验创建并发布后即可生效。


2、支持维度
支持开发者定向屏蔽
人群号码包，
以.txt文件的形式上传用户openid。

数量限制：最多支持100万个OpenID的屏蔽

常见问题Q&A
Q1：AB实验建议观察哪些指标？
A1：一般地，流量主对：“封面广告是否影响用户流失，进一步是否影响其他广告位的变现情况，导致整体变现规模下降”这个命题存在困惑，因此推荐关注以下指标：
核心指标：流量主-广告汇总-广告收入
次级指标：访问-小程序访问次数、访问-小程序次日留存率、流量主-广告汇总-广告曝光次数、流量主-广告汇总-广告eCPM
以上指标均已默认选中，如需更多数据指标辅助决策，可以自行选择其他指标，所有指标说明见：
指标事件管理 | 微信开放文档

Q2：AB实验操作结束后，实验组和测试微信号是否继续生效？
A2：不生效，开发者一旦操作实验结束/全量，原先配置的策略将不再生效；若实验结束后，开发者仍有对特定用户展示或不展示封面广告的诉求，可以通过参考上述【二、敏感用户屏蔽能力】的操作指引，创建屏蔽规则。

Q3：为什么配置AB实验后，无任何收入？
A3：实验上线需要同步在小程序流量主后台开启封面广告，否则将无法正常切流生效。

Q4：为什么定向屏蔽特定用户后，仍展示封面广告？
A4：由于版本覆盖问题，会有少量（5%，持续下降）用户用户无法被命中实验，将无法被定向屏蔽过滤，默认展示封面广告。

Q5：为什么无法同时创建多个封面广告实验？
A5：1个小程序账号在We分析后台最多同时存在1个封面广告实验：若已有封面实验再重复创建，则会提示“实验参数已存在”无法正常完成创建，结束并删除已有实验即可正常操作。

Q6：定向屏蔽能力中，屏蔽人群和测试微信号有什么区别？
A6：屏蔽人群仅支持上传OpenID号码包，用于大数量用户的屏蔽，最多支持100万个，发布实验后生效；测试微信号仅支持填入微信号，用于内部人员进行测试，最多支持1000个，创建实验后生效。

Q7：除了封面广告，其他广告位是否支持AB实验？
A7：支持，详细操作指引参考
链接
。

更多疑问，可前往
微信开放社区
提问，或在公众号【微信广告助手】进行在线客服咨询。
1、快速入门
第一步：创建广告位
在 
微信广告投放平台
 - 流量主 - 广告管理
，点击“新建广告位“进入新建广告位页面，选择“原生模板广告”点击“下一步”即可进入广告位创建。

第二步：选择模板
原生模板广告编辑器提供了全屏模板、横版卡片模板、竖版卡片模板、横幅模板和格子模板 
5 种
画布类型，组合成 
15 种
默认模板可供选择，覆盖多种小程序场景。

第三步：编辑模板与完成发布
在这里，你可以对模板中的组件进行适当地编辑，与场景更加匹配。

编辑完成后，点击右上角“完成并发布”，弹出提示广告位 ID 完成创建。

编辑项包含素材区与信息区两个部分，其中：

素材区 - 广告组件中展示广告素材的区域，可对素材类型、初始声音和进度条颜色等进行编辑。

信息区 - 广告组件中展示广告信息的区域，可对广告主头像、名称、文案和转化按钮等进行编辑。

第四步：接入上线
发布后可在“广告位管理”复制广告代码，参考开发文档接入小程序，调试完成上线。

备注：已发布的原生模板广告，每次编辑发布后，将覆盖前一个样式，建议明确最终样式修改后再操作。

2、编辑器简介
在介绍如何使用原生模板广告编辑器前，先简单介绍下编辑器各个模块的功能。

① 模板选择区
提供广告模板选择，需注意每次切换模板，之前的编辑记录将被清空。
② 顶部工具区
顶部工具栏以全局设置类功能为主，包括：为广告单元命名，切换预览机型，放大/缩小画布，撤销/重做，恢复默认，完成并发布。
③ 预览区
预览画布会随每次编辑修改而发生变化，方便你实时看到原生模板广告位的样式变化。
④ 编辑区
选择完模板后，画面右侧会出现该模板对应的编辑区，你可以在此处完成模板的个性化编辑。
3、模板简介
① 全屏模板
适合场景

适用于接入更加开放型页面，如用户停留较久场景、访问频繁场景等
模板数量

目前支持 1 种全屏模板
② 卡片模板
适合场景

适用于接入更加开放型页面，如用户停留较久场景、访问频繁场景等
模板数量

目前支持 4 种竖版卡片模板和 4 种横版卡片模板
③ 横幅模板
适合场景

适用于更加灵活嵌入的页面，如内容阅读场景、信息列表场景等
模板数量

目前支持 3 种横幅模板
④ 格子模板
适合场景

适用于各类型的页面，如游戏结算页、功能入口场景等
模板数量

目前支持 3 种格子模板
关于小程序原生模板广告形态、调整规范等详细内容，可查看
 《小程序原生模板广告手册》
4、建议指南
体验建议
广告效果与广告的展示位置、样式密切相关，而这两点都是可控的。要获得最为理想的效果，考虑周全的设计和对细节的关注必不可少。在这里，我们提供几个小建议，供你在使用模板时参考：
建议1：让广告成为小程序场景的自然组成部分。

在确保广告契合小程序场景情况下，但又能够清楚辨识
建议2：让广告内容易于交互。

在不破坏小程序布局的前提下，可以考虑使用相对调整画布大小，让广告信息呈现更加明确
建议3：不影响用户体验。

接入广告的流量场景不应该干扰用户正在进行的操作
建议4：可通过 AB Test 测试不同模板效果。

通过 AB Test 测试不同模板样式的效果，提升广告组件的 eCPM
配置建议
建议1：圆角设置

根据小程序场景，可适当给广告画布增加圆角。

建议2：按钮颜色

根据小程序品牌色，可选择最适合的按钮和进度条颜色。建议按钮和进度条调整为一致颜色。

建议3：视频结束页

在视频播放完毕后，覆盖在视频上广告主信息页面。视频结束页为视频素材配置项，目前支持在 
横版卡片模板
 和 
竖版卡片模板
 上展示。

建议4：模板托管
模板托管，是针对已发布的小程序原生模板广告单元，在流量主设置的模板编辑项基础上，由引擎择优展示相同画布类型下的不同模板样式，助流量主省去测试环节，实现更高的
曝光 eCPM
 与
广告收益
。
`,
  73: `1. 流量主可在“数据统计”页的”广告数据“板块，分广告位查看每日的曝光量、点击量以及收入数据。

2. 流量主可在“数据统计”页的“用户数据-趋势看板”板块，查看广告组件各关键指标的环/同比趋势幅度

3. 流量主可在“数据统计”页的“用户数据-用户价值看板”板块，查看小程序内用户不同拆解维度下的数据趋势图及对比数据

4. 流量主可在“数据统计”页的“用户数据-数据报表”板块，对小程序内的广告用户，拆解画像维度数据进行查看。

5. 流量主可在“财务管理”页的“收入数据”板块，查看分广告位分日收入明细数据。

6. 流量主可在“数据统计”页的“页面数据”板块，分页面查看各组件的曝光、点击等数据。

一、功能入口
打开【流量主服务助手】小程序—首页上滑至【行业对比】模块—可切换不同Tab查询指标对比情况—点击【详细了解】查看调优建议。
二、功能说明
提供开发者所处行业
广告渗透率
、
人均曝光次数
和
广告位类型数
等核心指标，帮助开发者洞察自身与行业的数据对比情况。
根据对比情况，
系统提供调优建议
，帮助开发者更好地进行广告变现优化，提升收入。

备注：
数据更新周期：
系统指标数据每天上午更新（截止前一天的数据）。
附流量主服务助手二维码：

一、功能入口
消息推送：若流量主收入前一日有波动，将通过【微信广告助手】-流量主数据日报进行推送。
其他入口：打开【流量主服务助手】小程序—点击首页波动提示条—点击波动归因指标—查看详细波动原因。
二、功能说明
当流量主收入有波动（上升/下降）时，系统进行归因诊断，支持定位到详细指标查看波动原因，帮助流量主快速定位问题。

备注：
波动诊断同步时间：
若流量主收入有波动，系统次日上午将展示波动提示条并提供波动原因。
波动提示条展示周期：
仅波动日次日展示，波动日后第二天起不展示。
附流量主服务助手二维码：
`,
  74: `一、违规行为定义
小程序（含小游戏类目，下同）流量主违规行为是指小程序流量主使用微信广告平台展示服务时违反法律法规规定、
《微信公众平台服务协议》
《微信平台广告展示服务协议》
等广告展示服务相关的协议、规定、规范性文件等的相关行为。
二、违规处罚类型
对于广告展示违规行为，腾讯有权单方视情节轻重对流量主账户采取如下一项或多项措施：
警告：
腾讯向流量主发出系统警告通知，并要求流量主限时整改；
驳回：
暂停流量主广告组件的展示能力，流量主按规范整改后可重新提交；
冻结账号操作权限：
暂时关闭流量主账号的广告展示相关权限，无法展示任何广告内容。期间允许流量主登录微信公众平台广告展示服务管理界面，但无法进行任何操作，不能使用广告展示服务，不产生广告展示收入。冻结解除后，流量主操作恢复广告展示，可以就恢复后的广告展示获得收入新增；
终止账号的广告展示服务：
永久关闭流量主账号的广告展示相关权限。终止后，流量主不能再使用广告展示服务；
扣除广告展示收入：
扣取流量主账号的未结算展示收入作为违约金。为维护广告主权益，腾讯有权将扣除的展示收入用于处理纠纷及赔偿损失，若不足，腾讯有权进一步向流量主追偿；
同一收款主体（同一自然人或同一公司主体，下同）下的流量主账户违规记录达到一定数量的（具体以微信广告单方确定为准），微信广告有权视其违规情节严重程度及影响程度，自行决定暂停该收款主体的流量主申请资格（即暂停以该自然人或公司主体注册的全部小程序的流量主申请），以及冻结该收款主体下所有流量主账号的操作权限，并将该收款主体下所有流量主账号的全部未结算的广告展示收入作为违约金进行扣罚。
三、违规行为分类
1. 一级违规
1.1 违反国家法律法规
发布谣言或含有政治、色情、赌博、毒品、侵权、虚假信息等违法信息的内容。包括但不限于流量主账号名称，或账号内发布的内容存在危害国家安全、敏感政治、淫秽、色情（色情擦边、性暗示等）、毒品、赌博、虚假、谣言、侮辱、诽谤、恐吓或骚扰、低俗、侵犯他人知识产权或人身权或其他合法权益、可能对他人/企业或其他机构造成损害的内容等违法违规信息。
1.2 违反
微信小程序平台运营规范
流量主因违反微信小程序平台运营规范，账号被永久封禁或注销。
1.3 刷开通
流量主的账号为利用第三方运营平台、外挂软件等方式，通过刷访问用户数量得以开通的情况的，包括僵尸用户刷量、漏洞刷量、外挂软件刷量等。
一级违规处罚手段
一经发现，终止流量主账号的广告展示服务，并扣除未结算的全部广告展示收入作为违约金。

2. 二级违规
2.1 恶意作弊行为
2.1.1 通过技术手段制造虚假流量，伪造曝光、点击、效果数据等；
2.1.2 自行或委托第三方反复手动产生曝光、点击、效果数据等；
2.1.3 通过外部渠道恶意引导用户点击广告，产生效果数据。
2.2 恶意对抗行为
通过使用地域/机型/人群/时间屏蔽等技术手段绕开平台审核等恶意广告作弊行为。
2.3 强制点击
以广告位阻断用户正常使用相关互联网服务的流程，强制将广告作为相关服务的页面出口要求用户点击，例如所有运营内容都只能通过观看激励视频广告才能解锁等。
2.4 诱骗点击
包含但不限于通过移动banner广告、高频点击后突然出现广告、用户无广告播放预期等行为，导致用户误点击广告。
2.5 恶意篡改样式
包含但不限于修改广告组件透明度、样式等行为，导致用户误点击广告。
2.6 激励视频无点击播放
通过技术手段在无用户点击的情况下播放激励视频广告。
2.7 非正常手段拉取广告导致误点
包含但不限于通过技术手段在无用户预期的情况下拉取广告，导致用户误点广告的行为。
二级违规处罚手段
（1）针对2.1：
①首次发现，冻结流量主账号的操作权限30天，并扣除全部未结算的广告展示收入作为违约金；
②第二次发现，终止流量主账号的广告展示服务，并扣除全部未结算的广告展示收入作为违约金。
（2）针对2.2-2.7：
前两次驳回广告组件，扣除流量主账号的全部未结算收入作为违约金。第三次冻结账号操作权限30天，扣除账号的全部未结算收入作为违约金；第四次终止账号广告展示服务，扣除账号的全部未结算收入作为违约金。

3. 三级违规
3.1 滥用广告组件
3.1.1 流量主通过非官方提供的开发能力，使广告位主动触发素材刷新；
3.1.2 激励视频广告入口的描述未明确说明广告播放的预期；
3.1.3 激励视频广告未完全播放（提前关闭），流量主照常下发奖励；
3.1.4 激励视频广告播放后未下发所承诺的奖励；
3.1.5 点击激励视频广告后，人为控制视频播放的时间（包括但不限于延后播放）；
3.1.6 流量主在小程序内设计广告的关闭逻辑，包括但不限于：付费免广告、广告关闭按钮等；
3.1.7 流量主在单屏内容里展示两个及以上banner、原生广告位、视频前贴、视频广告位等；
3.1.8 流量主使广告位无规则悬浮等；
3.2 误导点击
3.2.1 使用包括但不限于按钮、图片、文字等内容遮挡广告位，易造成用户误点击；
3.2.2 广告区域与页面内容（尤其是可点击区域）无间距相连，易造成用户误点击；
3.2.3 包含但不限于使用微信官方logo充当用户头像发表评论、模仿官方消息通知、模仿红包样式等方式模仿官方广告位样式，给用户带来误导性的点击预期。
3.3 诱导点击
流量主在账号内可控的位置，通过明示或暗示的方式诱导用户反复访问、点击广告。
三级违规处罚手段
前两次驳回广告组件，从第三次起依次冻结帐号操作权限1天、7天、15天、30天、90天、终止账号广告展示服务。从冻结账号操作权限30天开始，每次处罚均扣除账号的未结算收入。

4. 四级违规
4.1 违反
微信小程序平台运营规范
流量主账号因违反微信小程序平台运营规范被暂时封号/封禁广告相关能力。
四级违规处罚手段
依据平台处罚天数，同等冻结流量主账号的广告操作权限，冻结期间不扣除广告展示收入。

5. 其他违规
5.1 不正当获取流量
流量主通过违法违规等不正常手段获取流量，包括但不限于发布违法违规内容以获取流量、产生广告收益等情况。
其他违规处罚手段
一经发现，终止流量主广告展示服务。

四、附则
本细则是微信公众平台广告展示服务规则，属于
《微信平台广告展示服务协议》
有效组成部分，腾讯有权根据自身运营管理需要更新本细则，上述更新一经正式发布，流量主即应遵守。
在本细则中未作明确的广告展示违规行为，腾讯有权根据
《微信公众平台服务协议》
《微信平台广告展示服务协议》
《微信小程序平台运营规范》
等协议、规则进行处理。
`,
  272: `一、基础介绍
背景和概述
为帮助广大代开发小程序商家进行流量变现，同时让服务商伙伴享受微信生态带来的商业价值。
微信广告联合微信开放平台，推出「小程序流量主代运营」模式。
通过为服务商（即“小程序代开发服务商”）提供官方产品能力，支持其
协助小程序商家进行流量变现，共享广告收益，获得可持续商业化收入补充。

适用范围
适用服务商：第三方平台小程序代开发服务商
适用小程序：非游戏类目，累计独立访客（UV）达到1000，且无严重违规记录
二、能力优势
1、 
有效率：1次模板开发，批量商家复用
服务商通过使用“模板小程序”能力，预置广告能力，实现小程序商家批量覆盖，降低广告组件接入成本，提升开发效率。

2、 
有能力：核心变现能力API接口支持
对齐独立开发小程序成熟广告变现能力，结合服务商使用习惯，平台将核心能力接口化，支持广告上线全流程接口化实现，能力全面且操作简单。

3、 
有收益：灵活分账比例，平台统一结算
平台支持服务商和小程序商家自定义设置分账比例，在小程序完成授权流程同时，可一步到位确认分账比例。微信广告每半月进行分账结算，免去服务商二次结算的财务流程。


三、使用说明
5步接入，商家和服务商分享可持续广告变现收入


● 详细操作指引参考：
服务商广告变现解决方案
● 技术接口文档参考：
广告API接口文档`,
  237: `小游戏流量主可通过接入广告组件，快速将小游戏内指定位置分享给广告主作广告展示，按月获得广告收入。
开通流程
满足以下条件，小游戏开发者即可申请成为流量主：
小游戏累计独立访客（UV）>1000
无刷粉行为且未曾有严重违规记录
申请流程
：登陆 
微信公众平台
 → 点击左侧面板进入“
推广-流量主
”页面 → 申请开通 → 同意协议 → 选择要开通的广告位 → 提交。
温馨提示：开通流量主功能后请及时补充财务资料，以免影响结算。
`,
  236: `符合一定条件的小游戏运营者可自愿将小游戏内指定位置分享给广告主作广告展示，即可成为小游戏广告流量主，按月获得广告收入。
小游戏流量主可开通广告位包括：
Banner广告
、
激励广告
、
插屏广告
、
原生模板广告（格子模板）
。
流量主可轻松实现流量变现，持续获取收入，依托于高价值的内容，实现品牌塑造和内容变现的双赢。
Banner广告
展示位置
小游戏页面内，由小游戏流量主决定实际播放位置。
展现逻辑
系统会根据广告素材的定向和浏览小游戏的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告，广告位置需由开发者自定义。
流量主分成方案
根据用户的每一次广告点击或每千次有效的广告曝光，平台收取广告费用并与流量主分成（收取广告费用方式与广告主选择的出价方式有关）。
创意小游戏

单日广告收入流水 200 万以内的部分，开发者可获其中 70%； 单日广告收入流水超过 200 万的部分，开发者可获其中 50%，不设上限。
普通小游戏

开发者按单日广告收入流水的50%比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小游戏广告流量主操作指引
激励广告
展示位置
开发者在小游戏中自定义广告入口与奖励内容，用户主动点击，触发广告。
播放逻辑
视频默认有声播放，不区分网络条件，用户可随时点击关闭声音
视频开始播放后，出现广告卡片，点击跳转广告落地页
视频播放过程中，用户可随时关闭广告
用户播放完视频，并手动点击“关闭广告”按钮返回小程序下发奖励内容
视频不支持循环播放
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。
创意小游戏

单日广告收入流水 200 万以内的部分，开发者可获其中 70%； 单日广告收入流水超过 200 万的部分，开发者可获其中 50%，不设上限。
普通小游戏

开发者按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小游戏广告流量主操作指引
插屏广告
展示位置
开发者在小程序/小游戏中自定义广告场景，用户触发该场景时，插屏广告将自动向用户展现。
展现逻辑
系统会根据广告素材的定向和浏览小游戏的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告，广告位置需由开发者自定义。
流量主分成方案
按照每千次有效的广告曝光，平台收取广告费用并与流量主分成。
创意小游戏

单日广告收入流水 200 万以内的部分，开发者可获其中 70%； 单日广告收入流水超过 200 万的部分，开发者可获其中 50%，不设上限。
普通小游戏

开发者按单月广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小游戏广告流量主操作指引
原生模板广告（格子模板）
展示位置
原生模板广告展现场景由小游戏流量主自定义，根据各自小游戏的特点，灵活设置展现页面与位置。
展现逻辑
系统会根据广告素材的定向和浏览小游戏的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告。
当前支持3种格子模板样式：单格子、多格子、矩阵格子。
流量主分成方案
格子类图片素材根据用户的每一次广告点击，平台收取广告费用并与流量主分成。
创意小游戏

单日广告收入流水 200 万以内的部分，开发者可获其中 70%； 单日广告收入流水超过 200 万的部分，开发者可获其中 50%，不设上限。
普通小游戏

开发者按单日广告收入流水的 50% 比例分成，不设上限。
实际分成以后台“数据统计”页面展示为准。
小游戏广告流量主操作指引
小游戏原生模板广告产品手册`,
  238: `广告位管理
流量主可在“广告位管理”中选择自由开启或关闭广告位。

若关闭广告位，24 小时内将不可再次开通。

1. 创建广告位 点击“新建广告位”开始创建，输入广告位名称即可，如计划插入多个广告位，需要分别新建。



2. 获取代码 获取广告位代码片段，系统将生成广告位的代码片段，开发者点击“复制代码”留用。


3. 嵌入代码-测试-发布：嵌入代码片段至希望展示广告的位置，并在发布前通过测试预览广告位展示情况。 注：请务必完成主流机型的适配测试，由于适配原因带来的违规问题，将受到同等处罚。 可在广告管理-广告位管理处，查看组件审核状态（审核中、审核驳回、审核通过），审核通过后小游戏线上即可展示广告。
流量主可以在"广告管理"页的"广告屏蔽”板块设置广告主黑名单，支持屏蔽公众号、应用、小程序及小游戏，对小程序及小游戏全局广告进行屏蔽。
设置后，名单中广告主的广告将不会出现在流量主的小程序及小游戏中。如果要取消屏蔽，做删除操作即可。

针对iOS应用，如何获取Apple ID？
1. 
打开App Store

2. 搜索并找到应用

3. 选择应用，点击下载倒三角下拉菜单，复制链接

4. 网址链接中，ID 后面的一串数字就是应用的 Apple ID

针对Android应用，如何获取应用宝包名？
1. 
打开
应用宝官网

2. 搜索并找到应用

3. 查看应用主页的链接，apkName=后的字母组合就是应用宝包名


针对微信公众号，如何获取微信号？
若在屏蔽功能中按微信公众号名称搜索无结果，可直接搜索微信号查找。获取微信号指引如下：
打开微信公众号主页，点击公众号主页

 在公众号简介-基础信息中找到微信号

针对小程序/小游戏，如何获取
原始账号ID
？
若在屏蔽功能中按小程序/小游戏名称搜索无结果，可直接搜索原始账号ID查找。获取原始账号ID指引如下：
进入小程序，点击右上角

点击半屏页顶部的小程序/小游戏简介

点击简介页面的更多资料

在更多资料中即可找到原始账号ID

一、快速入门
第一步：创建广告位
在 
MP - 流量主 - 广告管理
，点击“新建广告位“进入新建广告位页面，选择“原生模板广告”点击“下一步”即可进入广告位创建。

第二步：选择模板
原生模板广告编辑器提供了全屏模板、横版卡片模板、竖版卡片模板、横幅模板和格子模板 
5 种
画布类型，组合成 
15 种
默认模板可供选择，覆盖多种小程序/小游戏场景。

第三步：编辑模板与完成发布
在这里，你可以对模板中的组件进行适当地编辑，与场景更加匹配。

编辑完成后，点击右上角“完成并发布”，弹出提示广告位 ID 完成创建。

编辑项包含素材区与信息区两个部分，其中：

素材区 - 广告组件中展示广告素材的区域，可对素材类型、初始声音和进度条颜色等进行编辑。

信息区 - 广告组件中展示广告信息的区域，可对广告主头像、名称、文案和转化按钮等进行编辑。

第四步：接入上线
发布后可在“广告位管理”复制广告代码，参考开发文档接入小程序/小游戏，调试完成上线。

备注：已发布的原生模板广告，每次编辑发布后，将覆盖前一个样式，建议明确最终样式修改后再操作。

二、编辑器简介
在介绍如何使用原生模板广告编辑器前，先简单介绍下编辑器各个模块的功能。

① 模板选择区
提供广告模板选择，需注意每次切换模板，之前的编辑记录将被清空。
② 顶部工具区
顶部工具栏以全局设置类功能为主，包括：为广告单元命名，切换预览机型，放大/缩小画布，撤销/重做，恢复默认，完成并发布。
③ 预览区
预览画布会随每次编辑修改而发生变化，方便你实时看到原生模板广告位的样式变化。
④ 编辑区
选择完模板后，画面右侧会出现该模板对应的编辑区，你可以在此处完成模板的个性化编辑。
三、模板简介
全屏模板
适合场景

适用于接入更加开放型页面，如用户停留较久场景、访问频繁场景等
模板数量

目前支持 1 种全屏模板
卡片模板
适合场景

适用于接入更加开放型页面，如用户停留较久场景、访问频繁场景等
模板数量

目前支持 4 种竖版卡片模板和 4 种横版卡片模板
横幅模板
适合场景

适用于更加灵活嵌入的页面，如内容阅读场景、信息列表场景等
模板数量

目前支持 3 种横幅模板
格子模板
适合场景

适用于各类型的页面，如游戏结算页、功能入口场景等
模板数量

目前支持 3 种格子模板
关于小程序原生模板广告形态、调整规范等详细内容，可查看
 《小程序原生模板广告手册》
四、建议指南
体验建议
广告效果与广告的展示位置、样式密切相关，而这两点都是可控的。要获得最为理想的效果，考虑周全的设计和对细节的关注必不可少。在这里，我们提供几个小建议，供你在使用模板时参考：
建议1：让广告成为小程序/小游戏场景的自然组成部分。

在确保广告契合小程序/小游戏场景情况下，但又能够清楚辨识
建议2：让广告内容易于交互。

在不破坏小程序/小游戏布局的前提下，可以考虑使用相对调整画布大小，让广告信息呈现更加明确
建议3：不影响用户体验。

接入广告的流量场景不应该干扰用户正在进行的操作
建议4：可通过 AB Test 测试不同模板效果。

通过 AB Test 测试不同模板样式的效果，提升广告组件的 eCPM
配置建议
建议1：圆角设置

根据小程序/小游戏场景，可适当给广告画布增加圆角。

建议2：按钮颜色

根据小程序/小游戏品牌色，可选择最适合的按钮和进度条颜色。建议按钮和进度条调整为一致颜色。

建议3：视频结束页

在视频播放完毕后，覆盖在视频上广告主信息页面。视频结束页为视频素材配置项，目前支持在 
横版卡片模板
 和 
竖版卡片模板
 上展示。

建议4：模板托管
模板托管，是针对已发布的小程序/小游戏原生模板广告单元，在流量主设置的模板编辑项基础上，由引擎择优展示相同画布类型下的不同模板样式，助流量主省去测试环节，实现更高的
曝光 eCPM
 与
广告收益
。

在为满足开发者同集团小游戏的互导需求，原生模板广告位-矩阵格子模板升级，支持为每个广告单元配置最多 3 条定投的小游戏广告（需限定同结算主体），导流至同集团小游戏。

配置生效期间，定投的小游戏广告将固定展示在指定位置，无需计费，定投广告数据可在广告主投放端查看，实现开发者孵化测试与同集团导流诉求。
一、功能介绍
格子定投功能
小程序/小游戏原生模板广告位-矩阵格子模板支持格子定投功能，每个广告单元支持配置最多 3 条定投广告，不支持重复配置，仅限推广的小游戏与导出小游戏流量主属于同结算主体。

开发者可在编辑器内，对每个定投广告设置固定的展示位置，不得超出矩阵格子模板本身的行数范围。如：矩阵格子模板行数设置为 3，则定投广告可设置位置范围为：行 1~3，列 1~5。

名词解释
导出小游戏：提供流量，导流至其它小游戏。

导入小游戏：从导出小游戏可通过格子定投配置，将用户导流至导入小游戏。
二、操作指引
第一步：创建定投广告-获取 AID
格子定投广告在广告主投放端创建，与常规格子广告创建流程一致。

1） 登录广告主投放端

2） 推广目标与对象：新建推广目标选择“推广小游戏”，输入导入小游戏的原始id。导入小游戏需与导出小游戏流量主属于同结算主体；

3） 投放位置：选择“公众平台流量-按形态投放-横版聚合格子”，进入下一步；

4） 投放时间：建议与互导定投上线时间保持一致，并设置全天投放；

5） 出价方式：出价方式与优化目标，请按照常规广告创建方式完成；

6） 定向人群：地域选择全部，其余定向均不选择；

7） 预算花费：为避免误操作，请设置最低预算 50 元，出价请参考常规广告投放时的选择。

8） 创意内容：默认使用推广的小游戏头像与名称作为广告素材与文案，支持自定义修改。完成创意内容填写，提交审核；

9） 审核通过后，需暂停广告，进行第二步定投配置。

*
请注意在定投期间均保持广告处于暂停状态，避免产生额外花费。
第二步：配置格子定投
格子定投配置，在导出小游戏的流量主MP后台完成。

1） 登录导出小游戏的流量主 MP 后台；

2） 进入“广告管理-广告位管理”，选择“原生模板广告”，找到具体导流的广告单元进行编辑；

*
格子定投配置仅针对“矩阵格子模板”使用。

3） 开启“格子定投”功能，选择对应的生效时间。最长支持 3 个月，过期后定投配置将自动失效；

4） 输入在第一步创建的格子广告 AID，点击校验按钮。校验成功后，可选择具体希望展示的位置；

5） 如需配置多条定投广告，可点击“添加”按钮新增，或删除多余广告；

6） 完成定投配置后，点击右上角“完成并发布”。如提示发布成功，定投配置在 10 分钟内生效；

7） 如需关闭或暂停格子定投，可在编辑器内删除配置的定投广告，或关闭“格子定投”功能。

第三步：数据查看
1） 定投广告的曝光、点击、转化数据，可在广告主投放端查看；

2） 配置定投的该广告单元整体数据，可在导出小游戏的流量主后台查看。
三、注意事项
创建广告
广告审核通过后，需立即暂停，再进入导出小游戏的流量主后台配置定投生效
投放过程中请勿开启广告，避免产生额外花费
请确保广告素材与文案合规，避免定投过程中被驳回下线。如定投配置过程中，格子广告被驳回，则该定投位置将自动由正常格子广告填充，不再展示导入小游戏
定投配置
配置的定投广告 AID 不可重复，且需处于暂停状态，方可校验通过
导出小游戏的流量主结算主体，需与 AID 推广的导入小游戏属于同一结算主体。结算主体信息，可在流量主 MP 后台-财务管理页面查看
一、能力介绍
激励托管是小游戏流量主
用户运营工具
。
基于微信平台及腾讯广告引擎的智能预估能力，帮助开发者在激励广告位实时计算并比较用户的分享与广告互动偏好，
实现「分享获客+广告变现」整体收益最大化
。

激励托管还可通过实时调整预估结果，帮助开发者获取提升游戏收益的最优解。

二、接入流程
1. 打开开关登陆
微信公众平台
，进入“流量主-广告管理-广告位管理”页面，打开需要接入的广告位的激励托管开关。

2. 开发适配根据页面提示，进行产品开发适配，使游戏参与实验的点位根据下发的建议字段展示对应组件。
 第一步
  
阅读提示，按说明对游戏进行调整。

 
第二步
  
打开 “调试模式”开关，进行联调测试。

① 请确保您的基础库版本在
2.24.4及以上
,老的基础库版本可能会存在无法收到下发字段的情况。
② 在测试环境调试时，建议在onLoad函数里直接打印obj，可验证是否能正常收到下发的shareValue和rewardValue两个字段。
点击查看 
激励广告接入文档
3. 数据上报根据页面提示，对所有字段进行数据上报，并发布新版本。游戏发版后，上报生效，进行上报检测。
第一步
  
点击 “上报检测”，进入检测中状态。

第二步
  
上报检测成功后，点击 “下一步”。

注意 ，上报检测失败后，需修改问题并重新发版后再次点击 “上报检测”。

上报示例
1. 外层按钮曝光
场景
行为定义
代码范例
用户来到激励场景，曝光分享按钮
遵从下发的托管建议适配（采用微信策略）
分享按钮按下发策略的曝光数
const result = video.reportShareBehavior({ operation: 1, currentShow: 1, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 1, rewardValue: 0})
用户来到激励场景，曝光分享按钮
未遵从下发的托管建议适配（未采用微信策略）
分享按钮未按下发策略的曝光数
const result = video.reportShareBehavior({ operation: 1, currentShow: 1, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
用户来到激励场景，曝光广告按钮
遵从下发的托管建议适配（采用微信策略）
广告按钮按下发策略的曝光数
const result = video.reportShareBehavior({ operation: 1, currentShow: 0, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 0, rewardValue: 1})
用户来到激励场景，曝光广告按钮
未遵从下发的托管建议适配（未采用微信策略）
广告按钮未按下发策略的曝光数
const result = video.reportShareBehavior({ operation: 1, currentShow: 0, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
2. 外层按钮点击
场景
行为定义
代码范例
分享按钮被点击
遵从下发的托管建议适配（采用微信策略）
分享按钮按下发策略的点击数
const result = video.reportShareBehavior({ operation: 2, currentShow: 1, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 1, rewardValue: 0})
分享按钮被点击
未遵从下发的托管建议适配（未采用微信策略）
分享按钮未按下发策略的点击数
const result = video.reportShareBehavior({ operation: 2, currentShow: 1, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
广告按钮被点击
遵从下发的托管建议适配（采用微信策略）
广告按钮按下发策略的点击数
const result = video.reportShareBehavior({ operation: 2, currentShow: 0, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 0, rewardValue: 1})
广告按钮被点击
未遵从下发的托管建议适配（未采用微信策略）
广告按钮未按下发策略的点击数
const result = video.reportShareBehavior({ operation: 2, currentShow: 0, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
3. 未操作外层按钮直接离开
场景
行为定义
代码范例
分享按钮曝光后未点击，用户离开本场景
遵从下发的托管建议适配（采用微信策略）
分享按钮按下发策略的无效曝光数
const result = video.reportShareBehavior({ operation: 3, currentShow: 1, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 1, rewardValue: 0})
分享按钮曝光后未点击，用户离开本场景
未遵从下发的托管建议适配（未采用微信策略）
分享按钮未按下发策略的无效曝光数
const result = video.reportShareBehavior({ operation: 3, currentShow: 1, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
广告按钮曝光后未点击，用户离开本场景
遵从下发的托管建议适配（采用微信策略）
广告按钮按下发策略的无效曝光数
const result = video.reportShareBehavior({ operation: 3, currentShow: 0, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 0, rewardValue: 1})
广告按钮曝光后未点击，用户离开本场景
未遵从下发的托管建议适配（未采用微信策略）
广告按钮未按下发策略的无效曝光数
const result = video.reportShareBehavior({ operation: 3, currentShow: 0, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
4. 外层按钮点击后操作成功
场景
行为定义
代码范例
分享按钮点击后成功完成分享动作
遵从下发的托管建议适配（采用微信策略）
按下发策略的成功分享数
const result = video.reportShareBehavior({ operation: 4, currentShow: 1, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 1, rewardValue: 0})
分享按钮点击后成功完成分享动作
未遵从下发的托管建议适配（未采用微信策略）
未按下发策略的成功分享数
const result = video.reportShareBehavior({ operation: 4, currentShow: 1, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
广告按钮点击后成功播放完广告
遵从下发的托管建议适配（采用微信策略）
按下发策略的广告成功播放数
const result = video.reportShareBehavior({ operation: 4, currentShow: 0, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 0, rewardValue: 1})
广告按钮点击后成功播放完广告
未遵从下发的托管建议适配（未采用微信策略）
未按下发策略的广告成功播放数
const result = video.reportShareBehavior({ operation: 4, currentShow: 0, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
5. 外层按钮点击后操作失败
场景
行为定义
代码范例
分享按钮点击后未完成分享动作
遵从下发的托管建议适配（采用微信策略）
按下发策略的分享失败数
const result = video.reportShareBehavior({ operation: 5, currentShow: 1, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 1, rewardValue: 0})
分享按钮点击后未完成分享动作
未遵从下发的托管建议适配（未采用微信策略）
未按下发策略的分享失败数
const result = video.reportShareBehavior({ operation: 5, currentShow: 1, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
广告按钮点击后未播放完广告
遵从下发的托管建议适配（采用微信策略）
按下发策略的广告播放失败数
const result = video.reportShareBehavior({ operation: 5, currentShow: 0, strategy: 1, adunit: xxx, sceneID: xxx, shareValue: 0, rewardValue: 1})
广告按钮点击后未播放完广告
未遵从下发的托管建议适配（未采用微信策略）
未按下发策略的广告播放失败数
const result = video.reportShareBehavior({ operation: 5, currentShow: 0, strategy: 0, adunit: xxx, sceneID: xxx, shareValue: 根据实际下发填写未收到统一都填0, rewardValue: 根据实际下发填写未收到统一都填0})
6. 分享进入&分享用户付费
场景
行为定义
代码范例
被分享用户B进入游戏
分享带来用户数
const result = video.reportShareBehavior({ operation: 6, inviteUser: 用户A的openid, adunit: xxx,sceneID: xxx, shareValue: 可以统一都填0, rewardValue: 可以统一都填0})
被分享用户B在游戏中发生付费行为

分享带来付费数 & 金额（单位：元）
const result = video.reportShareBehavior({ operation: 6, inviteUser: 用户A的openid, adunit: xxx,sceneID: xxx, shareValue: 可以统一都填0, rewardValue: 可以统一都填0，depositAmount: xxx})
*
用户A
（分享拉起人）在托管的激励场景xxx，点击分享按钮，将游戏分享给用户B（被分享用户），用户B从分享链接进入该游戏时，进行上报。此时填写的adunit和sceneID均为用户A发起分享的激励场景xxx的信息。
4. 应用比例选择选择流量生效比例，点击后系统开始下发建议，接入流程结束。
首次接入不建议设置“活跃价值”。

* 活跃价值释义详见 “效果回收- 配置活跃价值”。
三、效果回收
查看数据点击 “数据”按钮，查看所有数据。

数据对账
展示平台接收的数据，开发者需与自己记录的日志进行对照。
若数据与自己记录的日志数据无较大差异，则认为数据上报无问题。
*数据对账看板数据源为开发者上报，无二次加工，与数据统计看板的广告数据统计口径不同，广告收入相关数据以数据统计看板为准。

实验数据
展示实验组/对照组数据，便于观察优化效果。若该点位流量设置为全量，则可直接从分点位数据处了解整体数据，此处不再展示。

 *对照组数据为按实验组 “实际生效的实验流量比例”折算后的结果值，可直接用于和实验组的对比。例：产品A实验组实际生效比例为20%，则 页面展示的对照组数据= 对照组实际数据绝对值20%/(1-20%)。
调整应用比例50%流量验证数据正向后，点击 “设置”，可设置流量应用比例为“
全量应用
”。


*若需从全量流量回退至50%流量，需注意对无字段下发请求不要继续调度，以免引发黑屏。
配置活跃价值在设置页面，可以
选择性
地设置活跃价值（支持0~1的两位小数，单位：元）后，点击 “保存”。
适用于除可观测的内购/变现价值外，
认为活跃用户还提供额外不可直接观测价值
的产品。

四、常见问题
接入流程打开开关
Q1：什么样的点位适合使用激励托管能力？
A1：建议在可替换资源点位（即用户可以通过分享或看广告的方式获得奖励的点位）使用。
以棋牌为例：大转盘、登录签到、分享/变现领礼包、金币余额不足后提示、开局得金币、对局输了后复活等；
以休闲为例：大转盘、登录签到、领体力等。
Q2：如果打开能力开关后，将开关关停一段时间，再重新打开开关，是否还需要重新走接入流程？
A2：是的。
Q3：如果打开能力开关后，将开关关停，那么原来的实验数据是否会清零？
A3：不会。
开发适配
Q1
：
了解到可以通过onLoad函数获取到下发字段，但如果第一次onLoad返回的是分享，需要如何触发下一次的onLoad来获取下一次的调度呢？
A1：建议在场景需要时，先destroy原来创建的激励广告，再new一个激励广告。需要注意，这里的new是指调用wx.createRewardedVideoAd。Create后需要拿新的video来重新绑定onLoad，onError，同时create的参数加上multiton:true。
Q2：如果destroy后再重新new一个激励视频广告，onLoad也没有执行返回字段，应该如何处理？
A2：理论上会onLoad，例外情况是广告拉不出来（返回1004错误码)，这样不会onLoad，会直接onError。
Q3：如果采用上述方式有removeTextView的报错，是否有影响？
A3：无影响。在createRewardedVideoAd还没有完成的时候，调用destroy去清楚该对象会导致报错。在onLoad完成后再去destroy都不会有类似报错。当前广告组件暂时没有对这种用法进行保护，后续我们会考虑优化。
Q4：按照上述做法，如果测试开发人员还没有收到预期下发的shareValue和rewardValue字段，应该如何排查？
A4：建议使用2个及以上测试人员微信号进行联调测试。
 数据上报
Q1：哪些operation应该上报
？
A1：所有operation均为必填。
Q2：如何确认是否上报成功
？
A2：以上调用会返回调用结果 result，其中 success 代表是否上报成功，如果上报失败，可参考 message 排查失败原因，如：{"success":true,"message":"上报成功"}{"success":false,"message":"分享推荐值 shareValue 不可为空"} 。
Q3：如何确认上报数据是否准确
？
A3：数据上报成功后，可在“广告位管理-对应点位[数据]-数据对账” 查看数据上报日志，并与自行记录数据进行对账。
Q4：50%流量实验下，能否不回传对照组数据
？
A4：不能，50%流量实验结果需依照实验组和对照组的数据比较得出结论，若不回传对照组，则无参考系。
 应用比例选择
Q1：如何判断应该选哪种流量比例
？
A1：每个产品每个点位初次使用，建议优先选择50%流量，观察3-7天数据，评估实验组数据正向后，再操作切换为全量。
Q2：“50%流量”是如何切分的？实验组和对照组如何定义？
A2：系统对用户进行随机分桶，并对其中50%的流量下发shareValue和rewardValue字段，带这两种字段的流量即为实验组，否则为对照组。
Q3：选择50%流量应用后，需要我们做什么适配？
A3：建议开发者对下发shareValue和rewardValue字段的用户，按照下发的字段展示对应组件；对于不下发字段的用户按照游戏原有运营逻辑，展示分享或广告。
Q4：我们能否在50%流量的基础上，自行再切分流量，缩小生效比例
？
A4：一般不建议开发者自行二次切分流量，以免实验数据不置信；若有特殊需要，自行切分流量后，实验数据页面会展示实验组实际生效比例，对照组数据按实验组生效比例折算。
效果回收查看数据
Q1：数据对账模块多久可以出数据
？
A1：一般3小时内会展示数据。
Q2：50%实验下，怎么评估实验组、对照组数据
？
A2：虽然实验组默认下发50%流量含字段，但实际实验组生效比例往往并非50%整。为便于开发者评估数据，我们将对照组所有数据按实验组生效比例，折合为对照组与实验组 曝光人数1:1后数据（对照组数据均 × 实验组生效比例/(1-实验组生效比例)。
若实验组的总收入＞对照组，则认为实验组效果更优。建议
以7日收入数据为准
，通过长期价值变化判断效果，
例：实验组曝光人数=3，对照组曝光人数=5，实验组广告变现金额=5元，对照组原始广告变现金额=4元，则实验组生效比例=3/(3+5)=37.5%。报表中实际展示的对照组广告变现金额= 4*37.5%/(1-37.5%)=2.4元。
Q3：一般能力应用多久后，实验结果可置信
？
A3：一般需要测试3-7天以上，再评估实验结果。
调整应用比例
Q1：什么情况下建议由50%流量改为全量
？
A1：测试3-7天后，若实验组收入大于对照组，且开发者评估游戏整体数据变化符合预期，则可调整为全量。
Q2：调整流量比例后，多久生效？
A2：预计1小时内生效。
配置活跃价值
Q1：活跃价值一般设置多高？
A1：建议开发者持续调整价值额度，每次观察1-2天，直至“实验组分享带来用户量 ” 达到开发者预期。常见范围为0.3~0.7元。
Q2：活跃价值设置后多久生效
？
A2：一般1小时内生效。
`,
  240: `1. 流量主可在“数据统计”页的”广告数据“板块，分广告位查看每日的曝光量、点击量以及收入数据。

2. 流量主可在“数据统计”页的“用户数据-趋势看板”板块，查看广告组件各关键指标的环/同比趋势幅度

3. 流量主可在“数据统计”页的“用户数据-用户价值看板”板块，查看小游戏内用户不同拆解维度下的数据趋势图及对比数据

4. 流量主可在“数据统计”页的“用户数据-数据报表”板块，对小游戏内的广告用户，拆解画像维度数据进行查看。

5. 流量主可在“财务管理”页的“收入数据”板块，查看分广告位分日收入明细数据。


更多小游戏深度数据分析工具，欢迎体验【商业化工具箱】`,
  239: `一、违规行为定义
小程序（含小游戏类目，下同）流量主违规行为是指小程序流量主使用微信广告平台展示服务时违反法律法规规定、
《微信公众平台服务协议》
《微信平台广告展示服务协议》
等广告展示服务相关的协议、规定、规范性文件等的相关行为。
二、违规处罚类型
对于广告展示违规行为，腾讯有权单方视情节轻重对流量主账户采取如下一项或多项措施：
警告：
腾讯向流量主发出系统警告通知，并要求流量主限时整改；
驳回：
暂停流量主广告组件的展示能力，流量主按规范整改后可重新提交；
冻结账号操作权限：
暂时关闭流量主账号的广告展示相关权限，无法展示任何广告内容。期间允许流量主登录微信公众平台广告展示服务管理界面，但无法进行任何操作，不能使用广告展示服务，不产生广告展示收入。冻结解除后，流量主操作恢复广告展示，可以就恢复后的广告展示获得收入新增；
终止账号的广告展示服务：
永久关闭流量主账号的广告展示相关权限。终止后，流量主不能再使用广告展示服务；
扣除广告展示收入：
扣取流量主账号的未结算展示收入作为违约金。为维护广告主权益，腾讯有权将扣除的展示收入用于处理纠纷及赔偿损失，若不足，腾讯有权进一步向流量主追偿；
同一收款主体（同一自然人或同一公司主体，下同）下的流量主账户违规记录达到一定数量的（具体以微信广告单方确定为准），微信广告有权视其违规情节严重程度及影响程度，自行决定暂停该收款主体的流量主申请资格（即暂停以该自然人或公司主体注册的全部小程序的流量主申请），以及冻结该收款主体下所有流量主账号的操作权限，并将该收款主体下所有流量主账号的全部未结算的广告展示收入作为违约金进行扣罚。
三、违规行为分类
1. 一级违规
1.1 违反国家法律法规
发布谣言或含有政治、色情、赌博、毒品、侵权、虚假信息等违法信息的内容。包括但不限于流量主账号名称，或账号内发布的内容存在危害国家安全、敏感政治、淫秽、色情（色情擦边、性暗示等）、毒品、赌博、虚假、谣言、侮辱、诽谤、恐吓或骚扰、低俗、侵犯他人知识产权或人身权或其他合法权益、可能对他人/企业或其他机构造成损害的内容等违法违规信息。
1.2 违反
微信小程序平台运营规范
流量主因违反微信小程序平台运营规范，账号被永久封禁或注销。
1.3 刷开通
流量主的账号为利用第三方运营平台、外挂软件等方式，通过刷访问用户数量得以开通的情况的，包括僵尸用户刷量、漏洞刷量、外挂软件刷量等。
一级违规处罚手段
一经发现，终止流量主账号的广告展示服务，并扣除未结算的全部广告展示收入作为违约金。
2. 二级违规
2.1 恶意作弊行为
2.1.1 通过技术手段制造虚假流量，伪造曝光、点击、效果数据等；
2.1.2 自行或委托第三方反复手动产生曝光、点击、效果数据等；
2.1.3 通过外部渠道恶意引导用户点击广告，产生效果数据。
2.2 恶意对抗行为
通过使用地域/机型/人群/时间屏蔽等技术手段绕开平台审核等恶意广告作弊行为。
2.3 强制点击
以广告位阻断用户正常使用相关互联网服务的流程，强制将广告作为相关服务的页面出口要求用户点击，例如所有运营内容都只能通过观看激励视频广告才能解锁等。
2.4 诱骗点击
包含但不限于通过移动banner广告、高频点击后突然出现广告、用户无广告播放预期等行为，导致用户误点击广告。
2.5 恶意篡改样式
包含但不限于修改广告组件透明度、样式等行为，导致用户误点击广告。
2.6 激励视频无点击播放
通过技术手段在无用户点击的情况下播放激励视频广告。
2.7 非正常手段拉取广告导致误点
包含但不限于通过技术手段在无用户预期的情况下拉取广告，导致用户误点广告的行为。
二级违规处罚手段
（1）针对2.1：
①首次发现，冻结流量主账号的操作权限30天，并扣除全部未结算的广告展示收入作为违约金；
②第二次发现，终止流量主账号的广告展示服务，并扣除全部未结算的广告展示收入作为违约金。
（2）针对2.2-2.7：
前两次驳回广告组件，扣除流量主账号的全部未结算收入作为违约金。第三次冻结账号操作权限30天，扣除账号的全部未结算收入作为违约金；第四次终止账号广告展示服务，扣除账号的全部未结算收入作为违约金。
3. 三级违规
3.1 滥用广告组件
3.1.1 流量主通过非官方提供的开发能力，使广告位主动触发素材刷新；
3.1.2 激励视频广告入口的描述未明确说明广告播放的预期；
3.1.3 激励视频广告未完全播放（提前关闭），流量主照常下发奖励；
3.1.4 激励视频广告播放后未下发所承诺的奖励；
3.1.5 点击激励视频广告后，人为控制视频播放的时间（包括但不限于延后播放）；
3.1.6 流量主在小程序内设计广告的关闭逻辑，包括但不限于：付费免广告、广告关闭按钮等；
3.1.7 流量主在单屏内容里展示两个及以上banner、原生广告位、视频前贴、视频广告位等；
3.1.8 流量主使广告位无规则悬浮等；
3.2 误导点击
3.2.1 使用包括但不限于按钮、图片、文字等内容遮挡广告位，易造成用户误点击；
3.2.2 广告区域与页面内容（尤其是可点击区域）无间距相连，易造成用户误点击；
3.2.3 包含但不限于使用微信官方logo充当用户头像发表评论、模仿官方消息通知、模仿红包样式等方式模仿官方广告位样式，给用户带来误导性的点击预期。
3.3 诱导点击
流量主在账号内可控的位置，通过明示或暗示的方式诱导用户反复访问、点击广告。
三级违规处罚手段
前两次驳回广告组件，从第三次起依次冻结帐号操作权限1天、7天、15天、30天、90天、终止账号广告展示服务。从冻结账号操作权限30天开始，每次处罚均扣除账号的未结算收入。
4. 四级违规
4.1 违反
微信小程序平台运营规范
流量主账号因违反微信小程序平台运营规范被暂时封号/封禁广告相关能力。
四级违规处罚手段
依据平台处罚天数，同等冻结流量主账号的广告操作权限，冻结期间不扣除广告展示收入。
5. 其他违规
5.1 不正当获取流量
流量主通过违法违规等不正常手段获取流量，包括但不限于发布违法违规内容以获取流量、产生广告收益等情况。
其他违规处罚手段
一经发现，终止流量主广告展示服务。
四、附则
本细则是微信公众平台广告展示服务规则，属于
《微信平台广告展示服务协议》
有效组成部分，腾讯有权根据自身运营管理需要更新本细则，上述更新一经正式发布，流量主即应遵守。
在本细则中未作明确的广告展示违规行为，腾讯有权根据
《微信公众平台服务协议》
《微信平台广告展示服务协议》
《微信小程序平台运营规范》
等协议、规则进行处理。`,
  241: `一、 功能入口
【
微信广告投放平台
】-【统计】-【商业化工具箱】-【广告变现分析】进入。

二、 使用指引
开发者在上方筛选栏选择要预估的注册日期、注册渠道、生命周期、变现广告位，可生成下方2个看板。
注：渠道包括“全部”及20个独立重点渠道分析。当选择“微信广告”渠道时，可以进一步筛选买量广告位。
1、数据趋势：
选择2个核心数据指标，对比查看它们在所选数据时段、所选注册渠道和广告位之下的的数据趋势变化图。常用来观察留存用户的时长、人均观看广告次数和eCPM的变化，以此调整留存用户的广告设定。

 2、数据明细：
查看所筛选时段和注册渠道内，注册用户的行为数据指标明细。也可以下载表格。
指标包括：注册用户留存人数、注册用户留存率、人均在线时长（秒）、人均启动次数、人均观看广告次数、eCPM。

一、 功能入口
【
微信广告投放平台
】-【统计】-【商业化工具箱】-【增长ROI分析】进入。

二、 使用指引
开发者在上方筛选栏选择要预估的注册时间段、注册渠道、变现广告位，可生成下方4个看板。
注：渠道包括“全部”及20个独立重点渠道分析。当选择“微信广告”渠道时，可以进一步筛选买量广告位。

1、数据趋势
选择2个核心数据指标，对比查看它们在所选时段，所选注册渠道和广告位之下的的数据趋势变化图。


2、首日数据明细
可查看所筛选时段和注册渠道内新增的注册用户每天的变现数据明细。也可以下载表格。

3、用户留存跟踪
可查看所筛选时段和注册渠道内每天渠道新增用户持续30天的留存数据明细。小游戏流量主可以自主配置 列表展示的数据指标，也可以下载表格。
注：可选数据指标包括：注册人数/留存率、次日留存人数/留存率、3日留存人数/留存率、4日留存人数/留存率、5日留存人数/留存率、6日留存人数/留存率、7日留存人数/留 存率、14日留存人数/留存率、30日留存人数/留存率、45日留存人数/留存率、60日留存人数/留存率、75日留存人数/留存率、90日留存人数/留存率。


4、用户变现跟踪&ROI（投资回报率）跟踪
- 开发者筛选渠道为
微信广告
时，展示“
ROI (投资回报率) 跟踪
”。可以查看所筛选时段内，每日微信广告渠道新增用户持续30天的ROI数据明细。小游戏流量主可以自主配置列表展示的数据指标，也可以下载表格。
注：可选数据指标包括：广告变现累计ROI（首日、次日、3日、4日、5日、6日、7日、14日、30日、45日、60日、75日、90日）、内购付费累计ROI（首日、次日、3日、4日、5日、6日、7日、14日、30日、45日、60日、75日、90日）、总累计ROI（首日、次日、3日、4日、5日、6日、7日、14日、30日、45日、60日、75日、90日）

- 开发者筛选渠道为
非微信广告
时，展示“
用户变现跟踪
”。可以查看所筛选时段内，每日微信广告渠道新增用户持续30天的变现数据。小游戏流量主可以自主配置列表展示的数据指标，也可以下载表格。
注：可选数据指标包括：广告变现累计ROI（首日、次日、3日、4日、5日、6日、7日、14日、30日、45日、60日、75日、90日）、内购付费累计ROI（首日、次日、3日、4日、5日、6日、7日、14日、30日、45日、60日、75日、90日）、总累计ROI（首日、次日、3日、4日、5日、6日、7日、14日、30日、45日、60日、75日、90日）

一、 功能入口
页面主入口：
【
微信广告投放平台
】-【统计】-【商业化工具箱】-【买量用户分析】。

2.联动入口：
【增长ROI分析】【广告价值分析】页面中，均可通过点击数据表中的“查看”入口进入买量用户分析。

二、 使用指引
1、画像概览：
可查看人群的TOP属性和对应占比，了解人群的主要特点。

2、画像细分：
可查看人群具体的分布情况和具体数量。

3、用户分布：
可拆解对比ROI、留存、CPA、ARPU等数值。根据不同人群的特征来设计买量的预算、CPA、首日ROI等目标，
制定更细化的投放策略
。

三、 注意事项
1、当前用户画像分析仅支持注册渠道来源于【微信广告】的用户。
2、历史数据回溯至7月1日。


一、 功能入口
【
微信广告投放平台
】-【统计】-【商业化工具箱】-【增长ROI分析】进入。

二、 使用指引
开发者在上方筛选栏选择要预估的投放时间段，以及要预估的买量广告位，可生成下方两看板。
1、ROI趋势：
14日、30日的分变现模式的预估ROI数据。
计算口径：以首日ROI举例，分子为所选时间段买量用户首日收入之和，分母为所选时间段买量消耗之和。

2、ROI明细：
14日、30日的分变现模式、汇总与分天的预估ROI数据明细，提供下载。

三、 注意事项
1、时间可选范围：
最早可往前倒推30日，最晚可往前倒推7天。
2、置信度问题：
为了预估结果足够置信，建议可多选一些日期（至少7个有投放的日期），投放获量用户数与预估准确率成正比。当数据预估不准确时，系统会给到开发者提示。此外，预估数据仅供参考，请结合实际流量环境、版本情况及时调整投放策略。
一、 功能入口
【
微信广告投放平台
】-【统计】-【商业化工具箱】-【买量用户分析】进入。

二、 使用指引
步骤：投放激励视频广告（得到广告ID） → 输入广告ID → 得到结果（见下方） → 选择&优化玩法
ps：不同广告获取的用户将体验不同玩法的游戏版本，以实现测试目的。广告用户和游戏版本的关联方式 见末尾附录。
1、玩法数据对比：
对比不同广告代表玩法的关键数据，以进行玩法择优，推荐开发者核心关注留存数据。

2、行业标杆次日留存对比：
择优后的玩法并不一定代表合格，这里我们提供了行业标杆以作参考。如果表现较好的玩法与行业标杆仍有较大差距，建议在较好玩法的基础上进行进一步的玩法调整。为辅助玩法调优，下方我们还提供了辅助调优的互动行为分析看板。

3、互动行为分析：
提供广告视频点击分析，以及流失分析，建议开发者关注用户的注意力集中点和兴趣流失点，通过放大优势、减少劣势来调整玩法。
- 点击行为：用户在视频播放过程中出现点击行为，可能代表用户受视频内容吸引；在视频播放结束后（已获得激励）出现点击行为，可能代表用户对游戏整体玩法接受度较高。
- 流失行为：用户在视频播放过程中尝试退出，可能代表用户对视频内容无感；在视频播放结束后（已获得激励）退出，可能代表用户对游戏整体玩法接受度不高。

4、次日留存用户群画像洞察：
关注游戏核心用户的数据表现，适时调整后续的玩法设定以及投放买量策略。

备注：
1、用户来源：
只支持买量渠道。对于玩法评估，推荐用买量渠道的新用户，因为新用户的数据最为准确，且买量渠道获取用户最稳定。
2、可分析素材：
只支持激励视频。视频是最能完整展现游戏玩法的形式，且激励视频的用户留存数据最为置信，因此选择该位置。


附：如何实现不同广告获取的用户体验不同玩法游戏
1、在游戏代码设置路径a，控制路径a的用户为游戏逻辑1。
2、投放端投放广告时，最后一步将路径参数a录入，可控制广告1买到的用户，进入的是路径a。

`,
  242: `一、 规则说明
为帮助小游戏流量主更好地扩大规模、获得更高广告收益，自2020年11月起实行流量主广告金激励计划，对特定渠道注册用户予以40%广告金激励，即部分流量主相当于最高可获得90%的实际分成。 常规情况下，流量主广告金每半月结算一次，并在第二个月的对应时段入账。 小游戏流量主广告金激励计划详细规则
二、 使用指引
1. 小游戏流量主可在“财务管理”页的“小游戏广告金”板块，查询广告金结算情况和转出使用广告金。

2. 小游戏流量主可在每笔广告金结算信息中查看对应的金额、有效期截止时间。未在有效期前消耗的广告金将过期不再可用。也可以在广告金激励用户表中查看激励用户数、广告流水及广告金金额等信息。


3. 小游戏流量主广告金支持转出至同结算主体下的广告主账户或服务商子客账户。正常情况下转出金额将实时到账（若遇到账异常，可联系“微信广告助手”反馈）；可在
微信广告投放平台
广告主账户查看“充值记录”，该笔广告金将记入“抵用金”账户中，在投放非合约广告时自动抵用。

三、 注意事项
1. 可转入流量主广告金的账户类型
A：必须同时满足以下条件：
是
微信广告投放平台
小游戏广告主账户
该小游戏与转出小游戏的结算主体相同
该小游戏已开通流量主功能
2. 账户同时有多笔流量主广告金时的消耗顺序
A：当广告主账户内转入了多笔流量主广告金时，将优先消耗有效期截止时间更近的。`,
  79: `腾讯生态内容创作者的商业服务平台
，为公众号、视频号创作者提供提供
商机丰富
、
交易可靠
、
收益稳定
的官方平台服务。
优势一：内容合作官方入口，丰富商单资源
连接腾讯广告百万广告主，助力创作者产出更多优质内容，提升商业价值。
优势二：优质社交流量，变现收益高
国民社交 App 连接亿万用户，海量真实社交传播，提升内容“出圈”速度；创作者高分成比例，让创意变成看得见的收益。
优势三：平台担保机制，保障交易安全性
从创作者接单到内容发布完成，全流程保护创作者权益。

优势四：组件能力丰富，变现方式灵活
专属商业化产品，提升创作者接单能力。为互选平台的视频号创作者提供专属组件能力，满足收集销售线索、推广应用、推广小游戏、推广品牌活动等主流广告营销诉求。

加入我们
腾讯广告互选平台面向创作者和 MCN 机构持续招募中，欢迎与我们取得联系。
我是 
公众号创作者
我是 
视频号创作者
我是 
MCN 机构、代理商`,
  10: `一、财务资料
1. 收款规则
基本定义
收款账户：流量主填写广告收入的收款银行账户名称，可能是公司名称或者个人姓名。
开户主体：公众号及小程序注册时填写的主体名称，可能是公司名称或者个人姓名。
收款类型
个人主体：支持主体收款、委托第三方个人收款、委托第三方企业收款
企业主体：支持主体收款、委托第三方企业收款、委托个人收款（仅支持个体工商户和已注销企业-个体工商户可由经营者代收；已注销企业可由指定权利义务继受人代收）

温馨提示：
媒体、政府、企业、其他等非个人类型帐号不支持委托个人收款。
个体工商户和已注销的企业可委托个人账户收款，个体工商户可由经营者代收，已注销企业可由指定权利义务继受人代收。
若不同开户主体的帐号委托同一个收款账户，最多支持关联50个帐号开户主体。

账户变更
若流量主收款账户或邮箱发生变更，可在公众平台自助提交修改申请，提交完成后，后台审核通过即完成修改，结算信息页面也会展示修改完成后的部分信息。
修改流程如下： 登陆微信公众平台，进入流量主模块，在“财务管理”-“收入结算”页面的“结算信息”板块，点击“修改”按钮进入结算信息变更页面。

变更规则
个人账户收款：支持只变更银行账号、变更其他个人账户收款、变更其他企业账户收款
企业账户收款：支持只变更银行账号、变更其他企业账户收款、变更个人账户收款（仅支持个体工商户和已注销企业-个体工商户可由经营者代收；已注销企业可由指定权利义务继受人代收）

温馨提示
个人主体的帐号委托企业账户收款后，不支持改为主体或其他个人账户收款。
使用同一结算主体的流量主帐号，修改其中一个帐号的结算信息后，名下所有帐号的结算信息会同步更新，系统会以最新修改完成的信息为准。
若委托第三方收款，第三方结算主体已提交过结算信息，新委托的帐号需提交与已提交过的结算信息一致的信息。
若是委托收款的，当银行账户信息发生变更时，需提交新的委托收款协议。
2. 结算信息要求
使用同一个结算主体的流量主帐号，须提交同一个的银行账户（如：账户名、开户行、开户支行、开户省市、银行账号）、营业执照及结算邮箱。
3. 审核
提交结算信息后，审核结果将在 7 个工作日内反馈。

注：工作日不包含周末及节假日，如遇周末或节假日暂不处理，顺延至下一个工作日。
二、收入结算
1. 结算规则
腾讯公司将在次月 1 日和次月 15 日前（如遇法定节假日，将会推迟），分别对上半月和下半月收入进行结算，并在结算完成后3个工作日内，发送结算单到你的结算单邮箱中。

例如：12 月 1 日结算 11 月 1 日- 15 日的收入，12 月 15 日结算 11 月 16 日- 11 月 30 日的收入。

若你是企业用户，需要按结算单邮件的要求邮寄与结算金额等额的增值税专用发票给腾讯公司。腾讯公司将在收到正确的发票及结算单后30 个工作日内将结算金额打入你的结算银行账户。

若你是个人用户，无需邮寄发票，腾讯公司将为你代扣代缴个税，并接受税务局委托，代征增值税和附加税费，在结算日后 15 个工作日内将最终结算金额打入你的银行卡。
2. 结算流程
一次结算会依次经历四个结算状态：结算中、已结算、付款中、已付款。
结算中：腾讯公司会在此阶段核验结算信息，并在核验完成后准备结算单。
已结算：进入此阶段，表明结算单已出具并发送至流量主的结算单邮箱，若未收到，可申请补发。若为企业结算主体，请按结算单的实际收入金额开具发票，并邮寄发票和结算单至指定地址；腾讯公司将核验发票信息，确认无误后进入付款流程。
付款中：进入此阶段，表明发票已核验完成，款项支付中。
已付款：进入此阶段，表明款项已付出；各银行具体到账时间有差异，一般在 1-3 个工作日内到账。
三、企业开票
1. 开票规则
企业账号需要按结算单的实际收入金额开具增值税专用发票，与结算单一并邮寄至腾讯指定地址。
2. 需邮寄的资料
增值税专用发票发票联及抵扣联，须加盖公司发票专用章。

与发票对应月份的结算单，须加盖公司公章。
3. 收件信息
收件单位：腾讯成都BPO中心

地址：四川省成都市高新区天府大道中段1366号天府软件园E5栋9楼

邮编：610041

收件人：施进燕

联系电话： (+86) 028-85225111

注：本电话只用于发票接收，其他流量主问题请咨询公众号“微信广告助手（ad_helper）”。
4. 开票信息
2020 年 6 月起，腾讯公司与流量主的合作主体由“深圳市腾讯计算机系统有限公司”变更为“腾讯科技（深圳）有限公司”。建议在开具发票时，参考
当月结算单展示的腾讯公司名称
，再开具相应信息的发票。
信息变更前（ 2020 年 5 月及以前）
公司名称：深圳市腾讯计算机系统有限公司
发票类型：增值税专用发票
纳税人识别号：91440300708461136T
开户行及账号：招商银行深圳汉京中心支行 817282299610001
开票地址电话：深圳市南山区粤海街道麻岭社区科技中一路腾讯大厦35层 0755-86013388
货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
信息变更后（ 2020 年 6 月及以后）
公司名称：腾讯科技（深圳）有限公司
发票类型：增值税专用发票
纳税人识别号：9144030071526726XG
开户行及账号：招商银行深圳汉京中心支行 817281823910001
开票地址电话：深圳市南山区高新区科技中一路腾讯大厦35层 0755-86013388
货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
四、个人缴税
1. 个税说明
个人账号无需邮寄发票，个人账户的收入属个人劳动报酬，根据《中华人民共和国税收征收管理法》及其实施细则等税收有关规定，腾讯公司从 2019 年 11 月 1 日起接受税务机关委托，为个人流量主代征增值税和附加税。
2. 增值税及附加税费计算方法
每次劳务收入超过 500 元（包含本数），腾讯代征 3% 的增值税，并按照增值税应纳税额代征附加税费，适用综合税率为 6%（即，按照一般综合税率 12%，实行减半征收）。如因税法或税局征管要求调整，需要更改上述规则的，腾讯公司会另行通知。
增值税应纳税额 = 劳务报酬（大于等于500元）/(1+3%) × 3%
附加税费应纳税额 = 增值税应纳税额 × 6%
3. 个人所得税计算方法
1）应纳税所得额的计算

劳务报酬所得以个人当月取得的同一项目下的多次收入合并为每次收入所得，定额或定率减除规定费用后的余额为应纳税所得额。

每次收入不超过 4000 元的，定额减除费用 800 元；每次收入在 4000 元以上的，定率减除 20% 的费用。
应纳税所得额 = 劳务报酬（少于4000元）- 800 元
应纳税所得额 = 劳务报酬（超过4000元）×（1 - 20%）
2）应纳税额的计算

应纳税额 = 应纳所得税额 × 适用税率 - 速算扣除数

劳务报酬所得适用超额累进税率，累进税率分别为 20%、30% 和 40%，即：纳税人每次劳务报酬所得的应纳税所得额不超过 20000 元的部分，适用 20% 的税率；超过 20000 元至 50000 元的部分，适用 30% 的税率；超过 50000 元的部分，适用 40% 的税率。

具体可以参考以下税率表：

案例一：A 流量主当月收入为 400 元，则

该流量主收入少于 500 元，腾讯公司不代征增值税和附加税费。

且该收入扣减 800 后，个税的应纳税所得额为 0，则腾讯公司不代扣代缴个税
案例二：A 流量主当月收入为 800 元，则

增值税应纳税额 = 800 / (1+3%) × 3% = 23.3 元

附加税费应纳税额 = 23.3 × 6% = 1.4 元

流量主在扣除增值税、附加税费以及 800 后，个税的应纳税所得额为 0，则腾讯公司不代扣代缴个税

因此腾讯公司代征增值税 23.3元，代征附加税费 1.4 元，不代扣代缴个税
案例三：B 流量主当月收入为 3090 元，则

增值税应纳税额 = 3090 / (1+3%) × 3% = 90 元

附加税费应纳税额 = 90 × 6% = 5.4 元

个税应纳税所得额=3090 - 90 - 5.4 -800 =2194.6 元

个税应纳税额 = 2194.6 × 20%=438.92 元

因此腾讯公司代征增值税90元，代征附加税费 5.4 元，代扣代缴个税438.92 元
案例四：C 流量主当月收入为 10300 元，则

增值税应纳税额 = 10300 / (1+3%) × 3% = 300 元

附加税费应纳税额 = 300 × 6% = 18元

个税应纳税所得额=（10300-300-18）×（1-20%）= 7985.6元

个税应纳税额 = 7985.6 × 20%=1597.12元

因此腾讯公司代征增值税300元，代征附加税费18元，代扣代缴个税1597.12元
案例五：D 流量主当月收入为 82400 元，则

增值税应纳税额 = 82400 / (1+3%) × 3% = 2400 元

附加税费应纳税额 = 2400 × 6% = 144元

个税应纳税所得额 =（82400-2400-144）×（1-20%）= 63884.8 元

个税应纳税额 = 63884.8 × 40% - 7000 =18553.92 元

因此腾讯公司代征增值税 2400 元，代征附加税费 144 元，代扣代缴个税 18553.92 元
4. 
你
的义务
你需自行履行年底个人所得税综合申报义务，以及自行承担个税税款的多退少补，你个税税款的调整或其他相关税费的缴纳（如有）与腾讯公司无关。
5. 关于代征税款的公告
根据《中华人民共和国税收征收管理法》及其实施细则等税收有关规定（以下简称“税收政策规定”），本公司受税务机关委托，对通过本公司获取劳务收入（包括劳务报酬、稿酬支出、特许权使用费等）发生应税项目的个人（以下简称“纳税人”），代征纳税人所获取劳务收入应缴纳的增值税、城市维护建设税、教育费附加及地方教育费附加，计税依据及税率按照相关税收政策规定执行。除此之外的税费代扣代缴以及结算事宜仍按照相关合同约定执行，纳税人需按照税收政策规定履行其纳税相关义务，以及自行承担补缴或退还的相关税款，税务机关对于纳税人税款的调整与腾讯公司无关。 该公告自 2019 年 11 月 1 日起执行。`,
  5: `一、广告数据接口
现已向所有成为流量主的公众号运营者开放数据接口。通过数据接口，流量主可以无需进入流量主后台，向接口发起请求，即可获取与公众平台官网统计模块类似但更灵活的数据，包括但不限于广告位曝光量、点击量、收入等。获取数据后，还可根据需要进行高级处理。
接口名称与用途对应如下：
publisher_adpos_general：获取公众号广告汇总数据 
publisher_cps_general：获取公众号返佣商品数据 
publisher_settlement：获取公众号结算收入数据及结算主体信息
详细指引，请参阅：广告分析接口说明 
公众号
、
小程序
、
小游戏
。
二、公众号推送消息
流量主可在“账户设置”页面添加微信号，扫码后即可绑定推送消息。
绑定后，可以通过微信广告助手公众号接收广告收入数据日报、财务资料审核结果、流量主违规通知、公众号互选广告通知等，建议绑定。
三、流量主服务助手小程序
流量主可以扫码使用“流量主服务助手”小程序，在手机端查看收入数据。
`,
  144: `一、优选计划介绍
面向广大微信小游戏开发者，提供推广与变现一站式合作计划，帮助其在微信生态实现规模化，让优质小游戏遇见更多游戏用户。

参与路径：小游戏开发者点击“流量主 – 合作计划”即可参与优选计划；
合作流程：报名初筛——游戏测试——签约合作——规模化推广。
分成政策：参与合作的小游戏开发者可获得优选收入的 20% 分成。
二、合作优势
两项服务
变现服务：针对合作游戏提供定制化的广告变现解决方案，包括广告场景的植入和广告产值的优化。

推广服务：微信流量生态内的提供定制化推广解决方案，同时整合腾讯广告全域流量资源，如优量汇、腾讯新闻、腾讯视频等优质流量资源，丰富流量获取渠道。
三项保障
成本保障：结合平台数据优势定制推广策略，优选买量渠道，实现最低成本买量。

效益保障：将进行数据共享，帮助开发者实现用户颗粒度的精细化变现运营。

规模保障：提供人力及财力支持，最大化实现游戏规模化。
三、合作流程
合作报名：
登录
微信公众平台
，进入“流量主-合作计划”页面，进行报名。
自主测试：
进行买量投放测试。
数据审核
：近30日有数据片段符合准入门槛要求后，在“流量主-合作计划"页面提交数据，进行审核。
签约合作
：提交审核后3个工作日内完成审核及反馈。
`,
  145: `
微信广告目前已面向公众号、小程序、小游戏提供分场景广告变现解决方案。具体可查看以下文档：
公众号流量变现解决方案
内容类小程序流量变现解决方案
工具类小程序流量变现解决方案
小游戏流量变现解决方案
`,
  80: `公众号广告管理
介绍公众号广告位开闭规则、广告位设置等信息
底部、文中和互选广告的优先级关系若流量主同时开启底部广告、文中广告和公众号互选广告，有以下两种情况：
对于有公众号互选广告合作的文章，展示公众号互选广告的广告宣传语及广告位，不出现底部广告位和文中广告位；
对于无公众号互选广告合作的文章，正常展现底部广告位和文中广告位。
文中广告的插入方式每篇文章都可以在编辑器独立设置文中广告，无需通过开闭文中广告位来控制是否展示。
流量主可以选择手动插入或智能插入。无论何种方式，都应保证卡片前后满300个字符，否则将插入失败。
若选择手动插入，流量主可以自由选择插入广告的位置；
若选择智能插入，系统会自动识别合适的位置并插入广告，建议流量主根据实际情况优先选择智能插入。
文中广告的类目设置文中广告支持为每篇文章独立设置广告展示的类目，如“电商平台”、“旅游”、“教育”等。设置类目后，系统将匹配对应品类的广告进行展示。
类目设置与收入的关系建议放宽品类选择范围，以最大程度保障收入。
文中广告部分类目下可展示的广告数量可能较少，在所选品类较为单一的情况下，可能存在没有合适广告而不展示广告的情况。
返佣商品的插入方式在编辑文章时，可从编辑器选择商品插入。请注意查看商品的单价和佣金比例，只有插入有佣金的商品，才会获得返佣。
具体可见：
返佣商品指引文档
。
小程序/小游戏广告管理
设置小程序/小游戏广告组件须知
正式版本无法显示广告的原因为方便开发者测试广告组件，开发版和体验版的小程序/小游戏没有拉取广告的限制。
正式上线后，广告组件拉取广告时会受到广告策略影响，广告平台会为当前用户推荐最适合展示的广告，当前无合适广告即不会展示，因此用户可能出现广告拉取失败的情况。
开发者可绑定广告组件的error事件监听并统计拉取失败的原因。详见：
error事件监听方式（以banner广告为例
）
banner广告的设置方式小程序banner广告： 小程序banner广告组件的默认宽度为100%（width: 100%），高度会自动等比例计算，开发者无法直接设置和获取广告组件的高宽。开发者可以在广告组件外层包裹一个view组件，通过设置外层组件的宽度调整广告的尺寸。注意：广告外层组件的宽度不允许小于300px，当宽度小于300px时，广告组件的宽度会强制调整为300px。
小游戏banner广告： 开发者可以在创建广告时传入width参数来控制小游戏banner广告的宽度，广告的高度会自动等比例计算（无法直接设置，height参数目前无效）。注意：广告的宽度设置不允许小于300px，当宽度小于300px时，广告组件的宽度会强制调整为300px。
更多内容请见：
广告组件操作指引
banner广告关闭后留白的处理方式用户点击banner广告左上角下拉菜单的负反馈选项后，banner广告将会关闭，并可能在部分小程序出现白底的情况。
开发者可以监听banner广告的close事件进行样式的兼容。详见：
小程序banner广告文档 
或 
小游戏banner广告文档
。
激励视频广告数据统计到一个广告位的处理方式初始创建的激励式广告位为单例模式（小程序是单页面单例，小游戏是全局单例），即使用多个广告位id创建多个激励视频广告，返回的仍然是第一个创建的广告实例，所以广告数据只会统计到第一个创建的广告位里面。
系统已支持激励式广告位多例模式改造，具体开发方式可见：
激励式广告多例模式说明
。
激励视频广告关闭事件触发多次的处理方式初始创建的激励式广告位为单例模式（小程序是单页面单例，小游戏是全局单例），开发者如果多次调用 RewardedVideoAd.onClose() 方法监听广告关闭事件，就会产生多次事件回调。
开发者可以按以下其中一种方法解决问题：
创建激励视频广告后，统一监听一次即可；
先调用 RewardedVideoAd.offClose() 方法取消原有的监听事件，再重新监听。
系统已支持激励式广告位多例模式改造，具体开发方式可见：
激励式广告多例模式说明
。
激励视频广告展示不同的广告的处理方式初始创建的激励式广告位为单例模式（小程序是单页面单例，小游戏是全局单例），如需针对不同广告位展示不同的广告内容或设置单独的视频时长，则需要启用多例模式的广告。
系统已支持激励式广告位多例模式改造，具体开发方式可见：
激励式广告多例模式说明
。
插屏广告加载成功却显示失败的处理方式插屏广告目前有一定的频控限制，即使广告拉取成功，在调用show方法时也可能存在失败的情况。插屏广告的show方法会返回一个Promise对象，开发者可通过返回的Promise对象捕获及统计错误信息。
具体信息可见：
插屏广告显示失败时返回错误码
。
插屏广告出现memory leak的原因插屏广告为多例模式，也就是说调用一次创建方法，就会创建一个全新的插屏实例。如果开发者重复多次创建和显示插屏广告实例，就可能出现memory leak情况。建议开发者不要重复多次创建插屏广告实例，以免对小程序/小游戏产生影响。如果是小程序，开发者在页面的onLoad方法创建一次即可；如果是小游戏，开发者在全局创建一次即可。
插屏广告展示异常，无法关闭在插屏广告展示过程中如果快速切换页面，可能会出现插屏广告展示在非调用页面的情况，如有需要请在页面切换完成后进行插屏广告展示。
广告组件的数量和位置要求针对banner、视频广告、格子广告，建议同屏不同时出现两个广告。
建议在数据稳定后，做多组放置方式组合测试，找到最适合小程序/小游戏的广告位置。
小程序组件应用规范Banner广告、格子广告、视频广告、插屏广告及激励式广告组件的应用规范请参考：
小程序广告组件应用规范
。`,
  81: `基础逻辑
介绍分成政策、影响收入及广告展示的因素等信息
影响收入的因素收入与文章曝光量/页面流量、广告填充率、广告曝光率、计费方式及广告单价均有关联。
【公众号】
文章的曝光量会决定可变现流量的大小，在数据报表上体现为广告的拉取量。
广告投放时往往会设置人群定向，系统会为用户匹配最适合的广告，若当前无适合该用户的广告，则不会展示。
广告的曝光率会受到文章长短和用户阅读深度的影响。
单次广告曝光或点击的价格，会受到广告主出价和广告展示竞争激烈程度的影响。
【小程序/小游戏】
页面的访问次数会决定可变现流量的大小，在数据报表上体现为广告的拉取量。
广告投放时往往会设置人群定向，系统会为用户匹配最适合的广告，若当前无适合该用户的广告，则不会展示。
广告曝光率会受到访问深度和组件接入场景/位置的影响。
单次广告曝光或点击的价格，会受到广告主出价和广告展示竞争激烈程度的影响。
综上，收入是一个与多种指标关联的结果，流量主在评估收入时，应注意以上多个指标的影响。
eCPM波动的原因eCPM指广告的千次曝光收益，它是收入的核心指标。当我们衡量流量变现的效率时，会将收入和曝光这两个关键指标进行关联，计算eCPM。
如果eCPM产生较大波动，则与广告主出价、竞争激烈程度、用户点击率均有关。
影响广告展示的因素广告展示与否与用户有关。
广告投放时往往会设置人群定向，系统会为用户匹配最适合的广告，若当前无适合该用户的广告，则不会展示。
若流量主为自己的公众号设置了广告屏蔽规则，就会进一步缩小可供匹配的广告数量，广告的填充率可能受到影响，建议谨慎设置。
同时，为了保证用户的阅读体验，当文章涉及敏感信息时，也会优化广告的展示逻辑。
文章的阅读量与广告曝光量的关系文章的阅读量会大于广告的曝光量。用户打开文章时，文章的阅读量增加；但是此时广告尚未向用户曝光，曝光量不会随之增加。
广告的曝光会受到文章长短、用户阅读深度和广告填充率的影响。
如果文章太长、用户阅读深度太浅，那么用户根本到达不了广告插入的位置，也就不会产生曝光；并且，广告投放时往往会设置人群定向，系统会为用户匹配最适合的广告，若当前无适合该用户的广告，则不会展示。
数据查看
介绍数据查看渠道、数据指标说明等信息
收入数据的更新机制每天上午8点至10点更新昨日收入，微信广告助手平台及流量主服务助手小程序同步更新。
建议在“账户设置”页面绑定数据日报。绑定后，每日10点至12点，微信广告助手公众号将为流量主推送昨日收入概况。
在手机端查看收入的方法流量主可以扫码使用“流量主服务助手”小程序，在手机端查看收入数据。

查看小程序/小游戏广告位细分收入的方式小程序/小游戏流量主可以在“数据统计”页面的“广告数据”看板，选择想要看数的广告位类型，选择“细分数据”，即可查看拉取、曝光、点击、收入等数据。
用户来源和收入的关联2019年6月1日起，通过所有渠道进入文章产生的收入都会被计入账户收入中。
通过所有渠道进入小程序/小游戏产生的收入都会被计入账户收入中。
返佣商品
介绍公众号返佣商品相关的数据展示、分成规则等信息
返佣商品的分成规则当商品被下单后，会产生预估收入，代表若交易成功，流量主可以获得的佣金收入。
不同的电商平台会设置不同长度的交易确认期，在交易确认期后即可结算该笔订单的广告收入。实际收入会受到退货、退款、使用优惠券、商家活动折扣等因素的影响，不一定等于预估收入。
交易确认期具体为：
京东：用户确认收货后 T+26 个自然日；
当当：用户确认收货后 T+20 个自然日；
猫眼：用户确认收货后 T+7 个自然日；
其他：用户确认收货后 T+20 个自然日。
总结如下：
预估收入 = 订单金额 * 商品佣金比例 - 平台技术服务费；
实际收入：用户实付金额 * 商品佣金比例 - 平台技术服务费；
实付金额：指用户实际用于支付的金额（不含运费、优惠折扣），与商品标价可能不同；
佣金比例：由商家设置佣金比例，结算时的佣金比例按用户下单时的佣金比例为准
预估收入和实际收入的关系实际收入不一定等于预估收入，会受到退货、退款、使用优惠券、商家活动折扣等因素的影响。
预估收入 = 订单金额 * 商品佣金比例 - 平台技术服务费
实际收入：用户实付金额 * 商品佣金比例 - 平台技术服务费
实付金额：指用户实际用于支付的金额（不含运费、优惠折扣），与商品标价可能不同
返佣商品收入的查看方式“概览”页及“数据统计”页的“返佣商品”板块展现的是返佣商品的预估收入；
“概览”页的“账户收入”及“财务管理”页的“收入数据”板块中展现的返佣商品收入均为实际收入。
一般来说，在下单后的第二日，返佣商品的预估收入就展现，而实际收入会在交易确认后，由电商平台将实际佣金金额传输给微信广告，并体现在佣金确认当日的账户收入中。`,
  82: `财务资料
介绍财务资料填写须知
委托第三方收款的规则个人主体：支持委托第三方个人或第三方企业收款。
企业主体：支持委托第三方企业收款。
温馨提示：媒体、政府、企业、其他等非个人类型帐号均不支持委托个人收款。企业委托个人收款只支持个体工商户和已注销的企业，个体工商户可由经营者代收；已注销企业可由指定权利义务继受人代收。
委托收款后改回账户主体收款的规则个人主体的账号委托企业账户收款后，不支持改为个人账户收款。
个人主体的账号委托个人账户收款后，可以再委托账户主体个人收款。
企业主体的账号委托第三方企业账户收款后，可以再委托账户主体企业收款。
企业主体的账号委托个人收款后，可以再委托账户主体企业收款。
提示‘’填写的姓名或身份证与公众号主体信息不一致‘’的处理方式此项报错意味着选择了账户主体（个人类型）收款，但是新填写的“开户名称”或“开户人身份证号”与帐号注册主体的姓名或身份证信息不一致，请仔细核对两边信息，保持信息一致后再尝试提交。
企业主体开通流量主时，页面默认了结算信息，且不支持修改的处理方式同一结算主体必须提交一致的结算信息，该结算主体已有公众号/小程序账号开通了流量主功能，已提交的是当前页面默认的信息，因此默认已存在的信息无法修改。 
如信息有误或需提交不同的结算信息，请先登录已开通流量主账号后台提交结算信息变更申请，待完成变更后再登录新的帐号补充结算信息。
提示‘’提交失败，请重试‘’的处理方式可能是网络或浏览器缓存问题，建议清除浏览器缓存或更换浏览器，或更换时间段再试。
收入结算
介绍收入结算规则、结算单下发规则、个人流量主扣税等信息
处于“结算中”状态的原因正常结算流程中包含“结算中”状态。
但有时会因为未补财务资料、财务资料补有误等原因而无法流转到下一状态，此时“财务管理”的“收入结算”页面将会出现红色告警提示及具体原因，流量主可补充或重新提交财务资料。
若流量主未及时补充财务资料，历史未结算的收入将在补充财务资料后自动发起补结。但由于补结流程及时间较长，历史结算区间的结算进度将在一段时间内保持在“结算中”状态。流量主无需焦虑，补结成功后，结算单会下发至对应的结算邮箱的，还请耐心等待。
如有其他疑问，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为您解答。
处于“已结算”状态的原因正常结算流程中包含“已结算”状态。
企业类型的收款账户需注意，已结算状态包括寄送发票、发票核验等流程，因此可能停留时间较长，请耐心等待，腾讯公司将在收到正确的发票及结算单后30个工作日内将结算金额打入您的结算银行账户。
处于“付款中”状态的原因正常结算流程中包含“付款中”状态。
但有时会因为收款银行账户是否存在被冻结、账号有误等原因而无法流转到下一状态，此时“财务管理”的“收入结算”页面将会出现红色告警提示，流量主可核查账户信息或重新提交当前收款主体下新的银行账户信息。
处理完毕后，请联系公众号"微信广告助手（ad_helper）"客服，申请重新发起付款。
补充财务资料后历史未结算收入的结算方式若流量主未及时补充财务资料，历史未结算的收入将在补充财务资料后自动发起补结。但由于补结流程及时间较长，历史结算区间的结算进度将在一段时间内保持在“结算中”状态。流量主无需焦虑，补结成功后，结算单会下发至对应的结算邮箱的，还请耐心等待。
温馨提示：因补结流程及时间较长，请务必及时完善财务信息。
帐号迁移后历史收入的结算方式帐号发生迁移不影响结算。迁移前未结算的收入会循既有流程，按原结算主体进行结算，请以结算单上的结算主体为准。
温馨提示：请确保账号在迁移前已完善财务信息，以便正常结算。若在迁移前未完善财务信息，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为您处理。
帐号永久封禁后历史收入的结算方式帐号永久封禁，若流量主功能同步封禁，则封禁前未结算的收入将不予结算。
温馨提示：若有疑问，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为您处理。
邮箱收不到结算单的原因如果提交的结算邮箱没有收到结算单，请先核查“财务管理”页的“结算信息”板块，确认结算邮箱是否变更，邮箱地址是否正确。如确认正确但未收到，可能存在以下情况：
收件邮箱的垃圾箱规则配置问题，设置了拒收或拦截，建议核查下收件规则设置，将腾讯域名tencent.com设置为白名单。
公司的邮件系统配置问题，设置了拒收或拦截，建议与公司邮箱IT核实。
申请补发结算单的方式2019年9月及以后的结算区间可申请补发结算单。
如需补发结算单，可在“财务管理”页的“结算记录”板块操作，点击需补发结算区间对应的“补发结算单”按钮，即可自助补发。
每个结算主体每份结算单每月申请补发不超过三次，结算单将在10分钟内发送至结算单邮箱。
如有更多需求，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为您处理。
描述内容：需补发结算单月份、账号名称、APPID、结算信息、结算邮箱。
补发结算单按钮不可点击的原因2019年9月及以后的结算区间可申请补发结算单。
当补发结算单按钮不可点击时，意味着对应结算单尚未生成。此时可以关注对应结算记录的状态，若处于“结算中”，那么不可点击是正常的。当状态扭转为“已结算”时，才可申请补发结算单（可参考文章：处于“结算中”状态的原因）。
若此时结算状态为“已结算”、“付款中”或“已付款”，但仍不可点击；或需要补发2019年9月以前结算区间的结算单，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为您处理。
描述内容：需补发结算单月份、账号名称、APPID、结算信息、结算邮箱。
视频号小任务收入提现规则
 1、如何进行收入提现？
您可进入“创作者中心-视频收入”中查看，并按相应提现规则进行提现。  
  
2、收入提现后多久能到账？
发起提现后，一般在7-14工作日到账至零钱。 
 
3、收入提示提现成功，但是未到账零钱账户怎么办？
（1）若提现进度显示处理中，人工无法加急，请你耐心等待；
（2）若提现进度显示已到账，则表明资金已到达零钱，你可以前往“我”->“服务”->“钱包”->“零钱”->“零钱明细”中查询零钱明细。    
        
4、每日可以提现几次？
每日可提现1次。
视频号小任务收入计税方法1、收入发起提现后，为什么会扣税？
根据法律要求，视频号小任务产生的收入需缴纳个人所得税，平台将代扣代缴。
 
2、税费计算方法？
个人所得税，按照当月收入（如分次取得，则为当月累计数）减去委托代征的增值税和附加税的余额后，按照“劳务报酬”计算，与单次提现金额无关。
企业开票
介绍企业类型收款主体开具发票的相关信息，个人收款主体无需开票
企业开票信息2020年6月起，腾讯公司与流量主的合作主体由“深圳市腾讯计算机系统有限公司”变更为“腾讯科技（深圳）有限公司”。建议在开具发票时，参考
当月结算单展示的腾讯公司名称
，再开具相应信息的发票。
信息变更前（2020年5月及以前）
公司名称：深圳市腾讯计算机系统有限公司
发票类型：增值税专用发票
纳税人识别号：91440300708461136T
开户行及账号：招商银行深圳

汉京中心支行 817282299610001
开票地址电话：深圳市南山区粤海街道麻岭社区科技中一路腾讯大厦35层 0755-86013388
货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
信息变更后（2020年6月及以后）
公司名称：腾讯科技（深圳）有限公司
发票类型：增值税专用发票
纳税人识别号：9144030071526726XG
开户行及账号：招商银行深圳汉京中心支行 817281823910001
开票地址电话：深圳市南山区高新区科技中一路腾讯大厦35层 0755-86013388
货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
注：请参考当月结算单展示的腾讯公司名称，开具相应信息的发票。
多月合并开票规则当合并多月结算单开票时，请注意：
使用增值税专用发票
2016年6月及之前月份的结算单可以合并开，2016年7月至2019年8月的结算单可以合并开，2019年9月至2020年5月的结算单可以合并开，2020年6月及之后月份的结算单可以合并开
相同抬头的发票可以合并开
相同结算业务名称的发票可以合并开，不同业务不可合并开
每月的结算单必须分别盖章确认，与发票一同邮寄给腾讯公司
注：请参考当月结算单展示的腾讯公司名称，区分结算业务名称开具相应信息的发票。
增值税专用发票腾讯公司只接受增值税专用发票，不接受增值税普通发票。
小规模纳税人可以去当地国税局代开增值税专用发票。
发票金额和税率结算单金额为含税金额，开票时即：发票价税合计金额=结算单金额。
增值税专用发票税率可接受6%和3%。
企业开票主体开票主体必须与结算单上的结算主体一致。
如：结算主体是 A 公司，则开票主体必须是 A 公司，不可使用 B 公司。
工商更名时的开票方式若结算企业已工商更名，之前未开票的结算单可使用更名后企业名称开票，请勿修改原结算单内容，结算单加盖更名后企业公章即可。
申请结算需邮寄的资料如下:
增值税专用发票发票联及抵扣联，须加盖公司发票专用章。
与发票对应月份的结算单，须加盖企业公章。(加盖与开票企业名称一致的公章)
工商部企业更名证明复印件。
建议企业工商更名时，及时将名下流量主帐号的结算账户信息申请修改为新名称对应的银行账户，完成变更后的结算月份均可使用新名称开票。
企业已注销时的开票方式若结算企业已注销，可支持清算报告（或破产财产分配报告）指定的权利义务继受人收款，之前未开票的结算金额，因企业注销无法开具发票，后续按照因无发票扣除税点后的金额支付给指定权利义务继受人的账户。
申请结算需邮寄的资料如下:
需结算月份的结算单，须指定权利义务继受人手写签字（请勿修改原结算单内容）。
工商部企业注销证明复印件。
《关于微信广告已注销企业结算付款的补充说明》原件。
建议企业注销时，及时将企业名下流量主帐号的结算账户信息申请修改为指定权利义务继受人的账户，未完成变更的无法处理历史结算，完成变更后的结算月份将按指定结算主体的规则结算。
如有疑问，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为您处理。
纸质合同的申请方式如需流量主纸质合同，请提供以下信息发送邮件至系统服务邮箱wxad@tencent.com申请，将在7个工作日内回复，邮件格式如下：
邮件主题：【流量主合同申请】+帐号名称+结算主体
邮件正文：
问题描述：
帐号名称：
原始ID：
APPID：
签约主体（须与结算主体一致 ）：
身份证号（适用于自然人流量主）：
合作联系人：
联系电话：
电子邮箱：
联系地址（邮寄地址）：
开户行：
银行账号：
注：流量主纸质合同仅供开票使用，如税局开票不需合同，则不用签订。`,
  155: `
如何开通广告主？投放微信广告首先需要进行广告主的开户操作，开户操作总共分四步， 
详情请点击参考

我想投放微信广告，需要哪些步骤？ 要完成一条广告上线，需要以下步骤：
开户（公众号开户、微信认证（含主体+名称认证）、开通广告主）→  广告创建 → 提交广告审核 →  广告上线 

广告主开通指引可
点击查看
了解更多“微信广告”的创建及投放流程可
点击查看`,
  156: `个人公众号可以申请广告主吗？已通过组织类型微信认证的公众号即可申请开通广告主服务。
2014年8月26号之前注册的个人类型公众号满足以下三个条件即可申请组织类型微信认证。
没有开通流量主的个人类型公众号；
未纠错过主体信息的个人类型公众号；
未开通个人认证入口的个人类型公众号。
温馨提示： 2014年8月26号之后注册的个人类型的公众号、已不支持申请微信认证，若需要申请微信认证，请重新注册企业/组织类型的公众号。
如何选择开户行业？广告主开户会核实营业执照经营范围，审核将根据你的帐号内容、你所提供的网站或者主体备案网站、APP内容、实际经营业务等确认行业类别，并按照该类别相应的法律法规或政策规定对你提供的营业执照经营范围、行业资质等资质材料进行核对。
请根据营业执照经营范围和实际经营内容参考官网行业介绍
点击查看
选择相应行业，具体提交后以实际审核结果为准。
开通广告主，需要注册什么类型的公众号？已完成帐号主体资质和名称认证的组织类型订阅号和服务号可以申请广告主功能。
组织类型的订阅号和服务号支持以下几种认证主体：
企业、媒体、政府、事业单位、其他组织、个体工商户等类型。
详情参考可
点击查看
广告主开户需要粉丝数量门槛吗？开通广告主功能无粉丝数量要求。
开通广告主需要收费吗？申请开通广告主无需任何费用。
但申请开通广告主前，需要完成微信认证，微信认证服务审核费300元/次/年，详细认证流程可
点击查看
温馨提示：微信认证为广告主开通前序流程，需前往公众平台申请，如注册公众号目的仅为投放广告，建议提前了解微信广告行业开放及资质说明可
点击查看
境外企业可以申请广告主账户吗？若主体实际运营内容为境外业务，认证主体包含认证国内主体、境外主体在内，需遵循境外广告主准入流程：「注册公众号」- 「完成境外主体认证」- 「邮件申请评估准入」- 「申请开通广告主」。
1、注册&认证
微信广告境外主准入流程可
点击查看
温馨提示 
：此流程为广告主开户前置流程，需前往公众平台申请，如注册公众号目的仅为投放广告，建议参考微信广告境外主准入流程，先确认申请主体主营行业是否准入，再申请公众号。
2、邮件申请评估准入
公众号认证成功后，请优先联系对接服务商/渠道经理提交开户申请，如无服务商/渠道对接，可通过 wxad@tencent.com邮箱申请准入；评估回复时效为2个工作日。
公众号认证成功后，需邮件提交申请评估准入，微信广告侧会在两个工作日内回复确认
【邮件模板】
邮件标题：【微信广告】境外广告主准入申请XXXX（申请当天日期）-公众号名称
邮件内容：公司名称、英文公司名称、主营行业、主体所在地区、原始ID（公众号管理后台-公众号设置中获取）、公司邮箱（需与认证邮箱保持一致）、公司简介、公司网站链接及介绍、投放预算、代理商名称（如未绑定可为空）    
 3、申请开通广告主
登录微信公众平台后台，选择左侧面板“推广”中的“广告主”，提交开通广告主功能申请。
申请入口
可点击查看
营业执照经营内容涉及多个行业，申请广告主账户时可以申请多个行业开户吗？微信广告主申请开户时需选择行业，一个广告主账户单次只支持选择一个行业。
微信广告开放行业及所需资质有哪些？微信广告现已开放具体行业说明及所需相关资质可
点击查看
微信广告暂不开放行业及法律禁投商品和服务有哪些？微信广告暂不开放行业及法律禁投商品和服务可
点击查看
广告主行业如果需要变更，如何修改？广告主行业可在后台自助申请修改。
路径：广告主- 账户管理- 账户信息- 主营行业- 修改
温馨提示：一年内只支持2次修改；行业修改提交后，会在2个工作日内完成审核。
棋牌捕鱼类游戏可以准入及投放吗？微信广告根据游戏的类型需要广告主提交相关的版号资质，由于以下这几个游戏类型在广告审核中容易遗漏提交相关的版号资质，导致被频繁驳回，因此须大家重点关注 棋牌、捕鱼、官场、宫斗、商战类：须上传《国家新闻出版广电总局批准的版号》到行业资质入口。

具体游行业戏准入规范可
点击查看
为什么开户成功却不能投放朋友圈广告？朋友圈广告位未向所有行业开放，具体请查看官网不同行业支持投放的广告位可
点击查看`,
  157: `广告审核需要多久？微信广告会在方案最新提交时间起计算1个工作日内（即24小时内）完成审核，周末和法定假日不计算审核时间。
如广告提交在1个工作日内，请耐心关注审核结果。
广告主开户审核需要多久?广告主申请提交后，将在2个工作日内审核完毕，如遇周末或节假日暂不处理，顺延到下个工作日。
行业资质审核需要多久?行业资质提交后，将在2个工作日内审核完毕，如遇周末或节假日暂不处理，顺延到下个工作日。`,
  158: `广告主开户审核不通过，如何申诉？若对审核结果不认同，可以通过以下两种方式申诉。（为提升处理效率，请选择其中一种方式申诉即可）
1、公众号「微信广告助手」在线申诉方式：输入“人工”二字咨询人工客服
请提供：APPID+问题描述+申诉点
客服在线时间：工作日09:00-18:00。排队预计需要10~30分钟，如遇咨询高峰，可能会稍有延时。
2、微信广告客服邮箱申诉方式：请提供以下信息，发送资料到邮箱ads_ss@tencent.com，相关工作人员为你进一步核实，会在3个工作日内（不包括周末、法定节日）回复。
邮件主题：【广告主审核不通过】+广告主名称+APPID
问题详细描述：
审核失败的提示截图：
资质是真实的，为什么驳回说是假的？审核人员会根据广告主所提交的资质联系发证机关/授权方核实其资质的真实性，若发证机关/授权方反馈有异，将会按照反馈驳回，若提交的资质真实无误，建议联系发证机关/授权方核实此问题，核实完毕后，重新提交审核。
驳回原创率不足50%，能帮我看到现在的原创率是多少吗?目前仅可查看到公众号文章原创率是否满足50%，建议提高公众号内容原创比例，从而提高广告审核通过率。
为什么我申请广告主选择的行业和开户通过的行业不一致？审核侧目前是按照广告主实际经营内容来调整行业，目的是帮助选错行业的广告主快速通过开户申请，不需要因为行业选择错误原因被驳回。
相关审核要点可
点击查看
公众号认证时名称可以通过，为什么申请广告主时被驳回需要改名称？微信认证是微信公众平台为了确保公众帐号信息的真实性、安全性，目前提供给微信公众号进行微信认证的服务。
更多微信认证介绍可
点击查看
如果需要在公众号认证成功后开通广告主功能，建议你先了解广告主开户相关要求。
1、微信广告开放行业分类及资质可
点击查看
2、帐号头像及名称通用规范要求可
点击查看
3、公众号规范可
点击查看
推广页可以出现个人二维码吗？推广页中不能出现非广告主主体的公众帐号/无主体的个人公众帐号/个人微信号/个人名片信息，展现形式包括但不限于微信公众帐号二维码、微信公众帐号帐号ID及微信公众帐号帐号名称；
更多规范可
点击查看
朋友圈广告二跳（外链）/三跳的落地页链接内容变更时需要重新提交审核吗？修改二跳/三跳的内容不会触发审核。但是不建议在广告通过审核后修改内容，如果修改后的内容不符合广告规范，广告可能被下架甚至处罚。
广告主违规处罚可
点击查看
小程序在广告通过审核后，版本有更新，会触发审核吗？如果只是小程序版本更新，素材不变，不会触发广告审核。
小程序在广告通过审核后，版本有更新，广告会拉取新的版本吗？如果广告创建时填写的小程序页面路径在小程序版本更新后可正常访问，则可正常拉取。`,
  159: `微信广告投放平台广告主账户的资质在哪里上传？资质上传路径：【广告主】-【账户管理】-【资质管理】添加行业/投放资质。
资质要上传在行业资质还是投放资质，在哪里上传？上传路径取决于资质类型，审核结果一般会提示是上传到行业或投放资质。
资质上传路径：广告主-账户管理-资质管理
资质与主体不一致，有授权模板吗？授权模板可
点击查看
资质还在办理中，可以先开户后补充吗？不支持，开通广告主需要提交行业所需资质才能进行开户操作，建议等资质办理好了再提交申请。
资质太多，上传不下怎么办？可删除不需要的资质，或拼图上传（需上传清晰的图片）
资质是有效期内的，为什么后台显示过期了？后台显示的过期状态不影响审核，如果影响可直接反馈复审。
 行业/投放资质可以删除吗资质是可以删除的。操作路径：广告主-账户管理-资质管理`,
  160: `朋友圈广告有哪些形态？朋友圈广告支持常规广告、组合式卡片广告、全幅式广告、全景式广告、滑动式广告、长按式广告、轮播式广告、摇动式广告、IP互动式广告 9大广告形态。
 朋友圈广告形态具体介绍可
 点击查看
 小游戏支持哪些广告位的推广？目前朋友圈、公众号、小程序广告位均支持小游戏推广，可在后台自助选择相应的广告位进行投放。
 小程序广告位支持哪些推广目标？目前小程序位广告已支持推广品牌活动、推广电商、推广公众号、推广应用、收集销售线索，推广小游戏、推广视频号等推广目标。
 朋友圈/公众号广告位支持推广小程序吗？目前公众号与朋友圈广告位均支持小程序推广。
 如何推广我的线上商品？目前支持“推广线上商品”的广告位及广告样式可
 点击查看
 
 我想要投放收集用户数据类型的朋友圈广告，支持吗？ 目前朋友圈广告的常规模板和原生推广页均支持表单形式；可以选择“收集销售线索”为推广目标。`,
  161: `微信广告各广告位是如何收费的？微信广告目前支持朋友圈广告、公众号广告、小程序广告、支付订单详情页广告位的广告投放。
 朋友圈广告支持曝光排期和曝光竞价两种购买方式。
 公众号底部和文中广告支持曝光排期/点击竞价购买，公众号文章视频贴片广告位支持按曝光竞价购买，互选广告按照单篇文章计费。
 小程序banner广告支持曝光排期/点击竞价购买，小程序插屏广告支持曝光排期/曝光竞价购买，小程序激励式广告支持曝光竞价购买。
 支付订单详情页广告支持曝光排期购买。
 具体售卖策略和起投门槛可
 点击查看
 朋友圈广告是如何收费的？ 朋友圈广告支持曝光排期和曝光竞价两种购买方式。
 两种购买方式所对应的单价与服务标准可
 点击查看
 朋友圈广告最低起投金额是多少？朋友圈广告按曝光排期单次广告投放预算 5 万元起，曝光竞价每日广告预算最低50元起。
 朋友圈推广小程序怎么收费？ 朋友圈广告按不同广告形态及购买方式售卖策略有所不同，多种广告形态均可跳转小程序推广，具体可
 点击查看
 朋友圈本地推广广告是怎么收费的？朋友圈广告推广门店（本地推广）支持按曝光排期和曝光竞价两种购买方式。
 具体可
 点击查看
 朋友圈广告长效社交费用是多少？朋友圈长效社交广告，效果更社交化。系统为客户选择核心高价值人群作为种子人群投放，为广告主更准确的寻找合适的精准用户，并触达其社交圈层，从而收获更好的广告效果及社交影响力。
 长效社交广告支持自助投放，可选择的投放时长为：7-30天。 投放门槛：合约广告单次投放50万元起。
 朋友圈限时推广费用是多少？朋友圈限时推广广告，满足广告主在特定时段的投放需求，在短时间大量曝光且保证消耗，确保广告投放的引爆效果。
 限时推广广告支持支持自助投放，可选择的投放时长为：4-6小时。 起投门槛：合约广告单次投放50万元起
 朋友圈常规合约广告费用是多少？朋友圈常规合约广告，满足广告主常规投放的产品需求，可以帮助广告主在较短的时间内大范围触达微信生态用户。
 常规合约广告支持自助投放，可选择的投放时长为：12小时-6天，单次投放5万元起。
 朋友圈落地页自定义H5链接广告费用是多少？朋友圈广告落地页支持使用自定义H5链接，该形式支持曝光排期和曝光竞价两种购买方式。
 两种购买方式所对应的曝光单价与服务标准具体可
 点击查看
 朋友圈落地页如果是原生推广页怎么收费？朋友圈落地页使用原生推广页的收费模式和常规广告是一样的，具体可
 点击查看
 朋友圈广告『XX个朋友可能看到』的功能门槛是多少？该功能面向朋友圈排期购买广告全量开放，朋友圈排期广告门槛：单次广告投放5万元起。
 朋友圈图文广告可以支持哪种购买方式？ 排期购买和竞价购买两种类型均支持朋友圈图文广告，可根据自己的需求选择相应的购买方式。
 朋友圈视频广告可以支持哪种购买方式？排期购买和竞价购买均支持朋友圈视频广告，可根据自己的需求选择相应的购买方式。
 朋友圈排期、竞价广告分别支持哪些城市？朋友圈排期、竞价购买广告目前已向国内全部城市开放。
 公众号广告是如何收费的？ 公众号底部和文中广告支持点击竞价/曝光排期购买，公众号文章视频贴片广告位支持按曝光竞价购买，互选广告按照单篇文章计费。
 具体收费策略可
 点击查看
 公众号互选广告是如何收费的？互选广告按文章收费，文章的合作价格由流量主决定；
 对于“广告推荐”合作模式，流量主会设置承诺曝光量，若最终合作文章广告曝光量未达到承诺值，将按实际曝光量/承诺曝光量的比例进行扣费。
 “内容定制”合作模式无承诺曝光机制。
 如：某“广告推荐”合作文章合作价格为1000元，承诺曝光量为10000，实际曝光量为5000，则实际扣费金额=1000×(5000/10000)=500元。
 互选广告详细介绍可
 点击查看
 公众号广告投放的最低金额是多少？ 公众号广告起投门槛：
 按点击竞价购买：每日预算50元起；
 按曝光竞价购买：每日预算50元起；
 按曝光排期购买：单次广告投放预算1000元起；
 互选广告按文章收费，文章价格由流量主自主决定。
 不同广告位支持的购买方式可
 点击查看
 公众号广告排期、竞价购买方式分别支持哪些城市？公众号排期、竞价购买目前已向国内全部城市开放。
 小程序位的广告是如何收费的？ 小程序Banner广告支持点击竞价/排期曝光购买，小程序插屏广告支持曝光竞价/曝光排期购买，小程序激励式广告按曝光竞价购买。
 具体收费策略可
 点击查看
 小程序广告位投放的最低金额是多少？ 小程序广告起投门槛：
 按点击竞价购买：每日预算50元起；
 按曝光竞价购买：激励式广告每日预算50元起；插屏广告每日预算50元起；
 按曝光排期购买：单次广告投放预算1000元起。
 不同广告位支持的购买方式可
 点击查看
 排期广告最短/最长可投放多长时间？朋友圈排期广告（限时推广、长效社交除外）排期时间范围如下：
 预定投放时间：未来1~28自然日；
 投放持续时间：12小时~6自然日。
 公众号排期广告排期时间范围如下：
 预定投放时间：未来1~28自然日；
 投放持续时间：12小时~28自然日。
 售卖策略及投放时间参考可
 点击查看`,
  162: `如何创建应用渠道包？若需创建渠道包投放广告，需你的应用已在腾讯开放平台上架。
 详细的创建指引可
 点击查看
 渠道包更新，需要新建广告吗？若广告投放中途渠道包有更新，无需新建广告但投放的渠道包依然为旧版本不会自动更新。
 若广告投放中途，渠道包要更换，需新建广告选择更换新的渠道包后投放。
 询量预计曝光人数不到1000是什么原因？微信广告对投放端的城市行政区县、商圈体系等地域定向标签进行持续性更新，询量中出现预计曝光是0或不足一千的情况请选择周边区域或扩大至上级市，合理安排广告投放。
 一个朋友圈计划下可以创建多少个广告？竞价购买方式的计划可创建10个广告，排期购买方式的计划可创建200个广告，在广告创建过程如达上限系统会提示。
 朋友圈广告排期锁定后，可以更改或取消吗？朋友圈及公众号、小程序排期广告在上线前，支持修改定向、预算、出价、创意等信息；广告上线后，不支持修改。
 温馨提示：排期广告如需修改定向或创意，需先解除排期，排期解除期间如遇其他广告主参与锁量可能会导致原定时间可消耗金额无法满足投放需求。
 投放中的朋友圈广告修改投放设置需要重新提交广告审核吗？修改投放设置（如广告定向）不需要重新提交广告审核。
 朋友圈/公众号推广广告预览时为什么提示“引导用户非法关注”？预览时出现该提示属于正常现象，正式上线不会出现此类情况。
 互选广告怎么解除锁定金额？互选广告不用解除排期，在广告详情页面取消投放即可完成金额解锁。
 一个原生推广页可以使用多个表单组件吗？为了提高推广页表单转化率，吸引用户填写表单，原生推广页/原生推广页小程序版支持将同一表单在推广页中展示两次。
 功能点介绍及操作：
 支持在一个推广页中将同一个表单展示多次，通过反复提醒的方式吸引用户填写表单。
 需要新增翻页才能添加，一个推广页最多支持两个表单。
 原生推广页模板为什么创建了却不能选择？创建好的原生推广页模板有其适用于相应的广告及广告形态（在素材中心查看相应的广告位/推广目标），请选择相应的广告位/推广目标进行使用。
 举例：若创建的推广页适用于推广公众号，则创建广告需选择推广目标“推广公众号”。
 已创建的原生推广页支持删除吗？支持，在广告主-素材中心-推广页管理，可删除已创建的原生推广页。
 微信广告投放平台、原生页编辑器不展示图片如何处理？可以通过以下两种方式操作尝试：
 1、切换浏览器（建议使用QQ浏览器）
 2、 设置chrome浏览器：
 -在设置中，找到隐私设置和安全性- 点击”网站设置- 找到最下面”更多内容设置“- 点击弹出后，选择”不安全内容“- 在允许列表中，点击添加：mp.weixin.qq.com
 - 点击保存，并重启浏览器。
 日预算修改可以小于当日预算吗？ 对于公众号文章底部、公众号文章总部和小程序CPC竞价广告，修改预算幅度至少50元，修改后的预算不得少于（已消耗金额+50）元；
 对于公众号视频前贴片竞价广告，调高预算时，修改幅度不能低于100元；调低预算时，修改后的预算金额不得小于该广告已消耗的金额的1.5倍。
 对于朋友圈竞价广告，调高预算时，修改幅度不能低于100元；调低预算时，修改后的预算金额不得小于该广告已消耗的金额的1.5倍。
 广告上线了还能修改时间吗？排期广告上线后，不支持修改投放时间，竞价广告上线后支持投放开始与结束时间。
 锁定排期又取消会有什么影响吗？合约广告完成锁量后，若多次临时取消排期导致锁定预算未投放，系统将自动识别并实时评估你的广告合作信用；平台将视情节恶劣程度酌情采取相应惩处措施，建议你确认投放计划后进行锁量操作，并合理安排广告投放。
 广告主违规处罚可
 点击查看
 排期广告支持暂停吗？排期广告可以暂停，广告暂停之后，广告不会再对新用户曝光，但是已经看到广告的用户仍会给广告带来互动曝光，互动曝光会带来一定时间的持续扣费。
 温馨提示：锁量不按时提交或投放中暂停广告，导致最终消耗<80%，导致流量浪费，将视作排期购买广告的违规行为。
 具体措施说明可
 点击查看
 投放中的广告支持驳回再修改素材吗？排期广告（公众号+朋友圈）以及朋友圈竞价广告：上线后可以修改定向、预算和出价等信息，不支持修改创意，广告上线后，收到广告的用户可能在朋友圈与广告产生点赞、评论等互动，修改创意后，可能会导致广告内容与用户互动意愿或内容不符，影响微信用户体验
 公众号、小程序竞价广告：在上线前、投放中或暂停后，支持随时修改定向、预算、出价、创意等信息，如果修改创意内容，广告将进入审核流程。
 创建广告，提示“广告主当日创建计划数量超过日限额”？针对非关注类竞价广告限制规则：
 一个广告主账号每天新建投放计划（cid）上限：朋友圈1000个，公众号和小程序200个。
 删除计划可以释放配额，对广告数（aid）不限制。
 一个广告主账号有效广告数（aid）上限50000个，删除广告或投放结束可以释放配额。
 针对关注类“推广我的公众号”广告限制规则：
 一个广告主账号每天可创建的朋友圈竞价广告上限是200个；删除广告不释放配额，对创建公众号小程序广告不限制
 一个广告主账号有效广告数（aid）上限3000个，达到上限无法再创建广告，已结束和已删除的广告不占限额。
 自定义人群管理功能中支持的格式类型有哪些？目前可支持的格式如下：
 QQ号码：5-12位，纯数字组成；
 手机号：11位，纯数字组成；
 手机号MD5：32位，由数字+字母串组成；
 IDFA：32位，要求加密前，字母格式统一为大写；
 IMEI-MD5：32位，要求加密前，字母格式统一为小写；
 IMEI：14或15位，由数字+字母或纯数字组成；
 IDFA-MD5：要求32位，要求加密前，字母格式统一为大写；
 微信开放平台openid
  DMP内创建人群可以删除吗？ 是否支持looklike功能？支持删除。请点击高级功能- 前往DMP数据管理平台进行操作；
 可使用强大的智能拓展（Lookalike）能力，帮助广告主对精确人群做相似拓展，获得量级更大的人群包。
 公众号/小程序appid与原始ID如何查询？「公众号」
 公众号APPID查询路径：登录
 微信广告投放平台
 -在左下方“开发-基本配置”中可查询。
 原始ID查询路径：登录
 微信广告投放平台
 -点击右上方“账号详情”-页面最下方“注册信息”里可查询。
 「小程序」
 小程序APPID与原始ID查询路径：登录
 微信广告投放平台
 -在左下方“设置-基本配置-账号信息”中可查询。`,
  163: `预计单日最大曝光量是什么？预计单日最大曝光量主要取决于所选广告定向预估所能覆盖的人群规模，实际曝光量受出价及竞争环境影响。
 投放端找不到某行政区域，怎么办？平台会根据国家官方信息，对投放端的城市行政区县、商圈体系等地域定向标签进行持续性更新，请持续关注。
 自定义人群包与其他定向是取并集还是交集？竞价广告如果绑定自定义人群包，与其他基础定向取交集。
 开户成功后，如何投放境外定向广告？1、境外差旅定向
 目前已支持竞价购买广告，支持朋友圈、公众号、小程序流量开放的所有行业，目前支持境外国家/地区“旅行或出差”定向：即支持定位当前在境外区域，且常住地不在该区域的用户，已覆盖20个国家与地区。
 境外差旅定向已支持自助投放，基础介绍及投放指引可
 点击查看
 2、境外常住定向
 因为系统服务调整，微信广告的中国大陆境外常住人群定向，将于12月底下线；仅保留境外差旅定向。
 从2022年1月1日后，将无法通过
 微信广告投放平台
 创建中国大陆境外常住人群地域定向广告。
 朋友圈广告支持付费人群定向吗？朋友圈广告不支持付费用户定向；公众号广告与小程序广告可以支持该定向行为，具体可以登录投放端操作。
 朋友圈广告如何设置白名单？广告通过审核后，进入“待投放”环节，最多可支持配置50个白名单用户，白名单内用户在上线后可收取到该条广告。
 设置路径：广告主-投放管理-广告计划名称（点击）-广告详情右上角设置白名单
 广告主须输入白名单用户的微信号（注意大小写），不支持手机号、QQ号，且白名单用户需关注投放广告的公众号。
 设置白名单投放提交后，不支持修改&剔除。
 小程序广告主投放朋友圈广告如何添加白名单？设置路径：广告主-投放管理-广告计划名称（点击）-广告详情右上角设置白名单`,
  164: `智能优化支持的推广目标有哪些？截至2020年11月，智能优化支持以下推广目标及对应的优化目标

 智能优化（oCPM/oCPC）有投放门槛吗？2020年5月起，微信广告智能优化（oCPM/oCPC）已实现所有优化目标的零门槛投放，具体可
 点击查看
 什么是一键起量？一键起量是微信广告推出的一种新的oCPM广告投放方式，帮助广告主在使用后提升广告竞争力，快速拿量，探索转化，提高广告的起量概率，具体可
 点击查看
 成本保障规则有哪些？为帮助广告在投放的前期得到充分的探索，促进长期稳定的投放，微信广告推出成本保障政策，平台将承担投放前期的探索风险，当成本偏差较大时进行赔付，广告主可以放心新建广告持续投放。
 
 相关成本保障政策如下：
 1、保障的优化目标范围：激活、下单、表单预约、首次付费、注册、公众号内注册、有效表单预约、关注、关键页面访问、商品详情页浏览、公众号内阅读、公众号内发消息、进件、授信、在线咨询、加企业微信客服、付费
 
 2、保障的时间范围：从广告首次投放的那一刻开始，及其之后的3个自然日
 
 3、在保障时间范围内，广告累积转化数≥6个，且转化成本超过平均出价的20%以上，则进行赔付
 
 4、在保障时间范围内，广告操作限制：每天修改广告出价或者定向的次数不能超过2次
 
 
 成本保障赔付金额 = 广告实际消耗 – 转化量 * 平均出价
 关于成本保障的详细规则及常见问题FAQ可
 点击查看`,
  165: `为什么广告主后台的点击量和小程序后台的点击量不一致？广告投放数据请以广告后台为准。
 由于无法确认小程序里的点击量是否仅来源广告，且如果收到广告的用户转发给其他用户等转发行为带去的小程序点击量不会计入广告后台的点击及广告消耗。
 xx数据指标具体指什么？相关释义在广告详情中，鼠标置于名词上均有释义，也可以在自定义报表里，将鼠标放在名词的右边查看各个名词的释义。
 用户提交的销售线索在哪里查看？广告落地页使用原生推广页“表单”组件，用户填写在原生表单里的线索，可在广告详情页面下载。
 也可以在【广告主→工具箱→销售线索管理】中查看。
 为什么视频播放次数高于曝光次数？整体视频播放次数包括外层视频、小视频全屏播放、长视频播放三个场景下的播放数据，且外层视频和小视频全屏播放是自动循环播放的，每次循环都会计播放次数，但广告曝光数不计算循环部分。故会高于广告曝光数 。
 为什么推广页按钮点击次数比人数多？推广页按钮点击人数的统计是UV数，推广页按钮点击次数统计是PV数。
 如果一位用户对广告感兴趣，或由于网络状况不好等情况，可能对按钮会有多次点击的行为。且朋友圈广告是按曝光扣费，用户对推广页的按钮点击次数不会对广告扣费有影响，请知悉。`,
  166: `结案报告可以下载吗？结案报告可以在广告详情页“结案报告”入口处下载。
 哪些广告有结案报告？目前朋友圈排期购买的广告及单次广告投放金额在5万元以上的互选广告有结案报告，公众号排期广告暂无结案报告。
 朋友圈竞价广告结束后会有结案报告吗？朋友圈排期购买广告投放结束后提供结案报告，竞价广告没有结案报告。
 排期广告投放完成后，你可登录微信公众平台广告主页面，在“投放管理”—“投放计划”层级下，点击已投放结束的推广计划，在右上角看到“结案报告”的入口。
 结案报告支持按不同城市的数据分开查看吗？暂不支持，如需查看不同城市数据，可参考
 微信广告投放平台
 -数据报告-用户分布-地域分布数据。
 结案报告新增的评论分析板块有介绍吗？朋友圈广告“评论分析”功能已经全量上线，目前针对单次投放评论量级>1000条的合约广告在结案报告中展示，功能包含:情感分析、评论呈现正负向、观点分析等。`,
  167: `APP激活/注册转化行为如何回传？在微信广告推广APP应用程序时，用户下载APP应用程序会产生对应的转化行为（如激活、注册等），为了量化广告转化效果，以及积累转化数据以使用智能优化（oCPM/oCPA）能力，需要回传用户的转化行为，详细介绍可
 点击查看
 H5下单/资料收转化行为如何回传？在微信广告推广H5页面时，用户进入H5中会产生对应的转化行为（如下单、资料收集等），为了量化广告转化效果，以及积累转化数据以使用智能优化（oCPM/oCPA）能力，需要回传用户的转化行为，详细介绍可
 点击查看
 小程序下单/资料收集转转化行为如何回传？在微信广告推广小程序页面时，用户进入小程序中会产生对应的转化行为（如下单、资料收集等），为了量化广告转化效果，以及积累转化数据以使用智能优化（oCPM/oCPA）能力，需要回传用户的转化行为，详细介绍可
 点击查看
 小程序广告数据监控如何操作？用户点击广告跳转小程序页面，小程序页面路径所带参数，以及参数监控上报。目前适用于朋友圈、公众号、小程序广告位推广小程序广告的数据监控，详细介绍可
 点击查看
 API接入技术问题可以咨询哪里？对接API过程中，如果涉及API无法调通，报错无法解决的问题，技术咨询可进入腾讯广告开发者专区
 可
 点击查看
 ，点击页面右下角侧“问号Logo”，通过反馈中心进行反馈，会有专人及时处理，感谢你的理解与配合!
 如API可正常使用，但对归因结果数据有疑惑，请咨询『微信广告助手』
 注：咨询时请注明使用的API名称和使用背景，附上对接文档方便快速定位问题。
 API接入常见问题有哪些？行为数据上传可能涉及的问题排查流程、咨询流程、API相关参数等，常见问题可
 点击查看`,
  168: `什么是广告曝光？什么是互动曝光？用户在浏览朋友圈广告时，广告露出一定比例+停留一定时间计一次有效曝光，系统仅对有效曝光进行扣费。用户对广告进行了点赞、评论操作，当其好友也对广告进行点赞、评论操作时，系统会对用户进行红点提醒；用户点击红点提醒，算是一次互动曝光。
 广告曝光怎么扣费？用户每有一次广告曝光或互动曝光，系统会进行扣费。广告在一定时间范围内重复曝光只扣费一次。
 可以控制一个用户只曝光一次吗？曝光次数体现用户对广告兴趣程度，无法人为控制。用户每有一次广告曝光或互动曝光，系统会进行扣费。广告在一定时间范围内重复曝光只扣费一次。
 账户日预算设置是否会对合约广告消耗金额有影响？该功能只针对竞价广告的预算设置，对合约广告无影响。
 为什么广告暂停了还有扣费？广告暂停后一段时间仍可能出现持续扣费的情况，主要由于两种原因：
 ① 新曝光用户：广告暂停后，系统将停止新的用户对该广告的拉取请求。但因广告拉取与广告曝光之间存在一定时间间隔，存在部分用户在广告暂停前拉取到广告，且在广告暂停后浏览朋友圈产生曝光进而出现扣费。
 ② 已曝光用户：广告暂停后，已收到广告的用户由于互动产生的曝光将继续扣费。
 公众号广告的公众号名称显示不全是什么原因？公众号名称为系统自动拉取，如名称超过7个中文字符会显示不全。
 分享的广告公众号详情页为什么不显示关注按钮？分享后的显示样式已做变更，分享广告链接后该页面是不展示关注按钮的。
 白名单用户会在什么时候预览到广告？朋友圈广告会在上线当日0点推送给白名单用户，白名单用户看到广告的时间取决于其刷朋友圈的习惯。
 白名单用户收到的广告门店展示不是最近的门店是什么原因？白名单用户收到广告和正常投放收到广告的用户的逻辑是不一样的，白名单收到广告不一定显示最近的门店。如果是正常投放的广告，用户收到后，poi会显示离用户最近的门店。
 广告添加了白名单用户，白名单用户收到广告产生的曝光、点赞等数据会扣费吗？白名单配置用户突破广告定向限制，产生的曝光及点击数据会记录到广告投放数据中，但不计算扣费。
 为什么广告选择的自定义投放时段是18：00-24:00，当日10:00查看广告状态是投放中？广告投放状态是按投放开始日期和结束日期来展示的，不在投放时段，广告实际是不会产生曝光消耗的，请放心投放。
 
 我投放的广告会一直出现在朋友圈吗？满足广告定向条件的用户，将会在朋友圈第5条feeds的位置看到广告，随后广告将随时间轴沉淀。
 用户看见广告后，若在24小时内没有对广告进行过点赞或评论操作，广告将消失；如参与点赞互动的广告，将会在朋友圈长期保留。`,
  169: `哪里可以看优秀广告案例？微信广告优秀案例可
 点击查看
 哪些广告位的投放效果比较好？选择哪个广告位投放广告取决于实际投放需求。建议前往官网查看微信广告不同广告位（朋友圈广告、公众号广告、小程序广告）介绍，同时也可通过微信广告官网-最新动态查看行业解决方案，选择适合需求的广告位进行投放，详细介绍可
 点击查看
 认证主体已修改，为什么广告主后台显示还是旧主体？如果已经完成新主体的微信认证，建议在
 微信广告投放平台
 -广告主后台点开发票页面，系统会自动拉取微信认证的主体信息进行同步。`,
  170: `什么是附近推广告？投放费用是多少？附近推是一款针对本地小商户小预算、低成本、简单操作、持续不断引流到店的诉求，提供的以发放优惠为主的全套解决方案，目前已开放客户自行选购投放。
 附近推售卖策略及自助投放指引可
 点击查看
 同一个微信号可以支持开几个账户？目前暂无数量上限限制。
 附近推开户，需要先注册微信公众号和完成公众号认证吗？个人微信号、QQ号均可投放，无需注册公众号。
 同一个营业执照主体最多可以开通多少个账户？目前暂无数量上限限制。
 境外&港澳台的法人可以申请开通附近推吗？境外&港澳台法人身份证可申请开通账户，但对应主体的营业执照必须是国内营业执照。
 许可证店铺名称（营业执照）与广告主开户名称不一致怎么办？开户审核团队会核实门店名称和企业名称之间的关系，是否是门店直接运营公司，或者门店背后的母公司之类。但如果门店与企业没有任何联系，甚至运营行业都不一样，是会驳回的营业执照或经营许可证注册企业需与广告主名称有关联或一致。
 例如，门店名称是麦当劳，营业执照是金拱门，是可以的。
 开户审核不通过，因资质不齐全被驳回，怎么补充？在后台选择对应行业，有补充行业资质的入口，可以把资质拼接成长图再上传（上下拼接），目前没有单独补充资质的入口。
 账户审核通过后，支持修改账户信息吗？账户审核通过后，暂不支持修改信息。账户未审核通过前，支持驳回修改信息；账户审核通过后如需更改信息，广告主可选择重新开通账户。
 商家认证信息审核通过后，支持修改行业吗？商家认证信息审核通过后，暂不支持修改行业。商家认证提交前有加强二次提醒，请务必确认无误后再提交；商家认证信息未审核通过前，如有需要可以在商家认证界面直接修改行业信息。
 注册附近推商家名称&商家介绍最多可支持多少个字？商家名称最多15个字，商家介绍最多120个字。
 账户驳回提示需要提供商标，但客户只有TM标，能否替代商标使用？暂不支持，目前商标只支持使用R标。
 附近推后台是否支持删除账户或广告？目前暂不支持删除账户或广告。
 提交的资质为复印件被驳回，怎么处理？请重新上传资质原件，或者是复印件加盖公司鲜章。
 同一个账户最多支持绑定几个管理员？同一账户最多可支持绑定5个管理员（含广告主在内）。
 成功添加管理员后，广告主可取消授权吗？可以，广告主在账户内删除该管理员即可。
 新增的管理员拥有什么操作权限？新增的管理员可以协助账户提交审核、创建广告投放、充值、查看广告数据。
 附近推广告如何开票？附近推发票支持开具普通发票和增值税专用发票。如需申请开票，请点击以下链接查看所需信息并提供给我们申请开票可
 点击查看
 附近推怎么申请退款？若附近推申请开户失败，广告是未开始或已结束的状态，可申请退款。请在账户信息-余额退款 操作退款申请。
 退款原则为 “原路退回”，即退款到充值时使用的微信账号（若是绑定银行卡支付，则原路退回银行账户中）。
 注：（暂停广告也需等到广告结束时间到后才可操作退款申请）
 非原路退款流程：
 请参照以下格式将退款资料发送到微信广告官方客服邮箱：wxad@tencent.com
 邮件主题：微信广告附近推退款申请
 邮件正文
 账户名称：
 账户ID：
 申请退款金额：
 退款原因：
 发票情况：未开票 / 已退票
 退款资料：
 退款申请书 （
 点击查看
 ） 
 退款银行账户证明（
 点击查看
 ）
 营业执照扫描件/复印件 
 申请人身份证扫描件/复印件
 充值凭证
 账户余额截图
 多开户之后可以批量创建广告/审核/退款/开票吗？不支持，多开的每一个账户都是独立个体，需单独操作创建广告/审核/退款/开票。`,
  171: `视频号如何推广？视频号推广&直播推广介绍文档可
 点击查看
 视频号直播/直播预约是否支持竞价购买？移动端已全量支持视频号直播/直播预约竞价购买。
 微信广告自助投放系统是否支持视频号推广竞价购买模式？微信广告投放平台
 已支持视频动态/视频号直播竞价购买。
 介绍文档可
 点击查看
 视频号推广支持服务商绑定或授权多个运营人员投放吗？如通过[视频号推广]小程序投放端投放需由关联微信号登陆操作，暂不支持授权其他微信号登录后台。
 视频号推广自助开户用户，支持对公充值吗？视频号推广如需对公转账，请按以下内容邮件至wxad@tencent.com
 邮件标题：客户名称 + 推广视频号对公充值
 邮件内容：
 1、打款完成后，提供打款回执
 2、需要充值的视频号名称（需要完全一致）+视频号主页截图（截图需包含视频号名称）
 3、充值金额
 线下打款的银行账号：
 北京腾讯文化传媒有限公司
 招商银行深圳威盛大厦支行
 110913184610708
 特别提醒：
 如采用对公充值流程，退款则不支持自助退款需按人工退款流程另行申请。
 为什么在视频号后台申请了退款，但系统没有显示退款动态进度？在首页点击账户金额进入退款页面，点击退款按钮进入退款流程，发起退款后退款将在48小时内审核，审核通过后2-7个工作日退回对应充值账户。如退款按钮置灰则说明流程已在进行中，请留意关注后续账户余额变动。具体可
 点击查看
 温馨提示：以下情况暂不支持线上自助退款，需线下退款：
 当账户中有广告未结束投放且仍有余额
 有尚未退回的发票（需退回已开发票）
 发起退款后24小时内
 若对公转账，则退款无法走自助退款，也需要走线下申请退款流程
 一个企业主体能申请多少视频号推广账户？申请开通视频号暂时是没有限制。但是后续需要企业认证，目前只能使用公众号关联认证（一个公众号认证一个视频号）或者线上认证（线上认证一个主体暂时只能认证10个视频号）。`,
  150: `为什么我的桌面端朋友圈出现了广告？目前桌面端朋友圈广告已开放首发招商，根据合约招商规则，桌面端场景不会再出现任何非招商广告，如果你遇到该类问题，请反馈微信号给到我们，我们将推动内部排查；
 为什么我还体验不到桌面端朋友圈功能？仅Windows微信3.4.5及以上版本版本可以看到本形态，Windows低版本和Mac版本用户均无法收到本形态，可更新至Windows最新版本体验朋友圈功能。
 桌面端朋友圈广告目前的售卖模式是怎样的？桌面端朋友圈广告目前仅支持合约招商合作，如需了解合约招商文档&售卖政策，请咨询微信广告对应行业运营经理。
 桌面端朋友圈广告目前支持哪些形态能力？桌面端朋友圈广告目前仅支持合约首发招商广告投放，如需了解合约招商文档&售卖政策，请咨询微信广告对应行业运营经理。
 如果我不想看朋友圈广告，可以屏蔽吗？桌面端朋友圈的广告的负反馈体验与移动端一致，如果用户对当前展示广告不感兴趣，可以点击右上角“广告”按钮选择关闭此条广告。
 桌面端朋友圈广告支持合约售卖吗？桌面端朋友圈广告目前已开放合约招商合作，如需了解合约招商文档&售卖政策，请咨询微信广告对应行业运营经理。
 我是否可以只投放桌面端朋友圈广告？桌面端朋友圈广告目前开放的合约首发招商合作，即为只针对桌面端朋友圈场景投放，如需了解合约招商文档&售卖政策，请咨询微信广告对应行业运营经理。
 我投放朋友圈广告一定会通投到桌面端朋友圈里吗？支持屏蔽桌面端朋友圈广告位投放吗？目前桌面端朋友圈广告已开放首发招商，根据合约招商规则，桌面端场景不会再出现任何非招商广告。因此目前投放朋友圈广告，不再会出现通投到桌面端朋友圈里的情况。`,
  173: `广告支持哪些充值方式？微信广告目前充值支持微信支付、网银支付与银行转账三种充值方式，充值流程介绍可
 点击查看
 充值了为什么迟迟不到账？广告主通过银行转账充值的功能已升级，如果是使用新的收款账号转账，无需提交转账凭证，预计一天内到账；若超过1天未到账，可通过微信公众号[微信广告助手（ad_helper）]输入“人工”在线反馈处理。
 若通过原有收款账号转账充值，需在充值页面提交“转账凭证”（提交路径：账户管理-财务管理-充值），提交后将在3个工作日内完成凭证审核与充值。
 为什么充值按钮是灰色的不能点击？若广告主账户已绑定服务商，不支持自助充值，请联系已绑定的服务商进行充值后划账。
 转账凭证怎么提交？ 若通过原有收款账号转账充值，需在充值页面提交“转账凭证”（提交路径：账户管理-财务管理-充值），提交后将在3个工作日内完成凭证审核与充值。
 具体可
 点击查看
 充值错了怎么办？如果充值错误，请提供转账凭证/充值记录+广告主appid通过微信公众号[微信广告助手（ad_helper）]输入“人工”在线反馈处理。`,
  174: `如何开具发票？你需要提交开具发票的申请，在【广告主】-【账户管理】-【发票管理】，填写相应信息即可，完成后提交。
 具体可
 点击查看
 申请发票后，多长时间能收到？1、常规流程：发票申请需在充值次月1日前完成（发票信息在充值次月1日前是审核通过状态），申请完成后，腾讯会在每月月初核实并开具发票，每月15-20日顺丰邮寄发票（如遇周末，顺延至下个工作日）。邮寄费用由腾讯承担。
 2、逾期补开：如果逾期填写发票申请需补开，请登录公众平台，在 广告主-账户管理-发票管理 页面申请开具发票。
 <举例：4月15日充值的金额，如果在5月1日前发票信息已是审核通过状态，发票会在5月15日-5月20日邮寄。如果发票信息是在5月1日后通过审核，或发票充值充值早于4月1日，需申请补开发票。>
 3、因系统原因导致无法自助补开的，可联系公众号「微信广告助手」登记，由人工登记补开。
 发票抬头系统默认，可以修改吗？广告主系统发票抬头默认与认证主体名称一致，暂不支持修改。
 更多发票问题可
 点击查看
 已修改公众号认证，如何修改发票抬头？若广告主主体信息变更，需修改发票抬头。请先至“微信公众平台 - 设置 - 微信认证”修改主体信息。
 认证主体修改后，可进入 广告主-账户管理-发票管理 页面查看最新发票抬头信息。
 发票开错了，如何退回？请按以下指引退回发票：
 发票退回地址：深圳市南山区高新技术园中区科苑大道讯美广场1号楼7层
 收件人：马硕翌
 联系电话：0755-86013388-86091
 退回发票时，请务必同时提供以下信息，否则无法处理
 账户名称+微信号+退票原因+联系人+联系方式
 广告主合同怎么获取？如有对接的行业运营经理或渠道运营经理，请联系对接人申请。
 
 
 如无对接人，请下载
 合同模板
 填写后发送至wxad@tencent.com 申请。
 
 
 邮件标题：微信广告主纸质合同申请+广告主APPID
 
 
 内容：
 
 
 1.签约主体（需与认证主体一致 ）：
 
 
 2.联系电话： 
 
 
 3.合同起止日期：
 
 
 4.对账周期：
 
 
 5.贵司先盖章/腾讯先盖章：
 如何发起询证函流程？1、请联系对接的销售，由销售联系财务发起询证函流程
 2、若没有对接的销售，请发送到联系邮箱wxad@tencent.com`,
  175: `如何申请退款？ 未绑定服务商的
 微信广告投放平台
 广告主退款指引可
 点击查看
 若已绑定服务商，请联系服务商咨询退款。
 申请退款后，多长时间能收到退款？退款原则为 “原路退回”，即退款到充值时使用的微信账号（若是绑定银行卡支付，则原路退回银行账户中）、网银账号，处理周期为 7 个工作日。
 非原路退款-客户方要求退回指定银行账户中（若原充值账户无异常情况，建议申请原路退款）退款处理周期需 30 个工作日。
 退款指引可
 点击查看
 个体工商户无公章，怎么申请退款？若个体工商户无公章证明，可由法人代表签字按手印代替，并提供法人身份证正反面复印件/扫描件。
 其他退款资料可
 点击查看
 广告主账户主体已注销，如何申请退款？如果主体已注销，请提供注销证明，无公章证明，可由法人代表签字按手印代替，提供法人身份证正反面复印件/扫描件。
 并提交链接中其他所需资料发送至wxad@tencent.com 申请退款。
 其他退款资料可
 点击查看
 返佣商品如何退款？返佣商品退款指引可
 点击查看
 电商保证金如何申请退款？外链电商广告主可申请保证金退款，应在系统发起退款申请，电商保证金缴纳及退款流程可
 点击查看
 公众号被封/已迁移/无法登陆/线上申请退款失败，不能操作自助退款怎么办？请将所需资料发送到官方邮箱wxad@tencent.com 申请退款。
 退款所需资料可
 点击查看`,
  152: `公众号流量主功能如何申请？公众号关注用户达到 
 500
  人且符合平台运营规范，运营者可提交申请，审核通过后即可开通流量主功能。
 申请路径： 微信公众平台 → 流量主 → 申请开通 → 同意协议 → 选择要开通的广告位 → 提交
 温馨提示：开通流量主功能后请及时补充财务资料，以免影响结算
 公众号流量主基础介绍及开通流程可
 点击查看
 如何开通公众号互选广告位？公众号互选广告是流量主和广告主通过微信广告平台双向选择、自由达成广告合作的一种投放模式。
 流量主根据账号自身粉丝数量等情况，自主定价；广告主通过系统发起合作需求后，流量主根据自身意愿，接受或拒绝合作。
 目前属于邀请制，接收到邀请的流量主可选择开通互选广告广告位，暂不支持申请。
 公众号互选广告流量主合作文档介绍可
 点击查看
 小程序流量主功能如何申请？ 小程序在累计独立访客（uv）>1000，无刷粉行为且未曾有严重违规记录的情况下，开发者可进入微信公众平台小程序后台，点击左侧面板“推广-流量主”，满足开通门槛的小程序开发者直接点击“开通”即可创建相应的广告位。
 温馨提示：开通流量主功能后请及时补充财务资料，以免影响结算。
 小程序流量主基础介绍及开通流程可
 点击查看
 视频号流量主功能如何申请？创作者加入视频号互选平台需要符合以下条件：
 视频号有效关注用户 1 万及以上
 成功完成实名认证及视频号认证
 持续发表原创优质内容
 满足以上条件的创作者将会在移动端收到私信邀约。通过点击私信中的H5链接，创作者可快速了解视频号互选平台核心能力，一键同意邀请后即可成为视频号流量主。
 另外，创作者也可在 PC 端登陆
 视频号助手
 ，进入“创作者变现”页面，点击“立即开通”成为流量主。
 视频号流量主基础介绍及开通流程可
 点击查看
 开通流量主功能需要认证吗？任何企业或个人类型的公众帐号，公测期间关注用户数超过500，都可以申请成为流量主，未经微信认证的政府和媒体类型暂不支持申请流量主功能。
 流量主审核需要多长时间？请先确认流量主开通账号类型后对应处理时效：
 1、公众号流量主：
 流量主功能开通时间：即时开通。
 财务资料审核时间：7个工作日。
 2、小程序流量主：
 流量主功能开通时间：即时开通。
 财务资料审核时间：7个工作日。
 广告组件审核时间：1个工作日。
 温馨提示：上述审核处理时效不包含周末及节假日，如遇周末或节假日暂不处理，顺延至下一个工作日。
 流量主开通时错误提示：填写的姓名或身份证与公众号主体信息不一致怎么办？此项报错意味着选择了账户主体（个人类型）收款，但是新填写的“开户名称”或“开户人身份证号”与帐号注册主体的姓名或身份证信息不一致，请仔细核对两边信息，保持信息一致后再尝试提交。
 企业主体开通流量主时，页面默认结算信息，且呈灰色不可修改怎么办？同一结算主体必须提交一致的结算信息，该结算主体已有公众号/小程序账号开通了流量主功能，已提交的是当前页面默认的信息，因此默认已存在的信息无法修改。
 如信息有误或需提交不同的结算信息，请先登录已开通流量主账号后台提交结算信息变更申请，待完成变更后再登录新的帐号补充结算信息。
 具体操作如下： 进入流量主页面->「财务管理」->「收入结算」->「结算信息」，点击右侧“修改”点击右侧“修改”按钮进入结算信息变更页面，提交完成进入审核状态后，会在7个工作日完成审核。 
 更多流量主结算问题可
 点击查看
 境外认证的公众号可否申请流量主功能？目前境外认证的公众帐号，暂不支持申请开通流量主功能。
 微信广告小游戏优选合作计划如何申请？如有意向，请在“微信公众平台-流量主-合作计划”报名入口提交资料，更多小游戏优选合作计划介绍可
 点击查看
 广告组件审核驳回原因如何查看？小程序流量主登录微信公众平台，进入流量主后台，在“广告位管理”处可查看驳回详情。`,
  176: `流量主可以多月合并开票结算吗？企业流量主发票请按结算单金额按月开具。
 当合并多月结算单开票时，请注意：
 使用增值税专用发票
 2019年8月及之前月份的结算单可以合并开，2019年9月至2020年5月的结算单可以合并开，2020年6月及之后月份的结算单可以合并开
 相同抬头的发票可以合并开
 每月的结算单必须分别盖章确认，与发票一同邮寄给腾讯公司
 注：请参考当月结算单展示的腾讯公司名称，开具相应信息的发票。
  企业开票信息是什么？2020年6月起，腾讯公司与流量主的合作主体由“深圳市腾讯计算机系统有限公司”变更为“腾讯科技（深圳）有限公司”。建议在开具发票时，参考
 当月结算单展示的腾讯公司名称
 ，再开具相应信息的发票。
 信息变更前（2020年5月及以前）
 公司名称：深圳市腾讯计算机系统有限公司
 发票类型：增值税专用发票
 纳税人识别号：91440300708461136T
 开户行及账号：招商银行深圳威盛大厦支行 817282299610001
 开票地址电话：深圳市南山区粤海街道麻岭社区科技中一路腾讯大厦35层 0755-86013388
 货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
 信息变更后（2020年6月及以后）
 公司名称：腾讯科技（深圳）有限公司
 发票类型：增值税专用发票
 纳税人识别号：9144030071526726XG
 开户行及账号：招商银行深圳威盛大厦支行 817281823910001
 开票地址电话：深圳市南山区高新区科技中一路腾讯大厦35层 0755-86013388
 货物或应税劳务名称：可选择“信息技术服务费”、“技术服务费”、"微信推广费”、“服务费”等相关类目
 注：请参考当月结算单展示的腾讯公司名称，开具相应信息的发票。
 工商更名如何开票?若结算企业已工商更名，之前未开票的结算单可使用更名后企业名称开票，请勿修改原结算单内容，结算单加盖更名后企业公章即可。
 申请结算需邮寄的资料如下:
 1. 增值税专用发票发票联及抵扣联，须加盖公司发票专用章。
 2. 与发票对应月份的结算单，须加盖企业公章。(加盖与开票企业名称一致的公章)
 3. 工商部企业更名证明复印件。
 建议企业工商更名时，及时将名下流量主帐号的结算账户信息申请修改为新名称对应的银行账户，完成变更后的结算月份均可使用新名称开票。`,
  177: `流量主如何申请结算？请根据不同账号主体类型结算要求操作：
 1、企业账号流量主
 企业账号需要按结算单金额开具增值税专用发票，与结算单一并邮寄至指定地址，腾讯公司收到完整的合格的资料后将在30个工作日内将结算金额打入对应的结算银行账户。
 企业流量主申请结算所需邮寄资料：
 1）邮寄增值税专用发票发票联及抵扣联，须加盖公司发票专用章。
 2）邮寄与发票对应月份的结算单，须加盖公司公章。
 2、个人账号流量主：
 个人账号无需邮寄发票，腾讯公司将在结算日后15个工作日内将结算金额打入对应的结算银行卡，并代扣代缴个税。
 流量主收入每个月什么时候结算？微信广告按半月结算，无最低金额门槛，无需手动提现。结算前，需要先填写结算用的财务资料。流量主开通后请立即补充财务资料，否则会影响结算。
 腾讯公司将在次月1日和次月15日前（如遇法定节假日，将会推迟），分别对上半月和下半月收入进行结算，并在结算完成后3个工作日内，发送结算单到你的结算单邮箱中。
 例如：12月1日结算11月1日-15日的收入，12月15日结算11月16日-11月30日的收入。
 若你是企业用户，需要按结算单邮件的要求邮寄与结算金额等额的发票给腾讯公司（只接受“增值税专用发票”，不接受“增值税普通发票”）。腾讯公司将在收到正确的发票及结算单后30个工作日内将结算金额打入你的结算银行账户。
 如你是个人用户，无需邮寄发票，腾讯公司将为你代扣代缴个税，并接受税务局委托，代征增值税和附加税费，在结算日后15个工作日内将最终结算金额打入你的银行卡。
 一次结算会依次经历四个结算状态：结算中、已结算、付款中、已付款。
 更多结算详情可
 点击查看
 未收到结算单是什么原因？如果提交的结算邮箱没有收到结算单，请先核查“财务管理”页的“结算信息”板块，确认结算邮箱地址是否正确。
 如确邮箱地址正确但未收到，可能存在以下情况：
 收件邮箱的垃圾箱规则配置问题，设置了拒收或拦截，建议核查下收件规则设置，将腾讯域名tencent.com设置为白名单。
 公司的邮件系统配置问题，设置了拒收或拦截，建议与公司邮箱IT核实。
  更多流量主结算问题可
 点击查看
 四个结算状态的定义是什么？公众号、小程序、小游戏流量主广告收入一次结算会依次经历四个结算状态：结算中、已结算、付款中、已付款。
 结算中：腾讯公司会在此阶段核验结算信息，并在核验完成后准备结算单。
 已结算：进入此阶段，表明结算单已出具并发送至流量主的结算单邮箱，若未收到，可申请补发。若为企业结算主体，请按结算单的实际收入金额开具发票，并邮寄发票和结算单至指定地址；腾讯公司将核验发票信息，确认无误后进入付款流程。
 付款中：进入此阶段，表明发票已核验完成，款项支付中。
 已付款：进入此阶段，表明款项已付出；各银行具体到账时间有差异，一般在1-3个工作日内到账。
 如有其他疑问，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为你解答。
 更多流量主结算问题可
 点击查看
 如何补发结算单？2019年9月及以后的结算区间可申请补发结算单。
 如需补发结算单，可在“财务管理”页的“结算记录”板块操作，点击需补发结算区间对应的“补发结算单”按钮，即可自助补发。
 每个结算主体每份结算单每月申请补发不超过三次，结算单将在10分钟内发送至结算单邮箱。
 如有更多需求，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为你处理。
 描述内容：需补发结算单月份、账号名称、APPID、结算信息、结算邮箱。
 更多流量主结算问题可
 点击查看
 流量主结算信息有变更，如何修改？ 流量主结算账户信息变更请登陆微信公众平台-流量主页面自助提交变更申请。
 具体操作如下：
 进入流量主页面—财务管理”—“收入结算”—“结算信息”，点击右侧“修改”按钮进入结算信息变更页面，提交完成后将进入审核状态，我们会在7个工作日审核你提交的信息。
 补充财务资料后历史未结算收入还可以结算吗？若流量主未及时补充财务资料，历史未结算的收入将在补充财务资料后自动发起补结。但由于补结流程及时间较长，历史结算区间的结算进度将在一段时间内保持在“结算中”状态。流量主无需焦虑，补结成功后，结算单会下发至对应的结算邮箱的，还请耐心等待。
 温馨提示：因补结流程及时间较长，请务必及时完善财务信息。
 更多流量主结算问题参考可
 点击查看
 补发结算单按钮不可点击是什么原因？2019年9月及以后的结算区间可申请补发结算单。
 当补发结算单按钮不可点击时，意味着对应结算单尚未生成。此时可以关注对应结算记录的状态，若处于“结算中”，那么不可点击是正常的。当状态扭转为“已结算”时，才可申请补发结算单（可参考文章：处于“结算中”状态的原因）。
 若此时结算状态为“已结算”、“付款中”或“已付款”，但仍不可点击；或需要补发2019年9月以前结算区间的结算单，请通过”微信广告助手（ad_helper）“公众号联系我们，在线客服会及时为你处理。
 描述内容：需补发结算单月份、账号名称、APPID、结算信息、结算邮箱。
 委托收款后还可以改回账户主体收款吗？个人主体的账号委托企业账户收款后，不支持改为个人账户收款。
 个人主体的账号委托个人账户收款后，可以再委托账户主体个人收款。
 企业主体的账号委托第三方企业账户收款后，可以再委托账户主体企业收款。
 企业主体的账号委托个人账户收款后，可以再委托账户主体企业收款。`,
  178: `结算单金额为什么与后台数据不一致？ 请确认是否有多个流量主账号。流量主结算单及付款以结算主体为维度，不是以公众号为维度，结算单内所附表格有备注各个帐号对应的收入数据，可与后台数据对齐。
 流量主数据里的ecpm是什么？ecpm:每一千次展示可以获得的广告收入，计算公式为 ecpm = 消耗 / 曝光量 * 1000
 ecpm波动的原因有哪些？eCPM指广告的千次曝光收益，它是收入的核心指标。当我们衡量流量变现的效率时，会将收入和曝光这两个关键指标进行关联，计算eCPM。
 如果eCPM产生较大波动，则与广告主出价、竞争激烈程度、用户点击率均有关。
 影响流量主的广告收入因素有哪些？流量主的广告收入与文章曝光量/页面流量、广告填充率、广告曝光率、计费方式及广告单价均有关联。
 影响流量主收入因素可
 点击查看
 个人流量主如何结算及纳税？若你是个人用户，无需邮寄发票，腾讯公司将为你代扣代缴个税，并接受税务局委托，代征增值税和附加税费，在结算日后15个工作日内将最终结算金额打入你的银行卡。
 根据《中华人民共和国税收征收管理法》及其实施细则等税收有关规定，腾讯公司从2019年11月1日起接受税务机关委托，为个人流量主代征增值税和附加税。
 相关计算方法可
 点击查看
 `,
  154: `小程序流量主操作指引有吗？小程序流量主操作指引可
 点击查看
 公众号流量主操作指引有吗？公众号流量主操作指引可
 点击查看
 流量主怎么启用数据推送功能？ 流量主可在“账户设置”页面添加微信号，扫码后即可绑定推送消息。
 绑定后，可以通过微信广告助手公众号接收广告收入数据日报、财务资料审核结果、流量主违规通知、互选广告通知等，建议绑定。
 具体内容可
 点击查看
 流量主数据是如何统计的？流量主数据统计相关问题可
 点击查看
 流量主收入数据每天什么时候更新？每天上午8点至10点更新昨日收入，微信广告助手平台及流量主服务助手小程序同步更新（如遇问题，可能会延迟至下午）。
 建议在“账户设置”页面绑定数据日报。绑定后，每日10点至12点，微信广告助手公众号将为流量主推送昨日收入概况。
 流量主底部广告展现逻辑是什么？系统会根据广告素材的定向和阅读文章的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告，流量主无需额外操作。
 流量主文中广告展现逻辑是什么？系统会根据广告素材的定向和阅读文章的用户画像，匹配当前状态下最适合展示给用户的广告；流量主可设置文中广告的行业。
 小程序Banner广告展现逻辑是什么？系统会根据广告素材的定向和浏览小程序的用户画像与兴趣，匹配当前状态下最适合展示给用户的广告，广告位置需由开发者自定义。
 为什么我的广告位没有广告展示？广告展示与否与用户有关。
 广告投放时往往会设置人群定向，系统会为用户匹配最适合的广告，若当前无适合该用户的广告，则不会展示。
 若流量主为自己的公众号设置了广告屏蔽规则，就会进一步缩小可供匹配的广告数量，广告的填充率可能受到影响，建议谨慎设置。
 同时，为了保证用户的阅读体验，当文章涉及敏感信息时，也会优化广告的展示逻辑。
 流量主被封，之前的收入还有吗？对于广告展示违规行为，腾讯有权单方视情节轻重对流量主账户采取警告、冻结账号操作权限、扣除广告展示收入、终止广告展示服务、其他等广告展示服务相关的规定中的一项或多项措施，具体收入请以收到的结算单为准。
 公众号流量主违规行为定义及违规处罚内容可
 点击查看
 小程序流量主违规行为定义及违规处罚内容可
 点击查看
 流量主怎么屏蔽广告主？流量主可以在"广告管理"页的"广告屏蔽”板块设置广告主黑名单，支持屏蔽公众号、应用、小程序及小游戏，对公众号全局广告进行屏蔽。
 设置后，名单中广告主的广告将不会出现在流量主的公众号中。如果要取消屏蔽，做删除操作即可。
 具体操作指引可
 点击查看
 
 公众号流量主违规如何申诉？公众号流量主行为规范及处罚可
 点击查看
 如对违规处罚有异议，请使用电脑登录微信公众平台后，在违规处罚通知处发起申诉。
 流量主合同如何申请？如需流量主纸质合同，请按官网指引发邮件申请，申请流程可
 点击查看
 注：流量主纸质合同仅供开票使用，如税局开票不需合同，则不用签订
 小游戏流量主广告金激励计划有吗？为帮助小游戏流量主更好地扩大规模、获得更高广告收益，自2020年11月起实行流量主广告金激励计划，对特定渠道注册用户予以40%广告金激励，即部分流量主相当于最高可获得90%的实际分成。 常规情况下，流量主广告金每半月结算一次，并在第二个月的对应时段入账。
 详细介绍可
 点击查看
 如有任何问题，可通过“做个小游戏”公众号、小游戏数据助手客服、“微信广告助手”公众号或发送邮件至minigame@tencent.com/wxad@tencent.com联系微信团队。
 小游戏广告变现解决方案是什么？微信广告目前已面向小游戏提供包括 Banner 广告组件、激励式广告组件和互选定制广告三套广告变现解决方案。
 具体可
 点击查看
 快周转金如何充值？流量主需要先完成“流量主服务助手”小程序注册。
 在每次结算发起后，腾讯公司未收到收入发票前，流量主可使用快周转金总金额的70%进行充值，但不支持提现。
 在腾讯公司确认发票无误后，可使用剩余30%金额进行充值，支持对余额进行多次提现。
 温馨提示：
 -快周转金可充值到其广告主账户或绑定服务商的子客账户，满足多路径投放需求
 -流量主可任意次数充值/提现，灵活高效
 小程序广告组件应用规范有哪些？Banner广告 / 格子广告 / 视频广告组件应用规范可
 点击查看
 
 广告组件审核会影响线上广告展示吗？流量主在发布版本后会触发广告组件审核，若线上本身是有广告展示的，即上一次广告组件审核为“通过”，那么小程序再次进入广告组件“待审核”状态，也不会影响到线上广告的正常展示。
 小程序广告组件应用规范可
 点击查看
 广告组件是否可在H5页面接入？小程序广告组件当前仅支持原生页面的接入。
 banner等组件是否可进行尺寸调整？Banner 广告不允许直接设置样式属性，默认宽度为100%（width: 100%），高度会自动等比例计算，因此开发者可以设置广告外层组件的宽度调整广告的尺寸。 
 广告外层组件的宽度不允许小于300px，当宽度小于300px时，Banner 广告的宽度会强制调整为300px。
 详情可
 点击查看`,
  18: `如何成为腾讯广告服务商?感谢你对腾讯广告的支持与厚爱，腾讯广告服务商准入规则参考：
 以下标准为充分非必要条件，腾讯公司将根据实际情况对服务商进行筛选。
 1、公司注册资本100万以上，成立时间超过1年且在广告行业领域内的从业时间不低于1年，具有独立法人资格，具备广告相关合法经营权的单位；
 2、良好的公司经营能力：有固定成熟的互联网运营团队，拥有固定的办公场所且面积不得少于100平方米，具备开展广告代理业务的办公条件；拥有具备一定专业水平的市场策划、销售及运营人员，公司员工人数不得少于20人。
 3、具有丰富企业客户服务经验，符合区域定位和布局，其企业过往业务与广告业务相关且高度契合优先；
 4、制定切实可行的商业计划，服务商需季度完成对应的业绩，一个季度未达成，腾讯有权终止合作，并暂停服务商账户权限；
 5、企业具有良好的形象和信誉，有明确的合作动力和诉求，愿意与腾讯广告一起长期开拓效果广告市场；
 6、在2年内，不存在任何因违反《广告法》、《互联网广告管理暂行办法》等相关广告监管领域法律法规而受到过行政处罚；
 7、不存在任何未履行债务及任何未按照已生效的司法判决/行政处罚支付/缴纳相关款项的情况。
 服务商进驻流程可
 点击查看
 附近推是否支持服务商投放？目前附近推已全面开放服务商售卖，若为腾讯广告现有服务商可联系渠道经理沟通咨询，若为新服务商申请售卖可邮件联系 ：v_xmyyzheng@tencent.com 进行咨询。
 申请服务商时，资质无法上传后台报错怎么办？1，建议更换浏览器或刷新网页，还是不行的情况下可尝试更换电脑重试。
 2， 如果以上处理方法都无法解决该问题，请通过以下渠道反馈处理：
 
 广告主绑定服务商时，为什么提示需先与腾讯营销中心终止服务？如你想与腾讯广告服务商合作，须先申请终止营销中心的服务。请联系你将绑定的服务商，请其联系对应的渠道经理发送邮件到客保邮箱AMS_QD_Helper@tencent.com 做申请。
 邮件的主题：【客保】绑定申请函地址变更+申请附件
  广告主绑定服务商时，为什么提示需先拒绝smb客保？广告主需自助登录微信公众平台-广告主-消息公告 处拒绝客保后，服务商方可发起绑定。
 广告主后台为什么没有服务商授权的入口？ 需由服务商发起授权申请，广告主登录微信公众平台-广告主功能的”服务商授权“中进行授权确认，方可完成授权绑定。
 为什么无法授权绑定广告主？服务商发起授权，需确认以下内容：
 1）广告主账号已申请开户成功；
 2）请在广告主账号开户成功6小时之后发起绑定；
 3）该公众帐号解绑上个服务商未超过24小时，暂不能绑定；
 4）一个广告主账号最多可绑定50家服务商，如广告主已绑定50家服务商，需至少与其中一家服务商解除绑定后，方可由其他服务商发起绑定
 广告主授权服务商后，还支持自助创建广告吗？如果广告主已授权绑定服务商，不支持自助创建广告，请联系绑定的服务商进行创建。
 服务商如何取消与客户的授权？若广告主客户与服务商取消合作，须撤销授权，可由广告主客户方发起授权撤销申请，服务商在腾讯广告服务商系统可以同意撤销授权。若服务商在7日内未处理，系统将自动解除授权，广告主客户撤销授权成功。
 
 
 详细介绍可
 点击查看
 广告主绑定服务商后，如果不想绑定了，可以立刻解绑吗？广告主绑定服务商24小时后可发起解绑申请。
 广告主发起解绑，多长时间可以解除服务商绑定？广告主客户方发起授权撤销申请，服务商在腾讯广告服务商系统可以同意撤销授权。若服务商在7日内未处理，系统将自动解除授权，广告主客户撤销授权成功。
 为什么已解绑服务商，仍收到某广告主的消息推送？如果是广告主需取消消息推送，请登录广告主后台，在消息推送处删除绑定微信号（路径：广告主- 工具箱 - 托管助手）。
 如果是服务商运营人员需取消消息推送，请按以下指引：
 1) 联系服务商管理员删除该运营人员绑定的广告主；
 2) 登录广告主后台，在消息推送处删除绑定微信号（路径：广告主- 工具箱 -托管助手）。
 广告主客户授权服务商后，自己有权限操作广告投放吗？广告主授权服务商后，由服务商代为充值及投放，系统将会限制广告主的相关操作，如充值、新建广告、服务商创建的广告修改、删除广告等操作。
 广告主若需要与服务商共同协作投放广告，可与服务商沟通，由服务商分配服务商运营角色，通过广告服务商系统跳转至广告主页面进行广告投放。
 如何更换超级管理员？如需更换/解绑超级管理员需由对接腾讯广告服务商的渠道经理发送邮件正式申请，请联系渠道经理咨询流程。
 如无法联系渠道经理可通过以下方式咨询：
 ①点击腾讯广告投放平台（ad.qq.com）右侧悬停-客服图标点击咨询[腾讯广告]人工在线；
 ②进入e.qq.com，点击页面右下角QQ剪影图案，弹出售后咨询，直接与腾讯官方在线客服对话；
 ③微信搜索服务号“腾讯广告”关注后直接对话，或者点击“获取帮助”-“在线咨询”
 服务商名称如何修改？如需修改服务商名称请联系你对接的渠道经理发起申请。
 一个微信账号可以绑定多家服务商吗？一个运营人员微信号可关联50家服务商账户；若超出限制后需更换其他关联账号，请解除绑定后操作。
 为什么申请退款提示退款失败？如果发起退款时，子客账户仍有投放中的广告，退款验证时，如余额实际少于操作退款时的金额，则会退款失败。建议减少退款金额再操作。
 广告主在授权服务商之前充值了，充值的金额服务商支持使用吗？不支持，授权服务商之前，客户自行充值的账户余额，服务商不可支配使用。
 广告主可以选择将自行充值的金额进行退款申请或撤销服务商授权后进行自行投放使用。
 退款流程可
 点击查看
 如果广告主绑定了多个服务商，服务商会看到彼此的余额及广告吗？请放心，每个服务商划账的广告投放金额、创建的广告仅服务商自己可见，多个服务商之间不可见，保证了各个服务商的安全性和隐私性。
 申请退款后多长时间可以到账？ 发起退款申请后，预计 6 小时内完成金额退回。
 服务商如何申请退款？服务商申请退款时，需将广告主的账户余额退回至服务商账户后，再向对应的渠道销售提出邮件申请，邮件中请附带以下资料：
 服务商名称及服务商 ID
 服务商账户后台余额及充值记录的截图
 退款金额与账户余额一致的对公退款申请书（
 点击查看
 申请书）
 申请人身份证正反面复印件及营业执照复印件
 退款账户（盖章件）：与公众号认证主体一致的开户名、银行账号及开户行（精确到支行)
 联系人、联系方式、办公地址及办公电话
 注：服务商退款需先将所有名下子客的账户余额退回到服务商，方可申请退款，如有疑问，请联系对应的渠道销售进行咨询，复印件资料均需加盖公章。退款处理周期为 30 个工作日，感谢你的支持。
 房地产行业广告主如何查找服务商进行投放？为了提升广告主投放效率，帮助行业更好发展，腾讯广告2019年在房产行业试行“区域唯一推荐服务商制度”。我们选择的服务商具有丰富的广告投放经验，能为你提供系统的广告投放解决方案，有效提高广告效果，节约你的精力。我们建议你在绑定服务商后进行充值。
 如果你选择通过服务商提供充值投放服务，可以有两种方式选择/联系服务商：
 1、主动联系服务商：
 登陆腾讯广告官网（可
 点击查看
 ），选择“区域房产”行业和你所在的区域，查询/选择具备腾讯广告房地产行业资质证书的服务商，通过官网提供的联系方式联系他们。
 2、服务商联系你：
 发送邮件至wxad@tencent.com 并抄送 fczush@tencent.com，在邮件中留下公司名称和你的电话号码，具备腾讯广告房地产行业资质证书的服务商会在2个工作日内与你电话联系。
 成为服务商子客是否需要交服务费？服务商向子客户提供咨询、优化账户等服务，有可能收取子客户一定的服务费。具体费用金额，需和服务商进行协商，腾讯广告对此没有特殊规定。
 服务商帮助子客添加门店时，为什么提示无权限？目前本地推广门店创建需要通过微信广告投放平台（mp.weixin.qq.com）自行创建，不支持服务商系统跳转创建。
 服务商如何对接Marketing API？Marketing API是腾讯广告面向开发者提供的全面技术及数据支持，全方位实现基于腾讯广告平台的自动化营销和高效管理。API提供了完整的广告投放、目标人群管理、广告数据洞察等能力，腾讯广告服务商可以根据业务需要来选择相应的功能进行接入。
 
 
 详细操作指引可 
 点击查看
 
 
 对接Marketing API过程中，如果涉及API无法调通，报错无法解决的问题，技术咨询可进入腾讯广告开发者专区点击页面右下角侧“问号Logo”，通过反馈中心进行反馈，会有专人及时处理，感谢你的理解与配合!
  返点政策可以咨询哪里？服务商帐户资质审核通过后，可联系对应的渠道经理进行了解。
 如无法联系到渠道经理，可通过以下方式：
 ①点击腾讯广告投放平台（ad.qq.com）右侧悬停-客服图标点击咨询[腾讯广告]人工在线；
 ②进入e.qq.com，点击页面右下角QQ剪影图案，弹出售后咨询，直接与腾讯官方在线客服对话；
 ③微信搜索服务号“腾讯广告”关注后直接对话，或者点击“获取帮助”-“在线咨询”
 腾讯广告服务商其他常见问题可
 点击查看`,
  20: `广告素材涉及侵权如何投诉？如广告素材涉及侵权问题，请发邮件至ads_service@tencent.com 申诉，所需资料请
 点击查看
 合约空耗处罚，如何申请解除？申请方式：由广告主或广告主绑定的服务商提交申请至官网邮箱：wxad@tencent.com进行评估
 邮件需说明：
 1. 申诉理由
 2. 需要撤回的违规次数，并列出对应违规广告计划的cid
 3. 广告主名称
 4. 广告主原始id
 5. 广告主appid
 6. 广告主uid
 广告素材违规如何投诉？1、朋友圈广告：请提供投诉广告的公众号名称和广告外层截图；
 2、公众号广告：请确认广告是位于哪个公众号中；如果可以，请尽可能提供点击广告位图片后跳转的链接。
 可通过微信公众号[微信广告助手（ad_helper）]输入“人工”在线反馈处理。
 如何投诉服务商？请提供以下信息以便快速定位及解决问题，感谢你的配合。
 ① 广告主名称及原始ID；
 ② 广告主侧相关负责人、联系电话及联系人邮箱；
 ③ 服务商公司全称及广告主后台关联服务商截图；
 ④ 具体背景及原因说明；
 ⑤ 投诉诉求；
 ⑥ 请尽可能提供有效证明，如：合同、打款证明、对话截图、后台充值记录；
 针对微信广告投放素材如何调查取证？不同部门调证方式如下，腾讯将积极配合有关部门调查：
 1. 国安、检察院、部队、证监会调证由安全管理部处理，请上门调取，暂不接受邮寄方式。
 上门调取地址：深圳市南山区深南大道9996号松日鼎盛大厦附楼一楼安管司法协作室。
 2. 公安、警察调取证据，需要到深圳网监调证室办理，暂不接受邮寄方式。
 上门调取地址：深圳市南山区高新南六道16号泰邦科技大厦六楼网监调证中心。
 3. 法院、央行、银监会、保监会、文化执法大队、食品药品监督管理局、工商及市场监督管理局等权力机关调证由法务部处理，请以上门方式调取，取消邮寄方式调取。 
 上门调取地址：深圳市南山区深南大道9996号松日鼎盛大厦附楼一楼法务调证室。
 通过微信广告购买商品无法联系商家如何投诉？ 请按照以下格式准备完整信息，*为必填项，前往公众号“微信广告助手”反馈，请尽可能协助提供有效信息以便快速定位及解决问题，感谢你的配合。
 
 ① *下单姓名：
 
 ② *下单手机号： 
 
 ③ * 下单微信号（微信昵称下方英文字母开头的微信号）：
 
 ④ *联系电话：
 
 ⑤ *请确认是否是在朋友圈/公众号/小程序看到的广告、看到广告的具体时间、购买的具体时间（如不确定，请尽可能提供一个大致时间范围）、购买的产品名称
 
 ⑥*需求：退货/换货/联系商家等
 
 ⑦*请尽可能提供：购买的产品名称、广告落地页截图/广告链接、下单后收到的相关订单信息、快递包装信息、短信发货截图等（通过小程序购买的，小程序的名称以及支付的订单截图请提供）；`,
  29: `如何投放微信广告？微信广告支持自助投放，广告主只要符合微信广告准入行业要求，并开通相应账户功能，就可投放微信广告。
 详情请参考： 
 微信广告开放行业分类及资质
 如何开通广告主功能？已通过微信认证的公众号, 可到公众平台申请开通广告主服务。开通入口在公众平台左侧菜单栏【推广】->【广告主】。
 广告主申请提交后，审核需要多久？账户提交后，工作日24小时之内审核，周末/节假日48小时之内审核。
 申请广告主，如何选择所属行业？根据公众号及账号主体运营内容选择行业类别，并提供相应资质材料（包括但不限于营业执照、行业资质等证明文件）。
 
 具体可参考
 《微信广告开放行业分类及资质》
 。
 广告上线后，可以修改或取消吗？排期广告：
 
 朋友圈及公众号排期广告在上线前，支持随时修改；广告上线后，不支持修改。
 竞价广告：
  公众号竞价广告在上线前或投放中，支持随时修改。朋友圈竞价广告在上线前支持随时修改，投放结束前2小时内不支持修改。
 点击了解
 具体修改操作指引
 广告提交后，审核需要多久？广告审核时效？
 提交后，工作日24小时之内审核，周末/节假日48小时之内审核，如有紧急投放需求，建议预留充足的审核时间。
 广告提交后是否可以催审？
 审核时效内不支持催审，请耐心等待审核结果。如确实有紧急投放需求，请联系您的代理商/渠道经理沟通反馈。
 广告主所属行业未开放，有什么办法推进？对于暂未开放的行业，我们欢迎通过邮件的方式提出申请，我们会基于市场的反馈进行调研和评估，按季度更新我们的准入行业及资质。
 收件地址：wxad@tencent.com；
 
 邮件标题命名规范：【微信广告行业申请】+申请时间+公司名称；
 
 邮件内容需要包含：
 公司名称
 公众号ID
 投放内容
 预算计划
 需要使用的广告产品（朋友圈广告/公众号广告）
 推广目标（品牌活动推广/公众号推广/移动应用推广/本地商户推广/卡券推广等）
 你可以提供的行业资质。
 个人类型公众号可以投放广告吗？已通过组织类型微信认证的公众号即可申请开通广告主服务。
 
 2014年8月26号之前注册的个人类型公众号满足以下三个条件即可申请组织类型微信认证。
 1.没有开通流量主的个人类型公众号；
 2.未纠错过主体信息的个人类型公众号；
 3.未开通个人认证入口的个人类型公众号。
 温馨提示
 ： 2014年8月26号之后注册的个人类型的公众号、已不支持申请微信认证，若你需要申请微信认证，请你重新注册企业/组织类型的公众号。
 申请广告主后，主营行业是否可以修改？你可在投放端后台查看，并提交修改行业归属申请，提交审核即可 具体行业所需资质请查询《
 微信广告准入行业及资质
 》
 
 若有异议，可发送邮件至wxad@tencent.com或联系【微信广告助手】
 广告投放过程中若涉及违规，会如何处理？一、广告投放违规定义：
 指广告主使用微信广告平台投放服务的行为、通过微信广告平台或其他投放端在微信广告平台投放的广告，违反《微信公众平台广告投放服务协议》、《微信广告制作规范》等广告投放服务相关的协议、规定、规范性文件等。
 二、违规处罚措施说明：
 对于广告投放违规行为，腾讯有权单方视情节轻重对广告主账户、广告主主体采取措施。 关于广告主违规行为定级、处罚规则等，请认真阅读
 《广告主违规处罚》
 。
 
 若仍对处罚结果有异议，可以通过处罚结果页面的申诉入口或公众号“微信广告助手”进行申诉，我们会严格按照规范内容进行核查。
 本地推广门店信息已审核通过，为什么广告内容审核时仍提示无线下门店不支持投放？线下实体门店必须是面向普通消费者营业的消费场所：
 
 包括餐厅、零售店面、体验店、商场、演出场所、活动地点、景点、校区、报名网点、服务网点；不支持工厂、配送站、私人住所等。`,
  28: `微信广告平台一直致力于建立一个公平、公开、公正的广告发布平台，腾讯作为中立的平台服务提供方，我们有志与诚信守约、进取担当的第三方合作伙伴携手并进，建立和维护良性互动、健康有序的平台秩序。
 鉴于微信广告平台中的广告主数量之庞大，为了建立良好的市场秩序和保护权利人的合法权益，根据相关法律法规的规定，腾讯特制定本指引，如果你在浏览微信广告的过程中发现相关内容侵犯了你的权益，你可以通过以下途径通知我们，我们将依法进行处理。
 特别提醒并请理解，向本平台发起侵权投诉，是一项正式的、严肃的、具有法律意义的行为，包括证明材料的选择和提交等流程，都会涉及大量中国大陆法律专业知识。若侵权投诉不能完全符合法定条件，平台将无法处理。所以，我们相信，就侵权投诉事宜向法律专业人士进行咨询，或交由法律专业人士处理，会有利于侵权投诉事宜更为顺畅地进行。
 流程
 1. 通知腾讯
 若权利人认为第三方在微信广告平台推广时所使用广告素材（包括但不限于图片、视频等）侵犯其合法权益，请按以下要求提交相关材料进行投诉，通知腾讯： 权利人应向腾讯提出书面通知书（书面通知书的内容请参考：
 《微信广告侵权投诉通知书模版》
 )，通知书的内容应包括但不限于以下内容：
 权利人主体信息和相关材料
 ①权利人的姓名（名称）、联系方式、地址及营业执照（单位）、身份证（个人）、相关授权证明等证明权利人主体资格的材料；
 
 ②权利人如委托他人代理投诉的，还需提供授权委托书，以及代理人姓名（名称）、联系方式、地址及营业执照（单位）、身份证（个人）、相关代理人职务身份证明（公司授权书、介绍信等证明代理人职务身份及公司授权代理人代表公司办理相关投诉事务）等证明代理人主体资格的材料。
 权利人要求
 权利人投诉侵权的广告主微信公众帐号信息，以及相关投诉事项说明。
 构成侵权的初步证明材料
 该初步证明材料应包括：
 权利人拥有权利的权属证明材料：包括但不限于相关有权机构颁发的版权证书、商标权证书、专利权证书、作品首次公开发表或发行日期证明材料、创作手稿、经权威机构签发的作品创作时间戳、作品备案证书等能证明权利人拥有相关权利的有效权属证明；  
 被投诉方提供的服务构成侵权的证明材料：包括但不限于被投诉方提供的服务构成对权利人版权、商标权或专利权等权利侵权的有效证明材料等。
 权利人保证
 权利人应在通知书中明确保证：权利人在通知书中的陈述和提供的相关材料皆是真实、有效和合法的，并保证承担和赔偿腾讯因根据权利人的通知书对相关帐号的处理而给腾讯公司造成的任何损失，包括但不限于腾讯因向被投诉方或用户赔偿而产生的等损失及腾讯名誉、商誉损害等。
 通知书及相关证明材料准备时需注意的事项以及投寄地址详见下文注意事项中的说明。
 2. 腾讯反馈
 腾讯作为中立的平台服务者，收到权利人符合本指引要求的通知书后，腾讯会尽快按照相关法律法规的规定进行处理，并在符合法律规定要求的情形下将权利人的通知书转送给被投诉方。  
 若被投诉方不认可权利人的投诉，腾讯会将被投诉方提供的相关材料转送给权利人，若权利人对于被投诉方的意见及其提供的相关材料有异议的，腾讯建议权利人另行通过行政投诉、诉讼等方式直接和被投诉方解决相关问题。如果权利人有新的并可充分推翻被投诉方意见的证明材料的，也可向腾讯提供。
 注意事项
 本指引中的权利人，指拥有版权、商标权、专利权等合法权益的原始所有人，代理人是指经原始所有人合法授权的受托人，包括自然人、法人或其他组织等。
 本指引中的第三方，指在微信广告平台进行广告推广的微信公众帐号运营方。
 为了确保权利人提供相关材料的真实性和有效性，权利人的书面通知书及相关证明材料，一般应提供原件，不能提供原件的，应提供复印件（在复印件上应有权利人的签章）。
 有两种通知腾讯的方式：
 
 ①将前述全部的纸质版本材料（包含
 《微信广告侵权投诉通知书》
 ）扫描后通过电子邮件发送至腾讯指定电子邮箱：ads_service@tencent.com（邮件标题：【侵权投诉】（被投诉方微信公众账号名称）广告侵权投诉）  
 ②通过邮寄的方式将前述书面通知书及其他相关证明材料的纸质版本邮寄至腾讯指定的以下地点：
 地址：中国广东省深圳市南山区海天二路33号腾讯滨海大厦 法务部
 邮编：518057
 若权利人涉外的，应当以授权委托方式，委托境内自然人或组织机构代为进行投诉，除相关授权文件外，还应提交如下材料之一，以确保真实、合法：
 中华人民共和国大陆地区境内执业律师对前述授权委托过程进行律师见证的材料；
 
 或
 对于境外不同国家或地区的权利人，按照以下方式提交：
 中华人民共和国（包括香港特别行政区、澳门特别行政区、台湾地区）以外的国家和地区：该权利人所在国公证机关证明前述授权委托合法性、真实性的公证材料，和该公证材料经中华人民共和国驻该国使领馆认证的材料；  
 香港特别行政区：证明前述授权委托合法性、真实性的，经中国法律服务(香港)有限公司加章转递的中国委托公证人出具的委托公证材料；  
 澳门特别行政区：证明前述授权委托合法性、真实性的，经澳门政府公证部门或中国司法部委托的公证人公证，并经中国法律服务（澳门）公司加盖核验章的委托公证材料；  
 台湾地区：证明上述授权委托合法性、真实性的，经海峡交流基金会复查确认的台湾公证机关出具的公证材料。
 任何涉外的材料，均需提交中华人民共和国驻该国使领馆对该材料的中文翻译文本进行认证的材料。
 本指引中权利人的书面通知书，均应包括通知书本身及相关的主体资格材料、权属证明、侵权证明等材料。
 若权利人已经因为被投诉人提供的服务向相关政府部门或法院提起行政投诉或诉讼的，请在提交通知书时，将相关受理证明及提交政府部门或法院的证据材料一同提交给腾讯，这将有利于权利人的投诉的处理。`,
  25: `第一章 总则
 1.目的
 为保护广大广告主、腾讯公司、腾讯广告平台及用户的合法权益，建立健康有序的生态环境，特制定本规范。
 2.适用范围
 与腾讯公司签署广告投放相关合作协议（包括但不限于《腾讯广告-广告主合作协议》、《微信公众平台广告投放服务协议》等，以下统称合作协议），自行或委托服务商通过腾讯广告平台发布广告信息或活动信息宣传推广其产品或服务的自然人、法人和其他组织，适用本规范。
 本规范是《合作协议》中约定的“腾讯平台规则”的组成部分，广告主应严格遵守《合作协议》及包括本规范在内的腾讯平台规则。广告主违反相关合作协议及腾讯平台规则的，腾讯有权依据相关合作协议、本规范及其他相关腾讯平台规则的约定对广告主采取处罚措施、追究广告主的法律责任。广告主按本规范接受处罚的，并不能免除或抵消其应当承担的违约责任或其他法律责任。
 第二章 违规行为认定
 1.违规信息来源
 当腾讯公司收到包括但不限于举报、投诉、第三方反馈等信息时，有权对涉嫌违法违规的广告主进行调查。腾讯公司也有权主动对广告主违规行为开展调查。
 2.违规行为取证
 腾讯公司在进行调查过程中有权对举报人、投诉人、被举报广告主所提供的信息进行取证留存。取证的形式及内容包括但不限于:即时聊天软件对话截图、email记录、电话录音、系统数据处理记录、文档原件、合同原件或传真、发票(收据)原件或传真、网站内容截图等。在对广告主进行违规调查期间，腾讯公司有权自行独立判断是否先行按照本规范中的规定对广告主采取一项或多项处理措施。
 3.违规行为认定
 腾讯公司有权独立判断广告主是否存在违规情况，经腾讯公司判断认为广告主确实存在违法违规情况的，有权随时根据本规范及相关合作协议、腾讯平台规则采取一项或多项处罚措施，广告主应认可因此产生的相应处罚后果。广告主享有解释及申诉的权利。
 4.信息披露
 腾讯公司若接到投诉、举报，或司法、执法机关或其他主管部门调查，有权将广告主的相关信息(包括但不限于注册信息、开户信息、广告投放情况、广告消耗数据等)向相关部门或第三方披露。
 第三章 违规情形分类及含义
 违规情形分类及定级
 
 注：以上内容可于《
 附件：违规情形及定级
 》中查阅
 第四章 违规行为处理
 1.违规行为通知
 广告主在与腾讯广告平台合作过程中，有对自我行为和广告投放内容进行审核的义务，有遵守法律法规、遵守《合作协议》及腾讯平台规则的责任。针对广告主的违规行为，腾讯广告平台一经发现并查实的，有权立即制止违规行为，并依据以下第2条~第4条规定进行处理，处理结果的通知方式包括但不限于邮件、站内信推送等。
 2.违规行为处理措施
 广告主违反法律法规、《合作协议》、腾讯平台规则的，腾讯公司将依据本规范采取以下处罚措施：对于广告主的广告投放违规行为，腾讯将根据违规情节对广告主账号、广告主主体采取如下一种或多种处罚措施：
 2.1 通报：指在各类渠道、媒体具名或不具名通报广告主违规情况。
 2.2 禁止新建广告：指在腾讯广告的规定时间内禁止广告主新建广告（以自然日为单位）。
 2.3禁止推广：对涉嫌违规、涉负面舆情或涉投诉举报的广告进行下线；或对广告主提交的全部广告予以下线对侵犯个人隐私和违反个人信息保护要求的APP及其广告进行下线；对违规商品进行下架，商品关联的落地页及广告进行下线。
 2.4 限期整改：对违规广告/APP/商品提出整改要求，整改通过后可继续推广。
 2.5 冻结账户：规定时间内（以自然日为单位），冻结账户中的广告无曝光，且无法新建广告。
 2.6 封停账户：永久关停广告主腾讯广告账户。
 2.7 永久或暂时禁止该主体（公司）注册成为广告主：永久或暂时禁止违规主体（公司）注册成为广告主；永久或暂时禁止违规主体（公司）下所有公众帐号、小程序等不得申请成为广告主。
 2.8 罚没返货返点：被封停账户的广告主，将依据政策规范取消获取腾讯广告平台返货返点资格，不再计算、支付广告主相应的已获得但未支付的以及后续获得的返货返点。（详情请查看
 《腾讯广告服务商管理规范》
 ）
 2.9 罚没保证金：依据广告主违规场景，扣除违反规则的广告主账户内保证金, 作为违约金。
 2.10 赔偿：因广告主违规给腾讯、消费者、流量供应方或其他任何主体造成损失（包括但不限于因处理消费者投诉、消费者索赔、行政处罚等支付的费用等），广告主应承担上述主体所遭受损失的全部赔偿责任。腾讯有权直接扣除广告主账户内广告费作为赔偿金，如金额不足，广告主需补齐不足金额部分。
 3.
 违规行为常规处理措施
 
 4.违规行为特殊处理措施
 4.1 多项违规：同一广告主在同一违规案件中存在不同类型或不同等级的违规行为时，腾讯广告平台将根据违规行为所触发的从高级别违规类型处理方案进行处理。
 4.2 升级原则：同一广告主发生违规行为后，如造成以下影响，腾讯广告平台可对广告主进行升级处理：
 造成监管或司法影响：广告主违规行为导致腾讯广告平台被国家机关质询/调查/立案处理、与第三方发生诉讼、仲裁，给腾讯广告平台/流量供应方/其他任何主体造成负面影响，或需向第三方支付赔偿或补偿或罚金，平台将根据实际违规等级进行升级处理。
 造成舆情或用户影响：广告主违规行为严重损害消费者合法权益或第三方合法权益，造成群体性客诉等情形，给腾讯广告平台/流量供应方/其他任何主体造成恶劣影响、重大舆情，平台将根据实际违规等级进行升级处理。
 恶意对抗平台，造成平台资源浪费：广告主在推广过程中存在恶意与平台对抗的行为，如撞审、利用技术手段对抗平台规则、违规篡改等，给腾讯广告平台、流量供应方及其他主体造成潜在风险或直接造成损失，平台将根据实际违规等级进行处理或升级处理。
 4.3 累加原则：同一账户或同一广告主，在自然年内三级违规或涉黄类违规行为超过1次以上，将对账号或主体进行违规次数累加并升级处罚手段。
 4.4 减轻原则：同一广告主发生非一级违规的违规行为后，若主动承认违规行为，且积极整改，经核实未对腾讯广告带来不良影响的情形，腾讯广告平台可对广告主进行减轻处理，即按照违规行为降低一级所对应的处理方案进行处理，最低至取消处理。
 5.违规行为申诉
 申诉流程：违规广告主接到腾讯广告违规处理通知后，可通过腾讯广告对接人员，向腾讯广告提交包含相关申诉理由和证据的书面申诉请求。如广告主无内部对接人员，可通过ads_ss@tencent.com邮箱，向腾讯广告提交包含相关申诉理由和证据的书面申诉请求。
 第五章 其他违规
 1.违规行为
 锁量不按时提交或投放中暂停广告，导致最终消耗 <80%，导致流量浪费，将视作排期购买广告的违规行为。
 2.违规处罚手段
 第 1 次 7 天内禁止询量锁量，不能创建新的排期购买广告；第 2 次 30 天内禁止询量锁量，不能创建新的排期购买广告；视情节严重程度依法追究相关法律责任或采取其他处罚。
 第六章 附则
 1.管理规范的效力
 广告主在腾讯广告平台的登录、使用等行为即视为已阅读并同意本规范的约束，若广告主不同意或对本规范的相关规定有异议，应立即停止使用腾讯广告平台的相关服务，并及时向腾讯公司反馈。
 2.管理规范的修改
 腾讯公司有权根据相关法律法规更新或腾讯广告平台运营的需要，对本规范进行修改并更新。就上述修改及更新，腾讯公司将通知广告主。广告主亦应经常查看以便获得最新信息，若广告主继续使用腾讯广告平台服务，视为同意本规范的修改或更新。
 3.管理规范实施日期
 本规范自发布之日起实施。`,
  70: `针对各类行业的准入规范、投放行业资质要求、投放行业素材规范等内容进行解读。
 直购电商本规范适用范围：适用于推广目标为“推广商品”的所有广告
 一、资质审核规范
 1. 商品资质
 服饰鞋包涉及敏感行业及材质（皮毛类、蚕丝等）的商品，需经CMA或CNAS（中国合格评定国家认可委员会）认定质检机构出示的质检证明
 如涉及“真皮”、“羊皮”、“牛皮”、“头层皮”、“羊毛”、“貂毛”等材质，需补充提供正规质检机构出示的质检证明，质检上需明确材料成分及含量等
 若活动赠品描述涉及上述材质，同样需要出具质检证明
 数码智能、插头插座、电动工具等电子产品
 在国家《强制性产品认证目录》内的电器产品（包括但不限于家用型摄像监控器、插排、电池等）需提供《3C认证证书》
 其他电子产品（包括但不限于电动沐浴刷、剃须刀等）需提供经 CMA 或 CNAS（中国合格评定国家认可委员会）认定的质检机构出示的合格《质检证明》
 投放产品的品类、型号、参数须与《3C 认证证书》或《质检证明》上一致
 书籍、杂志、刊物、报纸、电子书等必须提供《出版物经营许可证》或 《网络文化经营许可证》或《网络出版服务许可证》或《电子出版物出版许可证》或其他出版资质
 护肤彩妆行业资质 >
 食品行业资质  >
 2. 第三方授权资质
 广告素材或落地页使用知名人士名义或者形象的，需提供正式的书面授权文件
 广告中使用未成年人作为代言人的，则首先需要核查实该未成年人是否已经年满十周岁（未满十周岁禁止广告代言），其次若代言人为年满十岁的未成年人，需要提供该未成年人及其法定监护人的授权书
 广告素材或落地页涉及第三方logo、名称、产品、服务，包括但不限于时尚品牌、知名动漫、游戏素材、知名剧照、军事图片等，应当事先取得其授权证明，否则，需删除。
 如：销售LV的商家，需提供LV品牌授权书，需明确提及授权范围及授权时间
 未经授权不得使用腾讯相关标识。
 如：使用“腾讯投资”、“腾讯合作”、“微信合作”等文案，需事先征求腾讯书面协议同
 3. 进出口产品资质
 若为进口，产地、材料相关的文案需有相关资质证实。文案涉及“法国“、“意大利”、“欧美”等产地，需补充提供进出口检验检疫证明或者海关报关单
 若涉及出口，需出示出口企业资质，如：海外对外贸易经营备案登记
 4. 售后环节资质
 售后方式需展示在投放的落地页面内，且真实有效
 购买后需通过短信或者其他方式告知广告主商品及物流信息（店铺名称，网址，售后电话等）
 
 更多资质要求了解请查看
 《开放行业分类及资质》
 二、电商推广重点法规及平台要求
 不得对商品的性能、功能、产地、用途、质量、成分、价格、生产者、有效期限、允诺等，或者对服务的内容、提供者、形式、质量、价格、允诺等做虚假宣传
 不得在广告中出现“央视上榜品牌”的描述《央视关于从未颁发
 “央视上榜品牌”等称号的声明
 》
 不得有任何虚构原价、虚假折扣等价格欺诈以及虚假营销的行为
 不得使用“原价”描述，可调整为“指导价”或“吊牌价”等非原价的描述
 对比内容
 电商广告外层素材不支持通过任何形式与自身前期售卖价格进行对比
 （1）外层素材不得通过“原价”、“指导价”/“吊牌价”、划线价等任何形式表达价格与自身前期售卖价格的对比
 如：原价 1990 元，现价 199
 
   （2）外层素材描述现价与具体折扣，暗示前期价格也不支持
     如：
 1350
 /799
 ，现价仅需 799 元！
 
 （3） 推广页素材支持表达与自身前期售卖价格进行对比，但是不支持“原价”描述； 且广告主须确保可以向监管部门提供被比较价格的真实依据，并对所有价格的真实性、准确性、合法性负责
 广告素材不得有直接或间接对比行为，如声称自己的产品、服务的质量、价格等比其他的商品、服务具有优势，从而直接或间接贬低其他商品或贬低竞争对手的产品、服务
 （1）不支持将自己的产品与其他品牌产品价格进行对比
 如：XX品牌精华一半的价格就能买到一瓶安瓶精华
 （2）不支持将自己的产品与其他品牌产品效果进行对比
 
 （3）广告素材不得将自己的产品与不同品类商品的价格、使用效果进行对比，涉嫌虚假夸大
 如：迷你暖风机宣传其比空调还好用，迷你冷风机宣传比空调还凉快
 如：描述4s店洗车洗不干净，引导消费者使用自身产品（伸缩软管水枪)，暗示比4s店洗车更干净
 
 
 对商品的描述应当有合理、有效的证明资料支持，不可捏造或夸大内容
 
 如：手机的参数需与该手机型号入网许可的参数一致，不得出现广告素材内电池容量为8000mAh，商品实际容量为4000mAh等商品信息篡改的内容
 商品在素材文案描述需与落地页信息一致：
 品牌商标信息一致
 商品售卖A品牌，推广页信息必须是A品牌，不得是B品牌
 折扣信息一致，不得出现素材上折扣与详情页描述不一致
 
 如：素材上折扣为3折，但详情页描述为“3折起”
 商品样式一致
 
 如：素材上的手机样式需与落地页一致，不得出现素材上为A手机，落地页为B手机
 不得投放与市场价格差异过大，价格超低或明显造假的商品
 
 如：知名品牌商品价格远低于正品的市场价，iphone6s 399、苹果手机一折、LV1000元等
 
 如：销售仿名牌、山寨、假冒伪劣商品，或A货、高仿、同款、外贸原单等商品
 
 2.  不得对产品或服务的效果做保证性承诺的表述
 
 如：“0风险”
 3.  不得使用虚假或未经核实的数据、统计资料、调查结果、文摘、引用语等引证内容
 广告使用数据、统计资料、调查结果、文摘、引用语等引证内容的，应当真实、准确，并表明出处
 引证内容有适用范围和有效期限的，应当明确表示适用范围和有效期限
 落地页不得使用虚假评价或者销售数据
 如：淘宝旺旺截图、非真实客户聊天截图
 广告中含有评奖、评比或排名等信息
 
 如：“销量第XX”、“市场占有率X%”、“获得XX年XX单位评选的XX奖”等，需要广告主提供权威机构的有效证明后方可发布广告
 三、文案审核规范
 文案包括图文广告文字链及图片广告文字
 不得使用限定用户属性（包括身份、年龄、角色、收入）等文案
 限定身份
 
 如： “农民工都能办的信用卡 ”
 限定两性关系角色称呼
 
 如：“老公/老婆，三天不吃饭，也要买这XX”、“男人穿的帅，女人追着爱”、“男人穿的帅，才会有人爱”等
 限定年龄
 
 如：“30-55 岁请进”
 限定婚姻状况
 
 如：“单身狗、大龄剩女”
 限定收入
 
 如：“月薪三千也买得起”
 2.   不得使用价格对比文案
 不得使用物品之间价格对比
 
 如：“这 3 只比 1 包烟还便宜 ”，1包烟的价格范围很广，无法进行比较
 不得与某一促销日期价格对比
 
 如：比618便宜
 不得使用原价、指导价等与销售价格形成对比的价格描述
 
 如：“原价199元”、“1折仅售199元”、“直降300现价199”等
 不得与其他产品效果对比对其他产品或第三方商家带攻击性描述
 
 如：“这迷你暖风机比空调还暖”、“（保暖内衣）比羽绒服暖三倍”
 3.   不得使用挑衅、命令语气、誓言文案
 挑衅式
 
 如：“居然买不起、不买不要点、不买不是男人、敢不敢、不看后悔、不穿鞋不要点、有人退货算我输”等
 命令祈使式
 
 如：“你该换表了，是男人必须买、非买不可”
 誓言式
 
 如：“我发誓、郑重发誓”
 4.   不得使用夸大、虚假、无法证实的文案
 涉及销售承诺类
 
 如：“ 0 风险 、买一件，够你炫耀N年、一双穿三年，一件顶五件”
 涉及具体销量排名、比较和数量类
 
 如：“年度畅销腕表、销售 1000 只”
 涉及商品库存描述
 
 如：“仅剩 100 件库存”
 涉及用户具体购买数值记录
 
 如：“听说有人一买了 5 个”
 涉及降价描述类
 
 如：“今日降价（‘今日’无明确日期指向，无法证实）、低于1折”
 如：活动正在进行，可支持使用正在进行时类描述，（现在有优惠、促销进行中）
 涉及使用具体数值形容档次描述类
 
 如：“千万级档次”
 可支持不涉及具体数值正常描述商品实际档次，如：高档、上好、高端
 涉及商品效果类
 
 如：“年轻十岁”
 可支持感受类描述：“显年轻、看上去像年轻了十岁”
 涉嫌抨击其他商家
 
 如：“专柜不会说的秘密”
 涉及网红、明星同款或推荐类描述，需提供授权
 
 如：“网红同款”、“明星同款”、“XXX（明星姓名）推荐款”
 涉及负面词汇或场景进行描述，易引起人心理不安的强烈情感用词
 
 如：“含‘死’用词，亏死了；出大事了
 5.   不得使用容易引起歧义的词语
 易误导违反公序良俗类和社会道德的描述
 
 如：“搞大了，老板哭晕在厕所”、“戴上能娶5个老婆”
 价格误导类
 
 如：“就1块”，可能让人误解手表只需1块钱，或2块钱
 买赠类，若赠品非商品本身，赠送内容需要通过文字或者图片的形式在外层素材或落地页内展示
 
 如：买一送一，实际为买一瓶精华赠送一片面膜，不支持描述为买一送一，需要给赠品数量添加引号，如买一送“一”，或在外层素材图片添加赠品图例
 其他误导类
 
 如：“免费试用/免费试穿/支持试用/0元试用/0元下单/免费下单/不好用不花钱下单不付款”——易误导用户商品为免费可长久使用或免费购买，实际上是货到付款
 
 如：“归你了”——用户还未购买，商品并非归属用户，不能明确表明商品归属
 
 如：“寻物启事”——易误以为是真的寻物启事
 6.   不得使用让人误以为是腾讯/微信官方行为的文案
 
 如：腾讯用户专享、微信用户专享、火爆朋友圈
 7.   不得利用虚假优惠作噱头诱导用户点击类文案
 
 如：“点击领取优惠”实际广告并无优惠可供用户领取
 8.   不得使用绝对化描述
 
 如：这才是男人的鞋、这才是牛皮、貂绒毛衣不可能这么便宜等
 9.   不得违背正常的市场销售行为认知描述
 
 如： 员工/内部价（员工内部价一般不能放在市场上进行公开销售）
 10.  不得涉及保健、医疗功能性描述 
 如：长寿奶、美容养颜、皮肤白白嫩嫩（形容食品）；去口臭/异味、去结石（日用品）
 四、促销活动审核规范
 微信广告限制投放促销活动类型
 包括但不限于 0 元购、1 元秒杀、免费试用、免费领取、限时领取等，仅对大型电商或品牌商家的特殊营销节点开放
 包括但不限于众筹、1 元云购等。
 
 
  2.   活动内容规则描述需清晰
 有较详细的活动规则，需包括活动时间、奖品内容、活动参与规则，抽奖规则、有奖限制条件等
 活动规则中不得出现类似“本活动由XXX享有解释权”的格式条款
 不得使用虚假的倒计时的计时器
 3.   若为附赠式销售
 素材或文案中需写明具体赠品内容
 
 如：素材不能仅出现“买一得四”的文案，误导用户，需补充赠品名称或展示赠品图
 赠品价值不得超出或接近商品售卖价格
 五、推广页审核规范
 落地页不得使用虚假评价或者虚假销售数据
 非知名电商平台的直购电商页，详情页不得使用评价区域
 
 如：淘宝旺旺截图、非真实客户聊天截图
 不得使用虚假评论数据
 2.   不得出现静态或动态（如跑马灯滚动条）的购买记录
 3.   不得出现发货记录、发货清单等证明销售数量的图片及文字描述
 4.   推广页面的责任主体需与广告主体保持一致
 5.   不得在推广页放置与广告主主体不一致且未经认证的微信号及二维码
 6.   不得无其他广告内容，仅通过二维码进入外链购买
 7.   若外层素材涉及具体商品价格，在推广页（包括聚合推广页）第一屏需体现出外层所推广的商品及价格；若外层未涉及具体商品及价格，推广页仅需与外层推广内容保持相关联性
 
 
 六、附录：电商推广单品及价格审核要求
 1. 禁止准入
 兵工铲不准入投放服务。其他商品若宣传具有安防类功能，同样不准入投放，如手电筒宣传具有破窗安全锤功能，须引导删除该描述
 医疗器械不准入投放服务，如不得投放超声波洁牙仪、矫正背带、膝盖助力器、红外测温仪等，详情可参考
 国家药品监督管理局官方网站
 禁止充电发热接触人体的服饰鞋包类商品投放广告，如：充电发热马甲、靴子等
 禁止投放香烟以及香烟周边产品，如：香烟、檀香、烟灰缸等
 禁止投放翡翠玉石类产品
 禁止投放收藏品、文玩古董类产品，如：纪念钞、纪念币、纪念邮票等
 更多禁止准入的服务或产品请查看 
 《法律及平台禁投》
 2. 其他要求
 汽车 U 盘商品，广告宣传不得涉及色情擦边或无版权音乐、视频内容。若出现知名或具体歌曲或视频节目名称，需要补充版权证明
 冷暖小空调商品广告中禁止使用“空调”“制冷”等与实际商品功能不符描述，建议调整为：冬夏两用小风扇，夏季清凉扇等描述，避免使用“空调”“制冷”等措辞
 望远镜商品广告外层及推广页禁止使用“看见XXX米”等涉及具体数字的描述，如：可望 3000 米等
 桑蚕丝材质的商品因其不含有真实的桑蚕丝成分，商品质量不合格，广告外层及推广页面限制使用“桑蚕丝”“蚕丝”描述，可使用“具有像桑蚕丝样的顺滑手感”代替
 老花镜商品镜片实际并不能达到“自动变、智能变、自动识别”等效果，禁止使用“自动匹配度数”、“自动调节度数”、“自动识别度数”、“智能变焦”等虚假描述
 针对下水道清理类商品禁止使用“分解毛发、分解堵塞物”等具体对“分解物品、解决堵塞及抑制细菌再生”的虚假效果承诺；可使用去异味、除臭、除油、除污以及防堵塞之类的轻度清洁、预防描述
 灯泡商品若含有“摄像”功能，暂且不支持投放，需删除“摄像”相关功能描述
 随手贴产品不得将商品放置在汽车安全囊位置，违反汽车驾驶安全规范
 
 磨脚器产品不得突出或放大老茧死茧等引人体验不适的场景
 
 强力胶产品不得涉及桶装水承重或多人承重等过于夸大场景
 
 3. 价格审核规范
 真皮皮衣类（真皮、羊皮、牛皮皮衣）暂不接受 280 元以下商品
 头层皮皮衣类（头层羊皮、头层牛皮皮衣）暂不接受 500 元以下商品
 羊毛大衣、貂毛大衣、内胆貂皮衣等皮草外套类商品价格不得低于 1000 元（毛含量：100%、纯貂绒、纯羊毛产品）
 羊毛大衣、貂毛大衣、内胆貂皮衣等皮草外套类商品价格不得低于 500 元（毛含量：大于 50%）
 羊毛大衣、貂毛大衣、内胆貂皮衣等皮草外套类商品价格不得低于 200 元（毛含量：小于或等于 50%）
 毛衣外套类商品价格不得低于200元（纯羊绒、纯貂毛、100% 羊毛、纯山羊绒）
 在线视听与阅读一、 行业准入规范
 1. 开放的二级行业
 影音视频、音乐、网络直播、阅读与在线 FM 收听、在线动漫
 2. 行业资质要求
 任选一项或多项业务内容提供所需资质：
 若以营利为目的经营互联网文化活动，需提供：《网络文化经营许可证》
 若包含信息网络传播视听节目业务，需提供：《信息网络传播视听节目许可证》
 若涉及网络出版，需提供：《网络出版服务许可证》或《互联网出版许可证》
 3. 微信广告开放能力
 推广目标：均支持投放
 广告位：阅读与在线 FM 收听、在线动漫朋友圈广告、公众号互选广告不支持投放，其他二级行业均支持
 购买方式：阅读与在线 FM 收听、在线动漫排期广告不支持投放，其他二级行业均支持
 二、 通用行业规范要求
 1. 公众号名称及头像要求
 公众号名称/头像不支持使用不良暗示词汇，且需与行业或平台保持良好的关联性：
 如“午夜”、“寂寞”等不支持使用
 公众号名称不得突出性别群体
 如：男性小说、女性小说、男人看小说等不支持使用
 公众号头像、名称需要与运营内容保持良好的关联性，且不得使用真人、擦边低俗类头像
 公众号名称不得出现“疑似人名+陪读”
 如：“玉儿陪读”不支持使用，可支持使用“夏天陪读”等无歧义的组合
 2. 广告素材要求
 基础要求：
 活动要求：1 元看全本、9 元看全本需在公众号或落地页体现
 版权要求：广告内容不得使用具体新闻的图片；使用影视剧照或视频片段时需补充提交相关授权，否则一经发现侵权会进行版权追责
 不得妨碍公共秩序或违背社会良好风尚：
 不良语言：不得使用不良/不文明用语，包括但不限于：绿茶婊、逼格、蛋疼、撕逼、滚粗等
 未成年人保护：文案不支持表述与未成年人建立婚恋关系，
 如未成年小女孩配图+小王妃文案的组合
 ；未到法定婚龄结婚，校园恋情，
 如16 岁，他娶了她
 不良婚恋观
 不当婚姻类：包括但不限于代孕、鼓动离婚、出轨、买妻、契约婚姻、协议生子、已婚状态对外宣称单身、迫嫁等
 酒后乱性类：包括但不限于失控、乱性，不良导向的饮酒动作
 亲属乱伦类：不得出现亲属关系加两性关系描述，
 如：叔叔，我终于要和你结婚了
 不良道德
 违背职场道德类：
 如医生收取红包，陪夜、潜规则，给女村长送银行卡等
 违背人伦道德：打胎、岳父对女婿下跪、虐待老人小孩、挖开坟墓、重男轻女、将不孕妻子打入冷宫、不支持殡葬、追悼会场景， 
 如：生完儿子才能离婚
 恐怖类：不得出现过度惊吓恐怖的画面，台词，背景音乐及声音效果
 
 暴力&胁迫行为
 刑罚类：不允许对人物虐待，如：吊在城门上暴晒三天，杖毙、暴打等；不允许行为+致死的结果，如：跪在雪地 3 天+已经死了；允许配合情节的普通的刑罚类型描述，不包含具体的致死过程描述，如：满门抄斩，流放等
 复仇类：宣扬以暴制暴、极端的复仇心理和行为，如：誓要那些灭他全家的权贵拿命偿还
 胁迫类：被强制离婚；被逼/被迫离婚；被迫骨肉分离；被婆婆陷害赶出家门
 场景类：不得出现打砸，持械，绑架，聚众围殴，或其他涉黑场景或文案；视频素材不得连续长时间出现肢体冲突（不得超过 5 秒）；不得介绍暴力细节或宣扬暴力，怂恿、倡导施暴后的快感等
 歧视类
 民族歧视种族歧视
 特定群体指代：文案不得突出性别群体，
 如：男性看小说、宅男小说、女性小说等
 宗教内容：不得在大众传播媒介及非宗教活动场所发布有关宗教的广告，不得发布歧视宗教内容的广告
 禁止出现含有违背宗教道义的描述，不得宣扬和尚谈恋爱、还俗结婚等与宗教强相关的内容 
 如：不得含有宗教内容+两性场景搭配或文案描述：和尚/出家人&美女、帅哥&尼姑
 禁止出现任何贬低或歧视宗教的描述，
 如：花和尚
 禁止出现“宗教”倾向的内容或介绍宗教历史，
 如：佛教诞生距今已有两千五百多年，是世界三大宗教之一
 允许作为武林门派或人物角色身份出现，涉及到与宗教相关的场景或文案，
 如：少林寺（和尚/出家人）、武当派（道士）、峨眉派（尼姑）等
 迷信内容
 禁止出现迷信相关人物：包括但不限于巫婆、算命先生、风水先生等
 禁止出现迷信相关行为：包括但不限于抽签、卜卦、算命、看相、测字、请神、驱鬼、看风水、符水治病等（场景中出现描述烧纸钱、跳大神、破太岁、巫蛊术、扎小人、道场作法）
 违法犯罪内容
 
 广告素材不允许任何的违法犯罪行为的描述，包括但不限于：下药、非法取子宫、代孕、顶替入狱、被同意捐肾、人物被虐待致死、宣扬赌博行为（包括但不限于：赌石、六合彩，老虎机）
 低俗类
 文案要求
 不良导向或低俗类文案，
 如：午夜、偷偷看、躲在被窝看等
 地点+行为组合不得含有不良性暗示或倾向，
 如：路过玉米地却意外撞见小叔子的秘密
 导向不良的语义不完整描述，
 如：那天隔壁大家屋里传来一声尖叫，他冲进去却看到这样的一幕...
 图片要求
 美女图片：不得使用与剧情或小说角色无相关性的美女图；不得使用仅露出脖子以上的大头素材，建议全身露出，与场景结合为主
 部位要求：不得突出敏感部位（包括但不限于胸部，臀部，腿部，腰部等）
 
 动作要求：姿势不得出现撩裙子，衣服，高抬腿等妩媚动作；不得出现挤胸，凹造型突出胸部臀部；不得出现壁咚/床咚，或其他强制动作，猥琐动作
 
 服装要求：不得穿着透视装，低胸装，吊带装，情趣内衣，网状丝袜，不良导向的露脐装，凸点或其他突出胸部臀部敏感部位的紧身衣；过短的小短裤或小短裙
 
 三、小说题材要求
 不支持耽美题材
 不支持涉及军人/军事题材（涉军），不支持宣传近现代战争、政治斗争题材（涉政）
 不支持烘托封建社会的题材
 灵异类要求：灵异题材，不得出现如蛇妻、鬼胎、冥婚这类露骨的封建迷信字眼
 
 
 摄影摄像机构及服务一、 行业准入规范
 1. 开放二级行业
 摄影摄像、婚纱摄影
 2. 行业资质
 无
 3. 行业禁投
 无
 二、 行业规范要求
 1. 文案规范要求
 不得直接使用具体生肖名词
 
 如“寻找生肖女生，23岁猪”“81年的鸡”
 
 不得使用擦边低俗的文案表达摄影创意
 
 文案描述活动需与推广页内容相符
 
 如：文案“活动：领取5000元优惠券”，广告推广页需要有对应领取优惠的入口或在广告推广页文案中详细说明领取优惠的路径
 广告文案针对婚纱照价格类描述为估算/测算等，需要在广告推广页中详细说明登记信息后，由客服人员联系获取报价
 
 文案描述表达不得出现常识性错误
 
 如：用生肖作为活动条件，生肖对应出生年份描述错误
 不得使用限定用户属性或行为（包括身份、年龄、角色、收入、婚姻状态、学历、民族种族、工作类型等）的文案
 
 如“今年或明年要结婚的人”“婚期将近的人”
 2. 图片规范要求
 不得使用涉及暴露、擦边、低俗等违背社会主义精神文明要求的素材
 
 3. 推广页规范要求
 推广页中若需通过按钮引导用户点击进行下一步操作（包括但不限于引导领取优惠、查看价格、预约报名登记等），则按钮的引导文案需与实际的操作行为相符合，如按钮引导文案与实际操作不一致，则须在按钮周围详细说明参与活动或领取优惠路径
 
 如：按钮文案为“立即领取”，实际需输入联系方式，无法直接获得相关优惠券/礼品等，则按钮文案需修改为“预约登记”，或在“立即领取”按钮周围详细说明获取路径，告知需登记信息由客服联系后获取相关优惠
 
 
 不得出现无品牌、无活动介绍、无设计的信息搜集页
 推广页需要有对应的品牌或活动内容介绍
 使用信息搜集需向用户告知规则、数据填写用途、使用范围，帮助用户判断是否填写
 线索收集内容不得涉及收集非用户本人的信息
 
 如：收集用户好友的电话号码、微信号等
 不得在推广页中出现非广告主主体的公众帐号/无主体的个人公众帐号/个人微信号/个人名片信息等，展现形式包括但不限于微信公众帐号二维码、微信公众帐号 ID 及微信公众帐号帐号名称；个人微信号、个人微信二维码、个人名片等
 不得在推广页中出现加微信群、QQ 群或其他社交群信息
 4. 活动投放规则
 限制投放促销活动类型：包括但不限于线上“0 元购”、“1 元购”、“1 元秒杀”、“免费试用”、“预付充值、押金”、“虚构原价折扣促销”、“免费或低于市场价格的超低价拼团（如：0.01 分拼团）”、“免费抽高额奖品”、“以旧换新”等具有强诱导性、风险较高的促销活动
 婚纱摄影行业推广免费拍、0 元拍等活动，需添加警示语/活动规则，
 如“免费活动/ 0 元拍仅为活动形式，照片获取需另外付费”
 ，且活动金额不得超过 5000 元
 其他限制投放活动类型：包括但不限于代言人选拔、最美代表人等活动
 金融一、	行业准入规范
 1. 准入二级行业
 小额贷款、基金、证券交易、保险、银行/银行服务、银行/信用卡、第三方支付、信托、汽车金融、金融辅助工具、征信机构、标准金融
 2. 金融行业资质
 小额贷款
 行业描述：小额贷款公司和消费金融公司：小额贷款公司是指由自然人、企业法人与其他社会组织投资设立，不吸收公众存款，经营小额贷款业务的有限责任公司或股份有限公司；消费金融公司是指不吸收公众存款，以小额、分散为原则，为中国境内居民个人提供以消费为目的的贷款的非银行金融机构
 行业准入要求
 公众号主体营业执照范围需包含“金融”或“投资”或“借贷”
 必须具备：《金融许可证》或《小额贷款许可证》（且营业执照经营范围内有“小额贷款”经营范围）或省政府发放的批文
 如需通过互联网开展借贷业务（包含注册、审批、提交申请、发放贷款 等），广告主的营业执照或小额贷款许可证需具备“网络小额贷款”、“网络贷款”等允许开展网络借贷业务的相关内容；地方小额贷款牌照不得进行网络小额贷款；如当地政策有特殊规定，请在资质中补充省级及以上金融办的官方发文内容。
 微信广告主的公众号运营内容、广告内容涉及借贷产品的，需提供所有借贷产品出资主体的小额贷款资质（参考上述准入要求2/3）
 基金
 行业描述：适用于发行基金的金融商事主体
 《经营证券期货业务许可证》
 涉及私募基金，须提供《私募投资基金管理人登记证明》
 涉及第三方合作或推广非开户企业所有的产品，须提供《品牌授权书》或销售合作相关的合作协议、供货协议或授权书等
 证券交易
 行业描述：适用于证券交易经营机构
 需具备《证券经营机构营业许可证》或《经营证券业务许可证》或《经营证券期货业务许可证》
 保险
 行业描述：适用于保险公司、保险经纪、保险公估、保险代理等业务：包括不限于保险,寿险,健康险,意外险等险种
 需具备《保险机构法人许可证》或《经营保险业务许可证》或《经营保险经纪业务许可证》或《经营保险公估业务许可证》或《经营保险代理业务许可证》
 银行/银行服务
 行业描述：适用于银行和银行提供的各种产品或服务：理财,贷款,按揭 ；包括商业银行及外资银行
 需具备《金融机构许可证》或《金融许可证》
 银行/信用卡
 行业描述：适用于银行发行的信用卡
 公众号主体营业执照范围需包含“金融”或“投资”或“借贷”
 信用卡中心：需具备银行的《金融机构许可证》或《金融许可证》
 信用卡中心分支机构：需具备需提供银行的《金融机构许可证》或《金融许可证》和信用卡中心给予分支机构的《推广授权书》
 第三方支付
 行业描述：适用于第三方支付工具，如财付通等
 需具备《支付业务许可证》
 信托
 行业描述：适用于信托投资公司，如北京信托投资公司
 需具备《金融许可证》
 汽车金融
 行业描述：汽车金融公司，是指经中国银行业监督管理委员会（以下简称中国银监会）批准设立的，为中国境内的汽车购买者及销售者提供金融服务的非银行金融机构。汽车金融公司名称中应标明“汽车金融”字样
 需具备《金融许可证》
 标准金融
 行业描述：标准金融指具备《金融许可证》的其他类金融机构，包括但不限于财务公司、货币经纪公司、贷款公司、金融租赁公司等，例：中国铁建财务有限公司、上海国际货币经纪有限责任公司、天津国泰金融租赁公司等
 需具备《金融许可证》
 金融辅助工具
 行业描述：适用于记账工具，股票模拟交易，利息计算等不包含经营内容的金融工具
 如发布证券交易即时行情，需具备《证交所的书面授权许可》
 如不涉及发布即时行情，则不需要资质
 征信机构
 行业描述：对企业、事业单位等组织（以下统称企业）的信用信息和个人的信用信息进行采集、整理、保存、加工，并向信息使用者提供的活动和主体，例：拉卡拉信用管理有限公司等
 个人征信业务需具备《个人征信业务经营许可证》
 企业征信业务需具备：所在地省级国务院征信监督管理部门（即中国人民银行）派出机构出具的《备案证明》
 3. 金融行业禁投
 无明确许可的金融衍生品
 买卖银行账户（银行卡）
 POS机销售、利用POS机套现、返利
 集资、众筹平台
 虚拟货币交易：如比特币、莱特币、元宝币等
 债券、股权交换交易
 债券转让
 现货交易（包括原油及原油衍生品交易、贵金属交易）、典当、担保
 校园贷、学生贷等无还款能力人群贷款
 P2P网贷平台、金融综合理财平台
 投资咨询：风投平台，找投资项目相关
 私募基金；私募型金融产品
 代还信用卡：申请信用卡来还另一张信用卡欠款
 信用卡套现
 证券股票咨询、股票教学培训
 股票配资、配资炒股、借钱炒股
 外汇业务
 首付贷以及助贷产品
 杠杆交易的相关内容（利用小额的资金来进行数倍于原始金额的投资）
 境外保险、境外投资理财
 代投放
 如：广告主名称为品牌商，但公众帐号认证主体为代理公司
 如：广告代理开通广告主帐号为多个品牌或广告主进行代投放
 4. 微信广告开放能力
 推广目标：均支持投放
 广告位：均支持投放
 购买方式：除二级行业“第三方支付”不支持投放排期广告外，其他二级行业所有购买方式均支持投放
 二、投放资质要求
 1. 未经金融机构或者其他金融产品授权，不得出现机构品牌信息
 央行属于国家机关，非央行官方广告不得在广告素材及内容中使用“央行”相关描述进行品牌宣传
 信用卡管家类软件或其他第三方理财工具，提及XX银行信用信息查询，必须有XX银行授权或合作证明
 非银行官方机构，使用金融卡类素材时，未有品牌授权，不得出现“银联”、“万事达”、“VISA”等信用卡组织LOGO
 2. 素材及推广页若使用数据（如在线人数、下载量、销售量、排名、通过率、成功率等），需在广告内容旁清晰注明数据来源、有效时段等真实有效的注释说明
 3.	广告素材上若涉及“征信查询”的内容，需提交与征信机构或央行的接口合作协议，合作的征信机构必须具备：所在地省级国务院征信监督管理部门（即中国人民银行）派出机构出具的《备案证明》
 三、	行业规范要求
 1. 金融行业需重点遵守的法律和平台规范
 贷款类广告审核规范
 小额贷款广告需在素材或推广页内容中明确标注出资主体，如为贷款平台以协议合作形式进行贷款产品推广，需提供出资主体的小额贷款资质、双方合作协议等证明资料
 小额贷平台资金不得来源于P2P 平台
 广告位或推广页需添加“贷款额度、放款时间等以实际审批为准”和“贷款有风险，借款需谨慎，请根据个人能力合理贷款”（详细的标注方式请参照微信广告金融行业标注附录）
 可使用月息、日息、日利率、月利率描述，但需同时标注年化费率/年化利率（即：在素材上出现月息、日息、日利率、月利率描述，则必须同时标注年化费率/年化利率，且不得标注为“年利率”或“年费率”）
 不得利用学术机构、行业协会、专业人士、受益者的名义或者形象做推荐、证明
 贷款条件
 支持征信贷款  
 如：身份证贷款、社保卡贷款、公积金账户贷款、凭工资贷款、有收入贷款
 不支持使用易误导为违规操作的贷款条件  
 如：征信差可贷款、不需要亲人号码可贷款、不看征信可贷款、逾期3次以下可贷款
 不支持0门槛贷款，可描述手机贷款的便利性， 但不得误导用户为0门槛贷款  
 如：不支持使用“躺着也能贷款”、“凭手机可贷款”、“手机下载即可贷款”，可使用“不出门即可申请贷款”、“手机可申请贷款”“手机下载APP即可申请贷款”
 暂不支持不具有保险公司资质的主体投放保单贷款
 暂不支持刷脸贷款（银行及微粒贷除外）
 若使用具体银行的银行卡做为素材，必须提供与银行的合作协议，且需在外层文案或图片标注“凭XX银行卡可贷款”
 凡是涉及具体贷款产品（如：用XX贷款），需在外层素材或推广页清晰标注该产品信息，包括但不限于：产品名称、出资主体、该产品在APP或公众号内的申请条件，申请方式路径等
 不得投放具体额度或区间额度，仅支持借款金额为“最高可借XXX”或“0-XXX”的区间描述或非承诺性借款的描述  
 如不支持描述：“贷款金额10万~20万”
 小额贷款额度：个人贷款不能超过20w，企业贷款不得超过100w，消费金融贷款不得高于 20w   
 信用卡广告审核规范
 申请条件
 按性别申请：所推广信用卡仅限男性或者女性申请时，需在推广页有明显申请条件说明；否则，不得使用“仅限男性申请或仅限女性申请”的文案
 信用卡不支持投放信用卡套现相关内容，广告素材中也不得使用“取现”“提现”等易误导为信用卡套现的词语；银行官方主体明确有取现相关业务的，可支持投放
 不得推广不符合事实认知的信用卡申请活动：
 如：推广标准卡、普卡等可长期申请信用卡时用“限量限时”进行描述
 如：推广标准卡、普卡等可长期申请信用卡时使用“快被抢光了”、“最后一波”等哄抢式文案
 如：“免费领取一张信用卡”“免费送你一张信用卡”等误导信用卡不需要审批即可无门槛申请的文案
 涉及具体信用卡额度描述，广告位或推广页需添加标注“根据审核结果不同额度不同”（详细的标注方式请参照微信广告金融行业标注附录）
 不得利用学术机构、行业协会、专业人士、受益者的名义或者形象做推荐、证明
 投资理财类广告审核规范
 不得含有对未来效果、收益或者预期相关的情况做出保证性承诺，明示或者暗示保本、无风险或者保收益相关描述  
 如：使用“理财前理财后”的效果对比图作为素材（如理财后有能力购买房、车、奢侈品等，钱币堆叠暗示收益等）、最高收益可达X%、承诺“收益达18%”、“月薪3000元，理财一年买奥迪”、“理财无忧”、“理财有惊喜”、 “投资必赚”、“确保收益”、“保证收益100%”、推荐涨停股、专家推荐股票、明日涨停、暴涨黑马、股神、内幕消息等意思相同或相近的词汇
 不得利用学术机构、行业协会、专业人士、受益者的名义或者形象做推荐、证明  
 如：“张先生加入××平台3个月，获利1万元”等
 发布股票、基金等理财投资类产品广告应在显著位置标注“股市有风险，投资者须慎重入市”、“**产品有风险，投资需谨慎”、“投资有风险，入市需谨慎”等忠告语；保险公司若投放涉及保险分红投资相关内容时，也应做相应标注。（详细的标注方式请参照微信广告金融行业标注附录）
 互联网金融平台
 互联网金融从业机构不得以显性或隐性方式，通过自有资金补贴、交叉补贴或使用其他客户资金向客户提供高回报金融产品
 不可出现夸大或者片面宣传金融服务或者金融产品，在未提供客观证据的情况下，对过往业绩作虚假或夸大表述
 不可出现对投资理财产品的收益、安全性等情况虚假表述
 不可出现宣传突破住房信贷政策的金融产品
 互联网金融平台支持做平台品牌宣传，若投放具体的理财、贷款或信用卡产品时，必须提交相应项目的资质及合作协议
 征信类广告审核规范
 广告素材上若涉及“征信查询”的内容，需提交与征信机构或央行的接口合作协议，合作的征信机构必须具备：所在地省级国务院征信监督管理部门（即中国人民银行）派出机构出具的《备案证明》
 征信报告出报告时间不得不符合常规时间
 出现征信评分、征信评级，请补充添加评分评级来源，如“xxx信用评分”
 广告中不得出现信用不良等负面内容
 2. 金融行业需重点遵守的创意规范
 文案重点规范
 不支持承诺类文案，包括但不限于
 理财类收益承诺  
 如：承诺收益达18%、月薪3000元，理财一年买奥迪
 信贷类还款压力承诺  
 如：轻松还款、还款无压力
 信贷类借款结果承诺  
 如：成功到账、5万轻松到手、贷款额度5万-10万
 不支持限定用户属性和行为的文案描述  
 如：月薪xx元、工资不涨怎么办、没钱压力大、最近老穷了、还在到处借钱？
 不得使用会给用户带来心理负担的负面描述文案或通过其他负面场景引导用户使用产品  
 如：没钱压力大！、情人“劫”、你还在辛苦借钱？、别和我说你借不到钱！等
 不得使用不良导向文案  
 如：立刻借钱，买游戏皮肤、没钱也要买买买 、薅羊毛
 推广内容需与所推广金融产品业务一致，不得误导用户，包括但不限于
 不得实际金融产品为A，推广内容指向金融产品B
 不得出现不符合业务特性的文案描述  
 如：借贷广告中出现“领取额度”、“定制额度”等不符合借贷业务本身特性的描述
 不得出现不符合业务办理实情的文案描述，或误导用户有特殊渠道、误导用户办理的业务可能存在违规，变相贬低其他经营者的描述  
 如：“信用卡下卡难/信用卡额度低，来这里贷款吧”
 不得使用偶发性内容作为推广噱头，包括但不限于贷款审核、信用卡下卡时间、征信报告出报告时间等，需符合常规性业务办理时间  
 如：征信报告出报告时间按实际业务情况不少于24小时
 不得使用夸大或与产品不匹配的描述词汇、文案  
 如：“额度高得逆天”、 额度“雷人” “可怕”等
 图片重点规范
 不得使用中国在用钱币作为外层或推广页素材（包括人民币、硬币），包括漫画形式的人民币
 不得使用真实证件做为外层图片元素，包括但不限于卡通形象  
 如：身份证、社保卡等
 不支持使用图片、文字设计随意、简陋的素材
 图片内文字面积占比不得超过30%，不支持主视觉突出为文字，可增加搭配协调的创意元素，避免整体设计简陋
 不支持使用excel或其余表格类图片作为素材
 不支持直接使用考卷、报纸、手机屏幕、电脑界面截图作为素材
 
 不支持模拟系统通知类素材（如出现贷款已到账、贷款成功等）  
 如：以文案、对勾、盖章等形式表达的贷款成功、审批通过等（如仅有打勾但未表达贷款成功、审批通过等意思，可通过）
 
 不支持使用未经精修处理的人物形象作为素材
 不得使用诱导点击的设计元素，包括但不限于假关闭按钮等，朋友圈图片不得使用按钮图标
 
 广告素材使用红包样式，不得静态或动态模仿微信红包或微信转账样式，或使用微信钱包等元素或软件系统截图，不得出现诱导点击的按钮图标
 
 推广页等其他重点规范
 推广页中如出现引导用户操作的按钮文案，按钮文案需与用户实际操作行为保持一致，如果出现不一致情况，则需要在按钮下方进行相应的操作路径解释  
 如：按钮文案为“测试额度”，实际点击后为引导注册或引导下载，则必须在按钮下方清晰说明操作路径为“下载APP用户注册后，进入XX页面进行额度测试”
 
 投放具体银行理财、贷款或信用卡申请页时，需要以官方的名义投放，主域名需与官网域名一致
 广告素材、广告详情、公众号内运营内容，不得出现加群咨询、加群了解、加个人微信号咨询、微信群号等引导用户加群等内容信息
 金融广告主头像、名称重点规范
 不得涉及“股市内参”等可能涉及金融内幕资讯的名称
 公众号名称不能涉及“X股”等对收益有暗示的描述，如“牛股”、“妖股”、“黑马股”等
 不得涉嫌夸大、误导宣传，明显承诺性商品或服务内容
 如：3分钟涨停、股票涨停预报、钞好赚等带有受益承诺的描述
 如：秒下钱、秒贷、即刻到账等与贷款承诺相关用词
 如：官方免费申请，官方免费办理等容易误导为是微信或腾讯官方的词汇
 如投放朋友圈广告，则公众号名称不允许使用个人IP类命名（如：王某评股），推荐使用企业名或产品名
 活动重点规范
 广告素材中需对活动内容进行清晰描述，包括但不限于：活动时间、参与规则、参与路径、奖品内容及奖品使用方式等
 赠送红包、优惠券类活动，奖品需真实有效，不得出现宣传赠送内容与实际不符的情况  
 如：素材中声明赠送“红包“，实际领取内容非现金红包而为“优惠券”
 四、微信广告金融行业标注附录
 1. 涉及金融投资理财、贷款金额或办理信用卡额度的描述，需要在广告中标注提示语（如广告内容中无涉及贷款金额或信用卡额度，则不需要标注）标注方式如下：
 视频标注方式 ：标注信息需清晰可见且持续出现，若视频无法修改，可在推广页首屏再次标注，字体需清晰可见
 图片、图片卡片标注可在图片任意一个位置，标注字体需清晰可见
 
 
 朋友圈广告标注方式：广告图片/视频任意一个位置标注或推广页第一屏标注，标注字体需清晰可见
 公众号广告标注方式：（标注字体需要在手机端清晰可见）
 品牌活动：图片、图片卡片、优雅大图广告需在广告位或推广页第一屏标注；图文类需在推广页第一屏标注
 关注类：图片卡片需在外层图片标注；关注卡片图文类需在公众账号内标注（功能介绍或菜单栏或自动回复）
 视频广告：视频中或详情页第一屏清晰标注，需持续展示，且字体需在手机端清晰可见
 iOS下载类：在外层图片标注
 安卓应用下载类：使用微信模板页，需在外层或推广页第一屏标注；非模板页面，需在外层标注
 推广页标注方式：推广页第一屏显著位置清晰标注
 
 护肤彩妆一、行业准入规范
 1. 开放的二级行业
 护肤彩妆
 
 美容工具
 2. 护肤彩妆行业禁投
 微信广告暂不支持除染发、烫发、美白、祛斑、防晒、育发、脱毛外的特殊用途化妆品准入（包括但不限于特殊用途化妆品中含美乳、健美、除臭、去疤功能的化妆品）
 3. 微信广告开放能力
 推广目标：均支持投放
 广告位：均支持投放
 购买方式：均支持投放
 4. 护肤彩妆行业资质
 若为国产非特殊用途化妆品，提供《国产非特殊用途化妆品备案登记凭证》
 若为国产特殊用途化妆品，提供《国产特殊用途化妆品批注证书》及“国产特殊化妆品批准文号”
 若为进口品牌，提供《进口化妆品卫生许可证》或《进口非特殊用途化妆品备案登记凭证》或《进口特殊用途化妆品备案登记凭证》
 5. 投放特殊说明
 广告素材商品品身上必须体现商品品牌及品名，且该品牌需与《非特殊用途化妆品备案登记证》或《特殊用途化妆品备案登记证》或《进口非特殊用途化妆品备案登记凭证》或《进口特殊用途化妆品备案登记凭证》上的品牌及品名一致
 6. 经营形式资质：
 若为线上（平台类网站），提供《增值电信业务经营许可证》
 若为线上（非平台类网站），PC网站提供工信部ICP备案截图，APP提供APP在应用宝的截图，网店可提供网店后台截图
 二、投放资质要求
 1. 知名人物、动漫形象
 广告出现知名人物/动漫名义或形象的，包括但不限于图片展示、直接或间接表明名人是商品/服务的代言人、明星同款等信息的，广告主须提供名人本人或其经纪公司与品牌方签订的肖像授权书或代言合同，或者提供动漫权利人（公司或个人）的合法授权或合作协议。
 2.第三方合作
 广告中若声称商品/服务是特定媒体、会议、活动的专用、指定、推荐、合作商品/服务等的，广告主须提供其与相应媒体、会议主办方、活动主办方签订的合作协议。
 3. 数据描述
 广告中若出现引用具体数据（如月销量X万件、累计销售X件）、统计资料（为X万用户提供过服
 
 务）、调查结果（如市场占有率、实验数据等）、广告主内部数据等，广告主须注明数据来源、 时间，并提供相应国家权威检测机构提供的数据证明。
 护肤彩妆行业出现用于说明产品功效的具体数据描述,除标注数据来源与时间（随标）外，须提供国家权威检测机构出具的数据证明，（若拒绝标注数据来源及时间或无法提供数据证明则认定为无法证实的承诺性描述词汇，不予投放）。 包括但不限于以下情况：
 具体时间＋具体效果（7天美白，30天修复，9周淡化细纹，一整天不脱妆, 24小时高遮瑕）
 具体用量＋具体效果（1瓶修复疤痕）
 具体数据＋具体效果（紧致上扬＋49%）
 4. 性能效果
 针对整体性能及效果，特别是针对非常见的功能、成分描述，广告主应具有相关权威检测机构提供的质检报告说明，避免出现虚假广告问题。
 非常见成分包含非常见成分或非常见成分含量
 
 如：蚕丝材质
 
 如：零防腐剂、零酒精、98％高纯度抗氧化阿魏酸
 三、行业规范要求
 1. 该行业法规规范
 不得出现宣传医疗作用的词汇或者使用医疗术语。
 
 如：消炎、抗炎、活血、解毒、抗敏、防敏、脱敏、祛瘀、医疗、疗效、微整形、药妆、注射、基因技术、医学护肤、病邪、阴阳失调、治愈、疗程、生发、毛发再生、止脱
 涉及化妆品名称、成分、制法、性能或者效果描述，不得出现无法证实的虚假夸大描述（包括但不限于不符合常识的描述、夸大描述、极限词描述等）
 不符合常识的虚假夸大描述
 
 如：用了XX产品，黑眼圈完全去除了、祛除黑眼圈、告别黑眼圈、跟黑眼圈说拜拜（常识中黑眼圈并不能完全去除的，可使用“淡化”、“改善”来描述功能，如淡化黑眼圈）
 
 如：消除顽固性颈纹（顽固性颈纹并不能完全消除的，可使用“淡化”、“改善”来描述功能，如淡化颈纹、改善颈纹问题）
 
 如：物理遮盖美白产品如：遮瑕膏、粉底液等，出现美白、亮白等误导为化学美白的描述（若该产品并非持有《国产特殊用途化妆品批注证书》的美白类化妆品，产品并不具备化学美白功效，建议使用带有使用产品覆盖皮肤后达到的效果场景描述，如：涂哪白哪、一喷就白）
 
 如：“天然仙人掌籽面膜”、“天然白米精华”等形容产品是“天然”的（常识中护肤彩妆产品的制造不可能完全不经过加工，可描述“产品原材料中含有天然XX成分”）
 
 物理化学性能混用描述
 
 如： 遮瑕膏可使用“遮盖色斑”的描述，但不能使用“去除色斑”
 功效性描述
 
 如：“去除/告别/修复/消除/消灭眼部细纹”（涉及“去”、“祛”、“去/祛除”、“告别/修复/消除/消灭+肌肤问题”属功效性文案暂不支持投放。可使用未明确指向最终功效效果的拟人动作类修辞描述，如“抚平/平滑/赶走/弹走眼部细纹；紧致眼周、轻薄贴妆、不闷痘、隐形眼妆”）
 承诺性描述
 
 如：“7天美白，30天修复，9周淡化细纹，一整天不脱妆, 24小时高遮瑕”（涉及具体限定时间形容商品使用效果句式描述不支持投放。可使用未涉及具体限定时长形容商品使用效果，如“持久遮瑕”）
 
 如：“1瓶修复疤痕”（涉及具体限定数值用量形容商品使用效果句式描述不支持投放。可使用持续性描述，如“坚持使用效果更佳”、“持续使用效果看得见”等）
 
 如：“这款眼膜一贴见效”（化学类护肤品涉及具体限定数值动作次数形容商品使用效果句式描述不支持投放，但物理遮盖类化妆品不限制，如粉底液产品可使用“一抹就白”）
 顶级（极限）/绝对化描述
 
 如：XX产品/成分修复能力达到巅峰（顶级词汇）
 
 如：“最新创造”、“最新发明”、“创世级”（绝对化用语）
 广告不得直接或间接贬低竞争对手的产品、服务：
 
 如：XX品牌面膜容易引起皮肤过敏（虚构竞争对手的产品、服务存在瑕疵、质量安全问题等）
 
 如：比其他面膜补水三倍（声称自己的产品、服务的质量、价格等都比竞争对手好）。
 未提及其他具体品牌的对比描述须标注“与本品牌其他系列产品进行比较”，否则按间接贬低竞争对手产品/服务处理
 
 不得使用虚假用户评价
 2. 该行业创意规范
 素材形象不得使用病患处放大图片
 
 外层图片以及外层视频首帧不支持单独出现局部器官素材
 
 外层视频不支持整个视频均为面部某一局部器官展示，需在视频首帧添加全脸片段
 
 若使用前后效果对比素材
 彩妆类产品及染发类产品可使用妆前妆后效果对比图片，但外层图片及外层视频禁止出现局部放大人体素材
 
 
 作用于人体针对非不可逆肌肤问题有即时性改善效果的功效，如“补水、消除眼袋浮肿”功效的前后效果对比素材
 (需全程添加清晰可见的警示语：使用效果以个人情况为准)
 
 作用于人体针对不可逆肌肤问题需长期使用才能起改善效果的功效，不支持使用前后使用效果对比素材，包括但不限于：美白、淡皱、祛痘、祛斑、育发防脱等
 
 
 祛痘、祛斑、脱毛、育发类商品若投放线上售卖类活动：
 广告一级推广页中需展示带商品标签的商品实拍图，实拍图中必须能清晰展示成分表、生产许可证编号（进口商品可免）、生产者的名称/地址/联系方式、条形码信息（若条形码与生产许可证编号、生产者的名称/地址/联系方式不在同一包装界面上，可分两张图展示在素材内）
 若广告推广目标为“推广公众号”，一级推广页为历史消息列表页，则带食品标签的商品实拍图可支持在最近发布的一条历史消息中展示
 商品标签上显示的生产许可证号需与提供的《非特殊用途化妆品备案登记证》或《特殊用途化妆品备案登记证》上的编号保持一致
 
 祛痘、祛斑类商品特殊素材要求：
 广告支持使用真人/卡通形象的痘症、斑症素材，但禁止出现严重、全脸分布或呈块状密布类素材影响用户体验
 
 祛痘、祛斑类商品特殊素材要求：
 广告支持使用真人/卡通形象的痘症、斑症素材，但禁止出现严重、全脸分布或呈块状密布类素材影响用户体验
 
 
 脱毛类商品特殊素材要求：
 （1）外层图片或视频禁止出现露出带毛腋下的影响体验素材
 
 （2）外层图片或视频禁止出现浓密的毛发素材
 
 （3）外层图片禁止使用脱毛前后对比效果图 
 (外层视频可以展示动态脱毛过程，但需保证美观感，视频首帧禁止使用毛发浓密素材且展示的身体范围需能直观看出是手臂或腿部，不可截断展示或局部放大展示）
 
 育发类商品特殊素材要求：
 （1）禁止出现由于发量问题引起的负面生活问题场景的描述
 如：脱发找不到女朋友、工作
 （2）外层图片或视频素材支持使用正常发量的人物形象
 
 （3）广告中不支持使用育发前后效果对比素材
 
 （4）推广页若出现地中海人物形象，仅支持出现一次，且仅支持出现一个人头
 
 自媒体1. 行业准入说明
 开放行业
 目前自媒体开放的行业主要有科教文化、社会、时尚美容、亲子育儿、美食、汽车房产、生活、旅游、情感美文。
 准入规范
 注册时间大于等于30天，原创文章（自主撰写或约稿）占近30天文章总数比率超过50%（包括已删除的文章），近30天文章总数至少4篇。
 其他相关行业说明
 按照自媒体标准审核
 准入时行业非自媒体，但实际运营内容为自媒体，按照自媒体标准审核。
 按照对应行业标准审核
 金融类：涉及金融具体业务（如，股票咨询等），需要从“金融”行业下对应的子行业准入，提供相应资质
 小说类：涉及到书籍在线阅读，需要从“文化娱乐-在线视听/阅读”准入，提供相应资质
 动漫类：涉及到具体动漫形象，如：阿狸，需要从“文化娱乐-漫画”准入，提供相应资质
 在线漫画阅读类：需要从“文化娱乐-在线视听/阅读”准入，提供相应资质
 微信广告开放能力
 推广目标
 本地推广不支持投放
 广告位
 公众号互选广告不支持投放
 购买方式
 排期购买不支持投放
 更多准入说明详见：
 自媒体行业分类及资质
 2. 暂不支持投放内容
 两性类：两性类低俗文章等
 迷信类：星座宗教风水等
 时政类：反动言论类等
 医疗类：医疗、药品信息、医疗美容、整形美容信息发布等
 养生类：保健调养、饮食营养，养生资讯等
 段子类：搞笑段子，荤黄段子，恶搞段子，搞笑视频等
 娱乐八卦类：娱乐新闻，明星隐私等
 金融类中，若内容涉及金融相关业务，需要从金融行业下对应子行业准入，并提供相应资质才能准入
 科教文化类中，若内容涉及以微信经营资讯为主要内容，则不准入；若内容涉及美女图集，美拍类，则不准入
 3. 审核规范
 公众号整体内容
 不得推广存在色情（包括色情小说，色情视频，色情文章，色情图片等，包括任何擦边色情、暗示色情、标题党等，如：午夜激情），毒品，赌博，有违公众秩序，政治敏感类内容；
 不得宣传或销售易对用户易产生损害的药品（卵巢保养、防衰老，缩阴药物，子宫保养，女性调养，男性补肾等）、医疗器械、丰胸产品、减肥产品（减肥药物，减肥食品）和增高产品；
 自媒体行业广告历史消息文章数量不得少于4篇，投放过程不得恶意清空历史消息，包括但不限于发布无文字或者无意义内容的文字、音频文章；
 不得在历史消息末尾，阅读原文，帐号自动回复，自定义菜单，菜单链接中的H5外链中推送与帐号无关的微信帐号
 不得在素材或运营内容（关注自动回复，自定义菜单标题，自定义菜单落地页，自动消息回复，模板消息回复，公众号功能介绍，历史消息，历史消息查看原文链接内容等）推广个人微信号，微信群，未认证微信号、QQ群、个人手机号等；
 其他详见：
 公众号规范
 公众号名称
 不得涉嫌夸大、误导宣传，明显承诺性商品/服务内容；
 不得涉及“股市内参”等可能涉及金融内幕资讯的名称；
 不得包含涉及暴力、色情，或暗示“性便利”等词语；
 关注类广告名称不得含有“无实际意义的字母”；
 如：“教你做个好麻麻LA”，“教你做个好妈妈123”，“教你做个好妈妈%$”
 公众账号名称需与账号运营内容有关联性，不得为无关联名称；
 如：账号历史消息为育儿咨询，但是名称为美容美发，不允许投放
 公众号头像
 不得涉及暴露、低俗、丑陋、色情，或者打擦边球，给人性暗示等；
 知名人物头像需要补充上传人物授权（影视人物明星，政治领导人，业内专家等）；
 功能介绍&素材规范
 不得出现极限词汇，诱导关注（包括但不限于文字描述，符号引导，如箭头等）；
 不得使用广告法禁止使用的绝对化用语；
 如：北京最受欢迎的店铺
 不得有涉及承诺性描述；
 如：“推荐涨停股”、“轻松减掉XX斤”、“十天祛痘”等
 不得推荐无关联个人微信号，微信群等；
 不得使用容易引起歧义的词语；
 其他推广类型规范
 推广外链，外链内容为公众号文章：
 当文章无实际活动、促销、品牌、商城等推广目的时，即纯资讯文章时，文章内容需为原创，且含有音频的文章暂不支持投放；
 当有实际活动时，当有实际活动时，活动需与自身品牌相关，不得代其他商家进行活动推广；
 推广外链，外链内容为历史文章页：
 历史文章页暂不支持通过推广外链进行推广公众号，建议选择推广目的“公众号推广”进行广告创建。
 生活服务行业准入说明
 开放行业
 生活服务行业开放免费外卖券分销平台
 准入规范
 1、仅支持推广优惠券免费领取的形式，不得涉及卡券售卖
 2、需提供涉及外卖平台分销授权（仅接受一级授权）
 如：美团、饿了么
 3、外层图片素材不可出现具体的领券金额，避免宣传与实际领取金额不一致
 4、外层视频素材需增加警示语：“领券金额以实际为准，视频内容仅为领券流程示意”（建议全程标注）
 5、活动规则或限制条件需清晰明确，不可误导用户
 如“XXX都没花钱 ”等误导是免费商品的描述
 游戏一、 行业准入规范
 1. 开放的二级行业
 角色扮演、策略、体育、音乐、模拟经营、休闲、益智、射击、养成、格斗、冒险、卡牌、竞速、MOBA、综合性游戏门户网站
 2. 游戏行业资质要求
 具体类型游戏准入资质：《国家新闻出版广电总局批准的版号》或《文化部游戏备案证明》或《文化部批准文件（进口游戏）》
 综合性游戏门户网站： 《网络文化经营许可证》 或《网络出版服务许可证》或《互联网出版许可证》
 3. 游戏行业禁投
 聚合游戏平台，包括但不限于直接跳转到聚合页面、进入单个游戏后再进入聚合页面、退出小程序时跳转到聚合页面（包括通过投放关注类游戏资讯引流到游戏下载页面或游戏聚合页面）等等
 私服外挂
 游戏衍生服务：包括但不限于游戏代练、装备帐号交易、游戏币或点卡充值
 任何私服相关内容。如私服、变态私服等
 涉及钱、红包、话费、赚钱、微商推广、招代理、聚众赌博等线下金钱交易的游戏。
 4. 游戏开放能力
 推广目标：小游戏仅支持投放“小游戏推广”的推广目标；游戏APP下载仅支持投放“应用下载”的推广目标
 广告位：小游戏推广暂不支持投放激励视频广告位，其余均支持投放
 购买方式：均支持投放
 二、 投放资质要求
 1. 不得使用未经授权的第三方形象或标识
 广告中使用他人的注册商标、版权作品、明星或名人肖像形象（如照片、绘画、演出画面）等内容的（包括但不限于游戏名称、游戏场景情节、游戏人物名称、游戏人物形象等来源于知名电视剧或动漫等），广告主须提交前述内容权利人（公司或个人）的合法授权或合作协议
 不得抄袭游戏素材，未经授权不得使用或模仿第三方游戏的人物形象、场景、标志性logo或代表性图标等作为创意或创意元素，包括但不限于：
 人物形象：指游戏内特有的人物形象或NPC形象；
 场景、道具：可明确辨识的游戏场景；
 标志性LOGO或代表性图标：游戏logo、游戏内具有代表性内容的图标等；
 游戏广告中使用如“当年在帝国时代里一起盖的房子”的文案，暗喻与经典知名游戏的关联性，需提供授权。
 广告中涉及与第三方有合作或联合出品等，广告主须提供其与相应第三方签订的合作授权协议
 2. 涉及奖项和数据
 广告中展示获得奖项、评比结果、荣誉称号等信息的，广告主须提交相应的证书，证书上包括但不限于出现奖项名称或奖项证明等（奖项相关描述不得包含广告法限制的极限词词汇）
 广告中若出现引用具体数据，包括但不限于：在线人数、下载量、排名等，广告主须真实，有效注明数据来源、统计时间等，请在广告中备注数据来源和统计时间
 3. 活动备案
 游戏活动为奖励现金红包及实物兑换，需提交活动备案
 游戏活动为概率性的抽奖活动（如集碎片抽手机等），需提交活动备案
 三、 行业规范要求
 1. 游戏行业需重点遵循的法律和平台规范
 不得损害国家、民族、社会的形象、利益及安全，包括但不限于：不得使用国家、军用等相关元素（如具有代表性的建筑、地图、标志、时政热点）等
 文案不得涉及包括但不限于以下内容
 不得使用敏感类词汇
 
 如：政治、军事、时事相关，开局只是小官，一步步登上皇位等
 游戏广告中不得出现“打boss”等含有打压boss意思的相关文案
 图片不得涉及包括但不限于以下内容
 不得使用真实军用设施或装备图片作为广告创意，可使用游戏内元素
 不得使用任何国家地图、世界地图或截取部分地图
 不得使用任何国旗、具有代表性的建筑、logo等可代表某一国家的标识
 不得使用任何军用logo标志、特殊符号等可代表某一国家军队的标识
 不得违背社会风序良俗和社会精神文明建设要求
 不得含有诱发未成年人模仿违反社会风尚良俗和违法犯罪行为的内容，以及血腥、暴力、恐怖元素等妨害未成年人身心健康的内容
 文案
 
 如“杀人换装备”“一键当上老大”“体验当杀手”等描述
 图片、视频
 
 出现伤害身体过程（例如刀子插入身体）和鲜血喷涌、血流成河、血流满地等场景；射击类不可出现直接对准头部或真实人物的射击，如图：
 
 直接出现暴力或大面积鲜血；若出现溅血画面，建议删改违规场景或修改血液颜色为红色柱状光效或修改血滴/血渍颜色，如图：
 
 出现巨兽打斗场景、相互吞噬、撕咬等血腥场景，如肢体撕裂、浴血、咬食、断头等，如图：
 
 出现腐烂、尸体、僵尸骷髅形象等，如图：
 
 
   出现多头、多手、多足的巨兽类形象，如图：
 
     投放黑社会、杀手、混混等角色扮演类游戏，含有诱发未成年人模仿违反社会风尚良俗和违法犯罪行为的内容，如图：
 
 不得涉及擦边、性暗示、着装暴露的角色和场景等
 文案
 
 如：使用两性相关“管好老公/老婆、老公/老婆不在才敢玩”等
 图片、视频
 
 出现着装暴露或爆乳的素材：若出现人物角色形象，需遵循胸部暴露面积不得超过30%，可缩小胸部比例或增加不透明物进行遮挡，且不得出现明显乳沟线
 
 出现深V露沟：胸线露出不得超过1/2；或只露沟1/2不露其他部分，未出现爆乳，则不限制
 
 出现特写/放大角色身体部位及分解展示人物行为，如特写胸部、臀部、嘴巴等部位，分解展示沐浴更衣、臀部扭动、胸部抖动等行为，如图：
 
 
  不得出现选妃/三妻四妾等违背社会主义精神文明的元素及描述，如图：
 
 角色扮演类游戏不得涉及官场或官府负面状态的相关描述或场景
 不得涉及贪污腐败等的相关描述与场景
 文案
 
 如：“这位县令知法犯法监守自盗、同流合污、贪污、捞外快“等的描述
 图片、视频
 
 使用送金砖/钱财、贪污、捞外快等场景或描述，如图：
 
   不得涉及犯罪刑罚等的相关描述或场景
 文案
 
 如使用“抄家、斩囚犯、通缉囚犯、严刑逼供”等或涉及用刑、劳役相关描述
 图片/视频
 
 禁止使用斩囚犯、抓捕囚犯、惩戒犯人、劳役囚犯、通缉囚犯、严刑逼供等相关描述及场景
 
 禁止使用凶杀，人物尸体类元素（可使用线条描绘）如图：
 
 其他文案描述要求
 不得使用谐音、不文明词汇
 
 如“麻痹戒指”
 不得使用挑衅或叫嚣类文案
 
 如“敢不敢XXX、XXX算我输、XXX当爷、XX当爸爸等”
 不得使用沉迷类相关文案
 
 如“通宵玩、玩一晚上、上瘾、停不下来等”
 不得使用赚钱类相关文案
 
 如“RMB、人民币、非RMB必玩等”
 不得投放虚假或者引人误解的广告，如捏造、夸大不符合事实认知或不符合逻辑的内容，使用绝对化/虚假/承诺描述等
 文案中不可使用捏造或夸大内容，不可使用不符合事实认知或逻辑的描述
 
 如：“这把刀能卖30万”
 如：涉及无病毒/无广告/模仿系统/星级/游戏评论/等级评分评价等内容，如图
 
 不得使用虚假诱导用户点击的文案和图标
 文案不得诱导用户点击操作，如：点击下载领取大礼包，实际广告中无礼包可领取
 图片不得使用诱导用户操作的元素
 
 如：关闭按钮等，朋友圈图片不得使用按钮图标
 
 游戏行业广告中不可出现虚假倒计时或其他虚假限时限量描述，如“今日限免”等
 2. 游戏行业需重点遵循的创意规范
 图片视频需遵循创意规范要求
 不得使用像素模糊、比例失调的图片或视频，如图：
 
 图片需遵守的创意规范要求
 不得使用造成刺眼效果或密集凌乱视觉的图片，如色彩饱和度过高、发光过于强烈等
 出现高光的元素勿占用整体图片面积超过50%，不得出现堆叠；建议使用单个光圈、线条的形式表现，避免同一场景出现多个亮色的元素，如图：
 
 不得含有大量文字/方框/系统功能图标/游戏角色或武器等的堆积、堆叠，勿占用整体图片面积超过50%；建议减少图标/方框/宫格/道具等元素，减少占比面积或以分散形式呈现，或者使用装备背包的形式，如图：
 
 使用公众号底部广告的单图卡片样式，按钮及应用名称区域必须保持底色单一，不得使用元素过多、色彩过多的背景图，且不建议使用接近白色的背景色，如图：
 
 不得使用不完整游戏界面，如图片中的游戏界面被截断
 
 小游戏推广目标banner广告位图片审核规范：
 
 小游戏广告banner广告外层图片不支持出现“按钮”形式，包括但不限于开始游戏、开始、选择、领取按钮
 
 
 
 广告素材不支持出现“开始游戏、继续游戏、跳过”等具有误导性的文案引导用户点击
 
 
 广告外层图片不支持使用边缘白底或透明底创意
 
 视频需遵守的创意规范要求
 视频广告暂只支持出现一个视频画面，且背景不得以PC界面录屏方式出现，可为玩家试玩场景
 非游戏试玩过程的视频，不得使用单张图片不断进行切换的形式
 视频声音需要连续且清晰，音量大小要合理
 推广页需遵循创意规范要求
 推广页中若需要通过按钮引导用户点击进行下一步操作（包括但不限于引导下载应用、进入小游戏），则按钮的引导文案需与实际操作行为相符合（如：按钮文案为登录领取优惠，点击后跳转链接不得为下载应用），若按钮引导文案与实际操作不一致，则需在按钮下方（若使用多个下载按钮，则需在首个按钮下方）备注操作步骤的相关描述（描述文字颜色不得与背景颜色过于相似，需清晰易识别），如图：
 
 使用原生页为推广页的广告，推广页中不得出现二维码或小程序码或条形码
 软件工具一、行业准入规范
 1. 开放的二级行业
 开放的二级行业：办公商务软件、系统软件、摄影摄像、天气日历、地图导航、体育健康
 2. 软件工具行业资质要求
 《增值电信业务经营许可证》或接入腾讯开放平台的PC软件截图或【APP在应用宝或苹果商店截图】或著作权登记证书或商标证
 3. 根据业务范围选择提供或不提供
 系统软件：若涉及安全产品，需提供【计算机信息系统安全专用产品实施销售许可证】
 地图导航：
 若涉及地图、导航，需提供：测绘资质证书或地图编制资质证件
 若涉及查违章，需提供：违章查询接口的合作协议
 若涉及停车应用，需提供：《增值电信业务经营许可证》
 二、软件行业需重点遵循的法律和平台规范
 1、不得利用图标或按钮的操作功能误导用户，诱骗用户点击广告，包括但不限于虚假播放、关闭、暂停按钮、假分页、翻页图标、点赞、评论、loading等
 2、不得模仿系统或网站或软件发出的消息或通知，使消费者误以为是系统行为
 
 
 清理软件类
 1、不得涉及虚假宣传或误导用户的内容：
 如，清理软件类工具宣传“2年都不会再卡”“手机可以再用3年”
 2、不得过分夸大宣传超出软件本身的功能：
 如，宣传软件可以修复手机硬件“修复手机电池
 体育健康类
 不得在素材中宣传医疗或可代替专业医疗器械检测等内容，
 如“检测血压、血氧检测、贫血”
 可支持：心率检测、步数统计等功能宣传
 
 定位类产品特殊规则
 1、素材和落地页需添加“双方同意才开启”的相关内容：定位软件素材需添加警示语，视频广告需全程展示，如“产品定位功能须双方下载同意后才可开启，不涉及侵犯个人隐私”，警示语需清晰可见
 2、产品宣传、内容不能包含“跟踪”“手机跟踪器”“历史轨迹”等泄露用户隐私的描述
 教育一、 行业准入规范
 1. 开放的二级行业
 学历教育机构、学前教育、非学历教育-基础教育、非学历教育-其他职业教育、非学历教育-公务员培训、非学历教育-IT技术培训、非学历教育-语言培训、非学历教育-学历培训、非学历教育-留学出国、非学历教育-才艺培训、教育综合
 2. 教育培训行业资质
 学历教育机构，需具备《办学许可证》或《事业单位法人证书》或《民办学校许可证》
 非学历教育-留学出国
 留学：无资质要求
 境外游学：需具备《旅行社经营许可证》或 《与旅行社（含境外）相关合作协议》
 其他非学历教育行业
 需具备：《办学许可证》或《事业单位法人证书》或《民办学校许可证》或《营业执照》（经营范围含有教育、培训等相关业务）
 3. 经营形式资质
 若为经营形式为线上（平台类网站），提供《增值电信业务经营许可证》
 若为经营形式为线上（非平台类网站），PC网站提供工信部ICP备案截图，APP提供APP在应用宝的截图，网店可提供网店后台截图
 4. 教育培训行业禁投
 代考、代写论文服务：顶替参加考试、代写论文等
 致富，成功学培训机构
 无法颁发学历证书的培训机构不支持投放MBA（工商管理硕士）、IMBA（国际工商管理硕士）、MSF（金融学硕士）等硕士及以上学历教育广告
 记忆力、智力、情商等培训类
 医疗美容、按摩足浴培训类
 心理健康辅导类，如戒赌瘾、网瘾
 学校转让类
 无法提供学历教育机构资质的医学类培训机构
 二、 行业规范要求
 1. 微信广告开放能力
 推广目标、广告位、购买方式：均支持
 2. 行业法规及素材规范要求
 不得对通过考试、升学、获得学位学历或合格证书，或者对教育、培训的效果作出明示或暗示的保证性承诺：
 不得使用具体时间+具体效果描述
 
 如：“1个月包过”、“3个月英语提高20分”、“1个月拿本科”等
 不得使用其他暗示性承诺用语
 
 如：“不用上大学也能拿本科”等
 不得使用国家资格证书或学历证书等第三方证书做为素材，暗示获得教学效果
 不得明示或暗示有相关考试机构或其工作人员、考试命题人员参与教育、培训
 
 如：“高考命题组专家参与培训”“清华老师出任培训讲师”等
 不得利用科研单位、学术机构、教育机构、行业协会、专业人士、受益者的名义或形象作推荐、证明
 
 如：“张三同学高考数学满分，获得清华大学录取”“高考状元自述在校成长""学生手持有成绩单结果的试卷”等
 
 不得使用误导用户的描述
 经营性培训机构不得直接或间接使用第三方院校或学校大门、校区、教学楼等标志性建筑作为素材展示
 
 不得使用不符合实际学制或事实的描述
 
 如：一年学本科，初中上本科，免考上本科类，清华老师授课（实际是清华大学毕业的学生为授课老师），建议直接表达“清华毕业老师”且需须符合实际，如有虚假将承担法律责任
 非学位授予单位不得声称可以授予学位；学士学位由国务院授权的高等学校授予，硕士学位和博士学位由国务院授权的高等学校和科学研究机构授予；非学历授予单位不得声称可以授予学位
 
 如：“这里拿文凭”“这里涨学历（专科本科）”“轻松获得专科本科国家认可学历”
 不得使用培训前后效果对比内容作为广告创意
 
 如：培训前的成绩与培训后的成绩对比
 语言培训类在使用外文作为文案时，不能使用小语种作为文案，若使用英文等语言作为文案，应需与中文翻译一起使用，且不能使用负面词汇
 
 学历教育类广告投放的人群定向不得等同或高于所推广的学历级别，如推广专升本/考本科，学历定向应设置为本科以下定向
 食品一、 行业准入规范
 1. 开放的二级行业
 休闲食品、粮油调味、冲调饮用、乳制品、生鲜、酒水、食品综合
 2. 食品行业资质
 普通预包装等加工类食品或其他普通食品
 普通加工预包装食品需提供《食品流通许可证》或《全国工业生产许可证》或《食品经营许可证》
 含进口食品需提供：上述普通食品资质＋《入境货物检验检疫证明》（入境货物检疫检验证明，如是食品经销公司与物流公司或进口商之间合作，接受合作协议）
 普通非加工类生鲜食品：暂无资质要求
 宝宝所食用的奶粉、零食、辅食、营养品
 普通食品需提供《食品流通许可证》或《全国工业生产许可证》或《食品经营许可证》
 进口食品需提供上述普通食品资质+《入境货物检验检疫证明》（入境货物检疫检验证明，如是食品经销公司与物流公司或进口商之间合作，接受合作协议）
 若含婴儿配方乳粉销售，请确保《食品流通许可证》的许可范围包含“乳制品（含婴儿配方乳粉）”
 酒水
 国内生产需提供：
 —— “生产”资质提供《食品生产许可证》（含酒类）或《酒类生产许可证》或《全国工业产品生产许可证》（含酒类）
 —— 提供酒水的《商标注册证》。如商标注册人非开户主体、非酒水生产企业，还须提供商标授权（注：商标仅限一级授权）
 —— 提供该酒经国家规定或认可的省辖市以上食品或产品质量检验机构出具的该酒符合质量标准的检验证明
 国内经营销售需提供：
 —— 提供酒水经营企业的《食品经营许可证》（含酒类）或《食品经营许可证》（预包装食品销售）或《酒类批发许可证》或《酒类零售许可证》
 —— 提供酒水生产企业的《食品生产许可证》（含酒类）或《酒类生产许可证》或《全国工业产品生产许可证》（含酒类）
 —— 提供酒水的《商标注册证》。如商标注册人非开户主体、非酒水生产企业，还须提供商标授权（注：商标仅限一级授权）
 —— 提供该酒经国家规定或认可的省辖市以上食品或产品质量检验机构出具的该酒符合质量标准的检验证明
 进口酒经销商需提供：
 —— “生产销售”资质《食品经营许可证》或《食品卫生许可证》或《食品流通许可证》或《食品生产许可证》（含酒类）或《酒类生产许可证》或《全国工业产品生产许可证》（含酒类）或《酒类批发许可证》或《酒类零售许可证》之一
 —— 提供酒水的《商标注册证》。如商标注册人非开户主体、非酒水生产企业，还须提供商标授权（注：商标仅限一级授权）
 —— 经国家规定或认可的省辖市以上食品质量检验机构出具的该酒符合质量标准的检验证明＋《入境货物检验检疫证明》或《进口食品标签审核证书》
 食品综合
 普通食品需具备《食品流通许可证》或《全国工业生产许可证》或《食品经营许可证》或《餐饮服务许可证》（涉及宝宝食品则按照宝宝食品资质要求提供）
 进口食品：需具备普通食品资质+《入境货物检验检疫证明》
 新资源食品
 
 新资源食品不作为单独行业开户，食品推广中若涉及新资源食品，需要补充以下资质
 新资源食品广告主应提供国务院卫生行政部门核发的《新资源食品试生产卫生审查批准文件》或者《新资源食品卫生审查批准文件》，广告内容中应标明批准文号
 特殊营养食品广告主应提供省级卫生行政部门核发的准许生产的批准文件，广告内容中应标明批准文号
 3. 经营形式资质
 若为线上（平台类网站），提供《增值电信业务经营许可证》
 若为线上（非平台类网站），PC网站提供工信部ICP备案截图，APP提供APP在应用宝的截图，网店可提供网店后台截图
 4. 行业禁投
 燕窝、海参、鱼翅、花胶四类高价海味干货销售（若为即食类商品可支持，或在餐饮行业中燕窝、海参、鱼翅、花胶作为菜品类可以支持）
 活禽销售，如：农村散养走地鸡
 烟草
 保健食品
 5. 行业广告位规范
 投放朋友圈广告位需满足以下要求
 酒水行业暂不支持以线上分销经营为主的商家投放朋友圈广告（京东、唯品会等大型电商平台或大型品牌电商除外）
 酒水品牌投放朋友圈广告需提供商标注册证，经销商标品牌推广仅接受品牌商及一级授权
 二、 行业规范要求
 1. 微信广告开放能力
 推广目标：均支持
 广告位：见上述行业广告位规范
 购买方式：均支持
 2. 行业法规及素材规范要求
 不得投放虚假或者引人误解的广告
 不得含有“最新科学”、“最新技术”、“最先进加工工艺”等绝对化描述
 不得含有“纯天然”等描述，且对食品的描述不得直接使用“无添加”，如需使用，广告中需标记注释无添加元素
 
 如：不添加香精防腐剂
 不得出现与药品相混淆的用语，不得直接或间接地宣传治疗作用，也不得借助宣传某些成分的作用明示或暗示该食品的治疗作用
 婴幼儿配方奶粉需特别遵守以下规定
 不得明示或者暗示可以替代母乳，不得使用哺乳妇女和婴儿的形象，1段奶粉（6个月以内的奶粉）属于母乳代用品，不得发布广告
 涉及原料来源的（如生乳、原料乳粉等原料来源），应当如实标明具体来源地或者来源国（比如“新西兰进口奶源”、“源自澳洲牧场”等），不得使用“进口奶源”、“源自国外牧场”、“生态牧场”、“进口原料”等模糊信息
 不得明示或者暗示奶粉具有益智、增加抵抗力或者免疫力、保护肠道等的功能性表述
 不得利用医疗机构、医生的名义或者形象作推荐证明
 食品广告中涉及特定功效，不得利用专家、消费者的名义或者形象做推荐证明
 普通食品、新资源食品、特殊营养食品广告不得宣传具有保健功能，也不得借助宣传某些成分的作用明示或暗示其具有保健功能
 普通食品不得宣传含有新资源食品中的成分或者特殊营养成分
 即食燕窝、花胶、海参、鲍鱼等贵价即食类商品若投放线上售卖类活动：
 广告一级推广页中需展示带食品标签的商品实拍图，实拍图中必须能清晰展示配料表、生产许可证编号（进口食品可免）、生产者的名称/地址/联系方式、条形码信息（若条形码与生产许可证编号、生产者的名称/地址/联系方式不在同一包装界面上，可分两张图展示在素材内）
 若广告推广目标为“推广公众号”，一级推广页为历史消息列表页，则带食品标签的商品实拍图可支持在最近发布的一条历史消息中展示
 
 酒水应当遵循《酒类广告管理办法》，重点规则如下
 广告定向需在18岁以上，不得含有未成年人的形象（含未成年人的卡通形象）
 不得诱导、怂恿饮酒或者宣传无节制饮酒
 不得表现驾驶车、船、飞机等活动
 不得含有诸如可以“消除紧张和焦虑、增加体力、增强体力、强身健体、延年益寿、解除疲劳”等不科学的明示或者暗示
 不得把个人、商业、社会、体育、性生活或者其他方面的成功归因于饮酒的明示或者暗示，如“壮阳补肾、提高性生活、事业有成、成功人士的选择、重振雄风”等
 不得使用医疗用语或者易与药品混淆的用语
 不得含有不符合社会主义精神文明建设要求、违背社会良好风尚和不科学、不真实的其他内容
 禁止使用“专（特）供XX国家机关”、“XX（国家机关）专用”、“XXX省（市）指定专用产品”、“军队特供”、“军队特需”等借用国家机关名义背书或类似内容
 若投放线上售卖类活动：
 —— 广告一级推广页中需展示带食品标签的商品实拍图，实拍图中必须能清晰展示配料表、生产许可证编号（进口食品可免）、生产者的名称/地址/联系方式、条形码信息（若条形码与生产许可证编号、生产者的名称/地址/联系方式不在同一包装界面上，可分两张图展示在素材内）
 —— 若广告推广目标为“推广公众号”，一级推广页为历史消息列表页，则带食品标签的商品实拍图可支持在最近发布的一条历史消息中展示
 —— 还需提供食品标签上显示的食品生产许可证号对应的《食品生产许可证》
 
 
 房地产一、 行业准入规范
 1. 开放的二级行业
 房地产开发商、房地产中介、房地产线上平台
 2. 房地产行业资质
 房地产品牌商，如：万科地产、单楼盘（住宅、商业，综合体）买卖，如：碧桂园十里银滩
 开户必须提供《房地产开发资质等级证书》
 根据业务范围提供，如无相关业务可不提供：
 具体楼盘预售或销售推广，包括但不限于涉及价格、户型、出现楼盘名称或其他售卖行为（如看房、样板间开放、开盘、或对应楼盘营销中心举办相关活动）等：
 若涉及新盘销售，需提供：《预售许可证》或 《现房销售的备案证明》
 若涉及二手房销售广告，需提供：房屋产权证明
 产业园/商业地产出租，需提供：房屋产权证明
 房产中介：房地产中介服务机构包括房地产咨询机构、房地产价格评估机构、房地产经纪机构等，如中联地产等具体中介公司。
 开户必须提供《房地产中介机构备案证明》或 《房地产经纪机构备案证书》
 根据业务范围提供，如无相关业务可不提供：
 若涉及新盘销售，需提供：《预售许可证》或 《现房销售的备案证明》
 若涉及二手房销售广告，需提供：房屋产权证明
 若涉及房屋出租，需提供：房屋产权证明
 委托销售/出租的还需补充委托合作协议
 房产平台：涉及房地产租赁、售卖等内容的综合业务平台，如：链家地产、安居客
 开户必须提供《增值电信业务经营许可证》 或 工信部ICP备案截图 或 应用宝或苹果商店APP截图
 根据业务范围提供，如无相关业务可不提供：
 若从事中介业务，需提供：《房地产中介机构备案证明》或 《房地产经纪机构备案证书》
 若推广内容涉及新盘销售，需提供：《预售许可证》或 《现房销售的备案证明》
 若涉及二手房销售广告，需提供：房屋产权证明
 若涉及房屋出租，需提供：房屋产权证明
 委托销售/出租的还需补充委托合作协议
 3. 房地产行业禁投
 海外房产销售、投资、租赁
 房产投资或投资讲座
 未取得或不具备房产预售/销售证的楼盘项目
 融资或者变相融资的内容
 以房养老业务
 职业移民
 医疗服务、养老服务
 顶账房
 4. 其他准入要求
 广告主账号为具体品牌楼盘的时候不得代投放其他品牌，如 A 品牌的某楼盘公众号，不能代投放 B 和 C 品牌楼盘，但可以合作投放 A 品牌其他楼盘
 公众号名称必须与广告主品牌强关联，不得使用与自身品牌无关联名称
 二、 投放资质要求
 1.中介合作投放
 需要补充广告主与推广楼盘/产权方之间的合作协议，或推广楼盘授权函，授权投放协议可参考《（范例）授权书》：http://wximg.qq.com/wxp/mmad/data/wxad_auth_template.pdf
 2.房产平台合作投放
 提供房产中介与推广楼盘/产权方之间的合作协议或推广楼盘授权函
 并提供房产中介与房产平台的授权协议。授权投放协议可参考《（范例）授权书》http://wximg.qq.com/wxp/mmad/data/wxad_auth_template.pdf
 三、 行业规范要求
 1. 开放能力
 推广目标、广告位、购买方式：均支持投放
 2. 根据广告法及《房地产广告发布规定》以及微信广告房产行业广告审核规范，房地产广告的房源信息应当真实，房产广告必须遵守包括但不限于以下规范要求：
 房地产广告中涉及房地产价格评估的，应当表明评估单位、估价师和评估时间
 房地产广告使用其他数据、统计资料、文摘、引用语的，应当真实、准确地表明出处
 房地产预售、销售广告，必须载明以下事项：a开发企业名称、b预售或者销售许可证书号（详细的标注方式请参照五、微信广告房产行业标注附录）
 房地产广告不得含有风水、占卜等封建迷信内容，对项目情况进行的说明、渲染，不得有悖良好社会风尚
 房地产广告中涉及所有权或者使用权的，所有或者使用的基本单位应当是有实际意义的完整的生产、生活空间（详细的标注方式请参照五、微信广告房产行业标注附录）
 房地产广告涉及内部结构、装修装饰的，应当真实、准确
 房地产广告中涉及交通、商业、文化教育设施及其他市政条件/小区内部入驻机构等的，不得误导用户
 如在规划或者建设中， 应当在广告中注明“规划中”或者“建设中“，标注信息需清晰可见，不得有虚假介绍描述，如有虚假需承担法律责任：
 外层（图片/视频）或推广页提及的配套设施等，需在图片或视频或推广页对应介绍内容边上进行标注。
 
 
 
 房地产广告中涉及物业管理内容的，应当符合国家有关规定；涉及尚未实现的物业管理内容，应当在广告中注明，标注信息需清晰可见：
 涉及入驻的物业、描述物业等级等规范要求：
 外层（图片/视频/文案）提及的物业管理内容，需在图片或视频中进行标注；
 推广页：需在物业管理内容旁显著位置进行备注。
 不可以使用项目到达某一具体参照物的所需时间表示项目位置
 
 如：“楼盘距CBD20分钟车程”、“楼盘距市中心30分钟车程”等描述，可以使用“xxx距xxx x米/公里等
 不得违反国家有关价格管理的规定或虚假误导宣传：：
 不得出现哄抬房价的内容, 如：“楼王”、“地王”、“帝王核心区”等
 不得出现与国家房产价格要求不一致或者不合常理的低价首付描述
 贷款类：如“0首付”、“0利息”、“首付低至2万”、“首付低于三成”、 “首付分期”等
 分期付款：需在广告中说明付款方式、条件，及付款时间等规则信息
 广告中对价格有表示的，应该表示清楚为实际的销售价格及价格的有效期限
 为避免产生价格虚假或误导宣传，楼盘宣传或整体平台业务宣传须采用模糊价格，如“xxxx 万起”； 如是针对某一套具体的二手房源，可以出现具体的价格
 不得出现返本销售、变相返本销售、以租代售等的违规房产销售行为, 包括但不限于在租商铺出售租金返本，承包经营管理的酒店式公寓返本。
 购房条件规范
 房产广告中涉及不限购不限贷，需要在广告中说明“不限贷不限购”要求（三选其一）：
 说明无条件不限贷限购
 说明具体不限贷限购的条件，比如：须购买当地社保；或：不能用住房公积金贷款，只能贷款50%等
 说明标注：限购条件查询XX（当地政府）文件《XXXX》
 房产广告中涉及贷款服务的，应当载明提供贷款的银行名称及贷款额度、年期
 广告中不得含有广告主能够为入住者办理户口、就业、升学等事项承诺，且不得涉及描述“学区房、学位房”，可描述为楼盘周边有学校等设施
 不可直接或间接的出现升值或投资回报的承诺内容，如：“即将成为又一个陆家嘴、升值空间不可估量、增值/保值的明智选择、高回报率”等描述（暂不支持出现投资讲座内容）
 广告中的项目位置示意图比例需恰当，如与事实不相符，则属于虚假广告宣传，需承当法律责任
 广告中不得利用其它项目的形象、环境作为本项目的效果
 广告中使用建筑设计效果图或者模型照片，应当在广告中注明“效果图”的字眼
 房地产广告中涉及面积的，应当表明是建筑面积或者套内建筑面积（详细的标注方式请参照五、微信广告房产行业标注附录）
 房产广告中涉及赠送面积，需在广告中说明清楚赠送面积条件（如购房即可享受增送），赠送面积大小、赠送区域类型（如阳台、跃层高挑部分等） ，或在广告中例图标示清楚赠送区域类型，并在广告中说明房本实际面积大小
 四、微信广告房产行业其他重点规范
 房地产广告促销活动，需要遵守《微信广告活动投放规则》
 广告中涉及价格、营销活动等需要真实有效，不得有误导消费者，诱导消费
 资质命名要求：资质命名需以推广项目名称+资质编号（如预售证编号）命名
 五、 微信广告房产行业标注附录
 1. 预售/销售证编号标注规范要求：
 房产预售、销售广告中，单个楼盘推广，需要在广告位图片/视频中或推广页第一屏显著位置清晰标注预售/销售编号（建议10号字以上）；若涉及多个楼盘联动推广，每个楼盘均需标注预售/销售编号，可在楼盘信息旁标注或推广页任意位置统一标注，标注的信息必须在手机端清晰可见，具体标注方式如下：
 广告位图片/视频标注方式：
 朋友圈广告位标注方式：需在广告位图片/视频显著位置标注，标注信息需清晰可见
 
 公众号广告标注方式：（且字体需要在手机端清晰可见）
 品牌活动：图片广告需在广告位或推广页标注；图文类需在推广页标注：
 
 关注类：图片卡片需在外层图片标注；图文类需在公众账号内标注（功能介绍或菜单栏或自动回复）
 
 IOS下载类：iOS下载需在外层图片标注
 安卓应用下载：使用微信模板页，需在外层或推广页标注；非模板页面，需在外层标注
 视频标注要点 ：标注信息需清晰可见且持续出现，若视频无法修改，可在推广页第一屏位置再次标注清晰可见的预售/销售证编号；
 房产广告推广页标注方式：（第一屏显著位置清晰标注预售/销售编号）
 
 2. 预售/销售楼盘名称标注规范要求
 广告中推广楼盘推广名与预售证名字不一致，需在广告图片或推广页第一屏显著位置补充说明以下内容：注册名（预售证名）：A楼盘。推广名：B楼盘，若涉及多个楼盘联动推广，每个楼盘均需标注，在推广名旁边或推广页统一位置标注且标注信息需清晰可见，具体标注方式如下：且标注信息需清晰可见，具体标注方式如下：
 广告位图片/视频标注方式：
 朋友圈广告位标注方式 : 广告位图片/视频需在显著位置标注，标注信息需清晰可见
 
 
 公众号广告位标注方式：
 关注类：图片卡片需在外层图片标注；图文类需在公众账号内标注（功能介绍或菜单栏或自动回复）
 
 品牌活动：图片广告需在广告位或推广页标注；图文类广告需在推广页标注
 IOS下载类：iOS下载类在外层图片标注；
 安卓应用下载：使用微信模板页，需在外层或推广页标注；非模板页面，需在外层标注；
 视频标注要点：标注信息需清晰可见且持续出现，如视频无法修改，可以在推广页第一屏位置清晰标注预售/销售证编号
 朋友圈/公众号推广页标注形式：需在推广页第一屏标注清楚
 
 3.广告宣传涉及户型面积，需标注面积类型为“建筑面积 或 套内建筑面积”，具体标注方式如下：
 外层文案/图片/视频中出现面积描述，需在每个面积内容边上区域标注面积类型或是在图片或视频统一位置标注面积类型 ，标注信息需清晰可见，如图：
 
 
 
 
 推广页：在面积数字旁备注，也可以在推广页统一位置备注“以上面积均为建筑面积或套内建筑面积”，如图：
 
 4.房地产预售、销售广告，需要载明开发商、代理商等事项，具体标注方式如下：
 新房销售标注要求：在广告中明确代理商或开发商（产权方），如楼盘推广请标明：开发商为 xxxx，代理商为 xxxx； 如广告主则为开发商，只需明确开发商
 房产平台与房产中介合作推广，委托出租或出售标明：开发商为 xxxx，代理商为 xxx（实际业务提供者）或“由 xxx 房产中介提供业务支持”
 若涉及多个楼盘联动推广，广告推广页每个楼盘均需标注清楚明确代理商和开发商（产权方）
 汽车一、 行业准入规范
 1. 开放的二级行业
 汽车厂商、4S店及经销商、其他非机动车、汽车用品、汽车服务、驾校、二手车经营、出行服务、汽车综合
 2. 汽车行业资质
 汽车厂商
 若涉及买卖无需特殊资质
 若涉及汽车租赁，需提供《道路运输经营许可证》或《汽车租赁经营许可证》或《汽车租赁经营备案证明》
 4S店及经销商
 若涉及买卖无需特殊资质
 若涉及汽车租赁，需提供《道路运输经营许可证》或《汽车租赁经营许可证》或《汽车租赁经营备案证明》
 其他非机动车，暂无资质要求
 汽车用品
 儿童安全座椅，需具备《中国国家强制性产品认证证书》（3C证书）
 汽车服务
 若为维修救援类服务，请提供《机动车维修许可证》或《道路运输经营许可证》
 若为洗车打蜡类服务，暂不需要提供资质
 驾校
 需提供《道路运输经营许可证》
 二手车经营
 若为二手车拍卖，提供《拍卖经营批准证书》
 若为二手车鉴定评估，提供《二手车鉴定评估机构核准证书》或《营业执照》（经营范围内包含“旧机动车鉴定评估”、“二手车鉴定评估及咨询”，“机动车交易鉴定评估”，“二手车抵押、置换、评估、鉴定”等相关业务）
 若为二手车经销，不需要提供资质
 出行服务
 需具备《道路运输经营许可证》或《汽车租赁经营许可证》或《网络约租车平台经营资格许可证》或《出租汽车经营资格证》或 汽车租赁经营备案证明
 汽车综合
 暂无资质要求
 3. 经营形式资质
 若为线上（平台类网站），提供《增值电信业务经营许可证》
 若为线上（非平台类网站），PC网站提供工信部ICP备案截图，APP提供APP在应用宝的截图，网店可提供网店后台截图
 4. 行业禁投
 平行进口车销售
 抵押车销售
 电子狗、反雷达测速仪、隐形喷雾、卷帘式车牌架、雷达干扰器等
 二、 行业规范要求
 1. 微信广告开放能力
 推广目标、广告位、购买方式：均支持
 2. 行业法规及素材规范要求
 根据《汽车贷款管理办法》规定，汽车销售不得出现“0首付”的业务推广
 如出现“0首付”“1成首付”等低于法律规定的首付或购车方式，需告知购车金融方案为汽车融资租赁实现
 需在广告位素材标注”XXX首付由汽车融资租赁方案实现”信息要清晰可见
 需提供广告主主体的融资租赁资质，或提供与其合作融资租赁公司的合作协议，并提供该融资租赁公司在全国融资租赁信息网http://leasing.cbrc.gov.cn/的查询截图
 汽车类广告中出现具体机构贷款服务需要补充跟金融机构的合作协议，并在广告中说明相关金融业务和活动介绍，并引导到店咨询或电话咨询
 如是商家自身补贴优惠活动，需在广告中说明详细活动内容，并引导到店咨询或电话咨询
 涉及第三方汽车品牌logo商标等，需要补充授权；若补充授权，汽车平台涉及第三方品牌logo仅允许在车的车身、内饰直接出现，不支持单独作为图标使用，如图：
 
 汽车二手交易售卖广告，文案中有涉及评估汽车价值或测试汽车价格的文案，需要在预约登记页面清晰告知用户，登记信息后客服联系获取报价，如图:
 
 涉及汽车平台类促销活动，需要遵守
 《微信广告活动投放规则》
 
 工农业一、 行业准入规范
 1. 开放的二级行业
 能源材料、工业工程、建筑工程、农林牧渔
 2. 工农业行业资质
 能源材料
 危险化学品：《危险化学品安全生产许可证》或《危险化学品经营许可证》
 非危险类暂无资质要求
 建筑工程：需补充《特种设备生产许可证》和对应产品《检验合格的证明》
 工业工程、农林牧渔：暂无资质要求
 3. 行业禁投
 易燃、易爆品及制造原料
 有毒、有腐蚀性的化学品及制造原料
 烟花爆竹和烟花爆竹燃放装置
 制造爆炸物的书刊、视频资料等
 兽药、农药
 招商加盟
 二、 行业规范要求
 1. 微信广告开放能力
 推广目标：本地推广不支持投放
 广告位：除二级行业“建筑工程”外，其余二级行业朋友圈广告、公众号互选广告均不支持投放
 购买方式： 排期购买不支持投放
 2. 行业规范要求
 农作物种子、林木种子、草种子、种畜禽、水产苗种和种养殖广告，关于品种名称、生产性能、生长量或者产量、品质、抗性、特殊使用价值、经济价值、适宜种植或者养殖的范围和条件等方面的表述，应当真实、清楚、明白，并不得含有下列内容
 科学上无法验证的断言
 表示功效的断言或者保证
 
 如：“100%成活率”、“绝无虫害”等
 对经济效益进行分析、预测或者作保证性承诺
 利用科研单位、学术机构、技术推广机构、行业协会或者专业人士、用户的名义或者形象作推荐、证明
 
 如：“张大爷使用××驱虫剂，亩产量达到××”`,
  69: `
 一、主体资质
指广告主应具有相关政府部门颁发的、证明其作为独立的主体进行相关活动的资质证明，包括但不限于营业执照、组织机构代码证等。微信广告平台广告主需经过微信认证准入，以申请开通广告投放服务的微信公众帐号认证主体的基本资质为广告主基本经营资质。
二、行业资质
指广告主在广告投放过程中，若投放某特定行业商品或服务，应具有的相关政府部门颁发的，与该行业商品或服务相关的法定必备资质证明，比如生产、销售某类特殊商品所需的资质。 具体行业资质请参考《微信广告行业分类及资质》。
三、投放资质
广告投放中如涉及他人形象、使用数据、统计资料、调查结果等的，需要广告主提供证明资料，如授权文件、证明、说明函或确认函等（统称“证明文件”）。证明文件应当真实、合法，并且能够证明广告主享有必要的权利投放相关广告。广告主可以使用自己拟定的证明文件，也可以直接使用微信广告平台提供的模板或根据自身情况对微信广告平台模板进行修改后予以使用；但是，无论提交何种形式的证明文件，均应确保真实、合法并且能够全面涵盖广告主的使用范围。如广告涉及下述内容，广告主需要提交相关证明文件：
品牌、商标、版权作品

广告中使用他人的注册商、版权作品（如照片、绘画等）等内容的，广告主须提交前述内容权利人（公司或个人）的合法授权或合作协议。
知名人物、动漫形象

广告出现知名人物/动漫名义或形象的，包括但不限于图片展示、直接或间接表明名人是商品/服务的代言人、明星同款等信息的，广告主须提供名人本人或其经纪公司与品牌方签订的肖像授权书或代言合同，或者提供动漫权利人（公司或个人）的合法授权或合作协议。
奖项、荣誉称号

广告中展示获得奖项、评比结果、荣誉称号等信息的，广告主须提交相应的证书。
第三方合作

广告中若声称商品/服务是特定媒体、会议、活动的专用、指定、推荐、合作商品/服务等的，广告主须提供其与相应媒体、会议主办方、活动主办方签订的合作协议。
使用数据、统计资料、调查结果

广告中若出现引用第三方数据（如月销量X万件、累计销售X件）、统计资料（为X万用户提供过服务）、调查结果（如市场占有率、实验数据等），广告主须提供相应的第三方报告；如果相关数据是广告主内部数据的，广告主需提供相应的资料并加盖公章。
其他根据法律法规及腾讯要求，需要拥有证明资质的情况。`,
  68: `标点文字格式规范
通用要求
广告用语用字应当使用普通话和规范汉字，不得使用非标准的简化汉字，不得使用繁体字（除注册商标及企业名称外）
广告中不得单独使用汉语拼音，广告中如需使用汉语拼音时，应当正确、规范，并与规范汉字同时使用
不得单独使用或夹杂使用外国语言文字，广告中如因特殊需要配合使用外国语言文字时，应当采用以普通话和规范汉字为主、外国语言文字为辅的形式
注册商标、企业名称、品牌产品系列名称可直接使用外国文字，不需翻译
学术或技术等专有名词可直接使用外国文字，不需翻译

如：SWOT 分析法
广告中如借用某字为谐音字，需要在该字上加引号以示区别
暂不支持小语种和地方方言投放
不得使用非国家通用语言文字的字、词、短语、成语等，易引起误导，对社会造成不良影响

如：在广告中插入网络语言或仿照成语形式生造的词语，如：“十动然拒”“人艰不拆“等
不得在素材文案中使用特殊符号,如表情符号“：）” “-。-”、或由连续两个及以上的特殊符号组成，含义复杂的符号组等。
若该特殊符号为大众日常经常使用且易让人理解、不存在歧义的，则可支持使用

如：159 元/位
若该特殊符号在品牌名称或产品系列中必须出现，则可支持使用

如：梅德赛斯-奔驰、旗舰型号 UR-V 系列
文案内容规范
通用要求
不得在文案中出现股票代码、电话号码、URL 链接、微信号码、QQ 号、QQ 群号或其他社交软件号码等内容
不得使用不符合逻辑、不通顺的语句、句式、词组
不得使用容易引起歧义的词语
低俗类

如：“搞大了，老板哭晕在厕所”、“让我们谈谈房事”等
价格误导类

如：“手表就 1 块”，易让人误解手表只需1块钱
不得涉及诱导关注或者诱导分享文案

如：“关注公众号有机会领取奖品”等
不得涉及诱导点击的文案描述

如：点击获取 iPhone XS
不得出现产品销售量相关描述（包括销售量及销售量评比排名）

如：某某产品全国销量领先
不得使用“？9 元”来表述商品价格
不得使用负面词汇或负面场景进行描述，不得使用容易引起人心理恐慌或心理不适的词汇或语句

如：含“死”词汇，“亏死算了”等负面描述词汇

如：“XX大事件”、“出大事了”等容易引起人心理恐慌的词汇或语句

如：“老板疯了”等负面描述词汇
不得使用挑衅、命令、誓言、威胁用户等的文案
挑衅类文案

如：“居然买不起”、“不买不要点”、“不买不是男人”、“不看后悔”、“不穿鞋不要点”、“就怕你不敢玩”等
命令类文案

如：“是男人必须买”、“非买不可”等
誓言类文案

如：“对不起，折扣终于来了”等
威胁类文案

如：“不能再便宜了，再不买就迟了”、“不一定抢得到，再等不再有”等
不得使用明示或暗示用户个人特征属性文案（包括但不限于民族种族、宗教信仰、性取向、年龄、收入、婚姻状态、学历、地域、健康信息）

允许使用：描述或展示所推广的产品或服务本身，而非指向用户受众

不允许使用：明示或暗示用户具体个人隐私特征的文案，包含但不限于：

——“你”+相关属性用词明确指代用户属性的文案；

——肯定意义的猜测式疑问句式，“如果你是XX（某属性），请（做某种行为）”；

——强互动式的文案中指向用户属性。

不允许使用：争议性较大可能含有歧视性的个人属性文案
民族种族/宗教信仰

不允许进行宗教信仰的相关宣传，禁止宣传含有民族种族歧视的内容

如：如果你是XXX（民族或种族），一定要来这个餐厅

如：只有XXX（民族或种族）能享有这个福利
年龄/生肖

允许使用

为适婚年龄人士提供拍摄服务

不允许使用

寻找30-55岁的女神参加活动

90后专享专项活动

1971年出生

生肖属鸡的人看一看
地域

允许使用

超多南山区美食餐厅，值得关注

附近好吃小龙虾餐馆等你来吃

不允许使用

如果你在南山区，可以关注这个账号

距离3KM

你家门口的辅导班
职业

允许使用相对中性无争议性的群体属性词汇

为外来务工人员提供更多便利

为上班族提供了便利性

不允许使用

农民工也能用的信用卡

适合低端人口消费
收入

不允许使用

月入三千也买得起
婚姻/育儿状态

允许使用

好看婚纱照，适婚人士可以关注

不允许使用

如果你这两年打算结婚，进来看看

大龄剩女/单身狗看过来

给你的孩子买个玩具车

为你拍摄孕妇照

怀胎十月的你很辛苦，快来拍摄孕妇照留下幸福瞬间

社会角色

允许使用

为妈妈买条大码裙

不允许角色直接指向广告受众

给你老公买只手表

这卧室颜值太高啦，婆婆都夸你眼光好
证件及其他号码信息

不允许使用

随机选取的手机号码作为活动条件，如：寻找尾号为 0、1 的手机用户参加优惠活动

政府颁发的敏感类证件信息作为活动条件，如：身份证后 4 位为XXX数字

手机品牌厂商、手机运营商、手机型号作为活动条件，如：寻找 66 名移动用户；寻找88位手机华为的用户

朋友圈广告位文字链规范要求
“文字链” 引导用户访问 “链接推广页”， 文字链文案须与推广页内容相关联
朋友圈广告进行品牌活动以及本地推广时可使用“了解更多”、“领取优惠”及“预约活动”三类文字链。
若推广页内容非“领取优惠”模版或不可直接领取优惠或无法通过预约登记到线下门店领取优惠，则外层文字链不得使用“领取优惠”，需修改为“了解更多”；
若推广页内容非“预约活动”模版或无预约活动入口，外层文字链不得使用“预约活动”，需修改为“了解更多”
广告图片制作基础规范
广告图片内文字内容属于文案的一部分，需遵守
外层文案规范
图片内文案使用小语种和地方方言投放，需在边上加上中文注释翻译
图片内文字占图片篇幅不得超过 30%
广告图片内的文字排版需保持良好体验，避免文字割裂、文字重叠等情形
主视觉应以图片为主，不得以纯文字图片形式出现

不得使用低像素、模糊、变形的图片
广告图片必须高精度（含logo），清晰可读，无锯齿无噪点，不凌乱不变形

广告图片正立、广告不得翻转或倒立显示

图片里的抠图素材与背景图的拼接需自然，避免模糊、边缘锯齿及像素杂点

7.   不得使用高饱和度背景色和文字颜色，背景色与文字色差对比不能过大，或颜色过亮


8.   不得使用消极、丑陋、恐怖等可能引起用户不适或反感的元素
不能宣导消极、丑陋、恐怖的元素，应在感官上保证舒适的感官体验

如：形象不佳的人物，局部放大或病变的人体器官（黑头、手、脚、眼睛等）、手写文案等

9.   不得使用易引起误导的不规范角标符号，只允许采用企业品牌名称的角标符号

如：角标符号上标注"火"、“火爆”、“推荐”等易误以为是官方推荐行为的内容

10.   不得使用微信对话、朋友圈截图、QQ 对话截图或其他软件的对话截图
11.   不得在图片中出现股票代码、电话号码、URL 链接、微信号码、QQ 号、QQ 群号或其他社交软件号码等文字内容，或微信二维码图片、马赛克图、条形码图等
12.   素材图片不得使用浮层、图片叠加堆砌，不得使用密集的元素进行堆砌

 13.   不得模仿腾讯产品样式，以免造成用户误导
模仿微信、QQ 等软件及其功能元素：包括但不限于微信红包、QQ 或微信客户端程序主界面、图标、按钮、头像、表情及风格、底色等
模仿腾讯任何产品的任何消息形式
使用腾讯相关产品的元素做广告素材，如 Q 币、Q 点
在广告素材中模仿腾讯其他任何产品或使用任何素材，使用户误认为广告中推广的商品或服务与腾讯有任何关联性
14.   红包创意要求
       为避免误导用户，红包样式不得作为广告外层素材独立出现，但可作为广告创意元素出现，要求如下：
广告素材须明确说明红包内容（现金/优惠券/代金券），不得虚假或与实际不一致
红包作为广告推广元素，不得模仿微信/ QQ 红包的外观及系统通知样式
红包样式不得使用虚假按钮图标添加 “开”、“拆”、“领”等字样诱导点击

15.   不支持其他类型可能影响用户体验的图片

如：整体设计感欠缺、如毫无构图、图片缺乏修饰等情况

16.   广告位素材上不得使用中国在用钱币（包括人民币纸币、硬币）作为外层图片元素
17.   不得直接使用真实或者模仿的证件、资质等做为外层图片元素

如：身份证、社保卡、营业执照等
18.   不支持直接使用考卷、报纸、Excel 或其余表格类、手机屏幕截图、电脑界面截图等作为素材
19.   广告图片不支持直接使用横幅、锦旗等作为素材

20.   广告图片不得模仿微信广告样式设计，如下图所示，不得模仿微信公众号下载卡片广告样式


21.   广告图片不得出现任何误导/诱导用户操作的元素，如关闭按钮、播放按钮或其他诱导操作按钮

22.   使用多图或宫格图做为广告素材时，不得使用同一 URL 或相同图片


视频创意基础规范
视频广告需遵守
文案规范
和
图片规范
视频字幕与口播需保持一致，且字幕排版不得堆砌、杂乱，内容显示需清晰、完整以保持良好的观看体验
视频广告不得是纯静态图片形式，或静态图片时长超过 5 秒
视频动态类不得是部分元素微动设计形式
视频广告中禁止对行动按钮（包括但不限于箭头等）使用具有强指向性且重复闪动的元素


不得在系统自带水印外围突出标记，包括不限于使用红框形式

不得出现诱导点击的图标

帐号头像及名称通用规范要求
违规风险类规范要求
帐号头像、名称不得使用与国旗、国徽、党徽、军旗、勋章等相同或近似的标识
帐号头像、名称不得使用国家领导人形象或名字，包括不能使用公众熟识的昵称
如：名称不得使用“彭麻麻”、“习大大”等领导人昵称

帐号头像、名称不得使用国家机关名称、简称、徽标等元素（对应的政府机构可以使用相关元素）
如：“XX机关”、“XX委”、“XX办”、法院院徽等
如：“国防”“军事”“陆海空军”“特种”等使人联想到军事机关、公安机关的元素
帐号头像、名称不得使用与国家机关有密切关联的特定地点 
（如“中南海“）
 或者标志性建筑物的名称、图形等 
（如“大会堂”）
；或冠名为某国家机关或某国家机关相关地点“特供/专供/专用/授权/指定 
（如“国务院特供”）
不得使用易误导与政府机关或其他组织机构、事业单位等有直接或间接联系的标识或事物作为帐号头像、名称
如：名称 “公积金贷款”，容易误解为与公积金管理机构有关联

帐号头像、名称不得使用“中国”国家名称，若外资或合资企业名称中包含“中国”则可以使用，
如:“宝洁中国”
帐号头像、名称不得含有民族歧视性的内容
名称中包含地域，地域名需与公司主体或品牌结合使用，避免涉及侵权或误导其他官方机构

帐号头像、名称不得涉及恐怖组织及邪教名称
帐号头像、名称不得含有民族歧视性的内容
帐号头像、名称不能带有宗教色彩，
如：佛教，伊斯兰教等
帐号名称不得使用社会新闻类的事件，
如：“丈夫失踪17年后续”、“大哥十日讨薪剧情”

帐号名称不得使用“国家级”、“最高级”等广告法明令禁止的用语。此外不得使用其他虚假、夸大、效果承诺、医疗保健等词语
如：不得使用“马上瘦”、“轻松瘦”、“一定瘦”、“必瘦”、“教你天瘦 N 斤”、“减到 N 斤”等明显承诺性商品/服务内容的词语
如：不得使用“最佳”、“顶级”、“第一品牌”、“极品”、“至尊”、“最受欢迎”、“极致”等绝对化用语

帐号名称不得涉及脏话等不文明用语
帐号名称不得涉及微信广告禁投内容，包括不限于包含“微商”、“分销”、“段子”词语
帐号头像、名称不得涉及到诱导用户关注、分享等恶意情况
如：不得使用“分享好友”、“邀请好友”、“关注领福利” 等描述
帐号名称、头像不得涉及色情低俗、或性暗示等擦边球的内容
头像要求，包括但不限于：
（1）头像不得使用露出乳沟，低胸，摆长腿，下身若隐若现等较容易引起误会的图片
（2）头像不得使用与帐号无关的易引起误解的美女头像

名称要求，包括但不限于：
（1）名称不得使用色情暗示的词语，如“午夜激情”等
（2）名称不得使用强调交友属性的词语，如“约爱”、“约夜”、邂逅”、“偶遇”、“搭讪”等
（3）名称不得使用强调急迫性的关键词“求爱”、“求约”、“求聊”等词语
（4）名称不得使用存在歧义、不良联想的词语，如“村里姑娘那些事”，游戏行业使用“爱吃鸡的小萌妹”，房地产行业使用“房事“等词语

头像和名称结合使用要求：
（1）头像为美女图，不得使用易产生低俗联想或不良暗示的名称
如，“想看的都在这里”、“无聊来这看看”这些名称结合美女图片使用更易涉嫌低俗，不得使用这类名称

投放广告前可通过预审助手前置检测   
微信广告预审助手 >
品牌侵权类规范要求
帐号头像、名称不得单独使用第三方知名品牌素材（ Logo 或商品图等），误导用户以为品牌官方进行广告投放。若为品牌经销授权代理经营，帐号名称可修改为“XX品牌专营店”、“XX京东旗舰店”等，支持通过。


帐号名称涉及人名规范要求（微信公众平台对涉及人名的公众帐号名称认证，有严格的准入及资质审核要求。因此，现阶段非公众帐号认证渠道准入投放广告的帐号，必须遵循下述规范，规避个人信息问题带来的风险及给用户造成不佳的广告体验）
除明星品牌合作广告样式外，帐号名称不得单独使用人名（包括代称）
代称包括但不限于：单姓（王小姐），单名（丽芳），叠字（莉莉），大众熟知的昵称（angelababy）等
若帐号名称涉及人名/代称，满足以下情形允许通过：
（1）若与品牌结合使用允以通过。如“猿辅导张老师”。品牌名包括商标、应用名、广告主认证主体以及广告素材中明确体现的品牌标识



帐号头像、 名称不得涉及侵犯他人或第三方合法权益的内容，包括未经授权使用明星、名人肖像，知名动漫、知名品牌或使用与之相似的内容、信息、特殊角标等


非本企业主体不得使用其他企业字号或知名企业简称/缩写作为广告主名称
如：深圳腾飞讯美科技有限公司，企业简称：腾讯，不支持
帐号名称、头像不得使用假货类描述，如“山寨”“A货”“高仿”等
帐号名称不得单独使用“官方推荐“描述，允许使用“品牌主体+官方推荐”描述
如：“中信银行官方推荐"、"统一100官方推荐”等形式的描述可以通过行官方推荐"、"统一100官方推荐”等形式的描述可以通过
非腾讯主体帐户头像、名称不得使用腾讯产品或业务相关内容
不得模仿微信、QQ等软件UI及其功能元素设计：包括但不限于QQ/微信 logo、微信红包等

体验类规范要求
帐号名称不得使用错别字。

帐号名称不得使用特殊符号，包括但不限于标点符号，表情符号，特殊字符等。
如：广告主名称为【蛙鲜生丶烤鱼丶龙虾丶小串丶夜啤】等
帐号名称不得添加无实际意义的字母、数字等。
如：帐号名称为“A新鲜海鲜直运3”
帐号名称中不得使用或包含URL链接。
帐号名称不得使用繁体。其中：文物古迹，书法、篆刻等艺术作品，题词和招牌的手书字，注册商标及企业名称可以保留或使用繁体字。
帐号名称不得使用除自身品牌LOGO外的纯英文字母（商标类除外），包括但不限于中文拼音、中文拼音首子母组合、与品牌无关的英文单词等。
如：广告主名称为咖啡店，不得使用kafeidian拼音作为帐号名称或者使用KFD的拼音首字母作为帐号名称
帐号名称不得出现股票代码、电话号码、微信号码、QQ号、QQ群号或其他社交软件号码等。
帐号名称不得使用明示或暗示用户个人特征属性文案（包括但不限于民族种族、宗教信仰、性取向、年龄、收入、婚姻状态、学历、地域、健康信息等）。
帐号名称不支持使用小语种或地方方言或非国家通用的语言文字。
帐号名称不得使用涉及负面、挑衅、命令、誓言、威胁用户等的文案。
如：有人退货算我输
帐号头像、名称不得与帐号经营内容无关，建议使用与主营行业、企业主体名称、经营品牌、运营内容等有一定关联的内容及图片。
如：头像不得为空
如：经营服装服饰行业的帐号不得使用母婴育儿行业相关的名称“好妈妈育儿经”

帐号名称长度不得小于两个字，表意不明。

帐号名称不得涉及亲属关系等称呼，易引起用户误解。
如：妈、老婆、老公等

账号名称不得使用动词、形容词、句子 ，与账号主体无关联描述。
如：“分享一个淡斑方法”

帐号头像不得使用二维码作为创意

帐号头像不得模仿红点消息提醒样式

帐号头像不得使用中国在用钱币（包括人民币纸币、硬币）
帐号头像不得使用真实或者模仿证件、资质的图片
特殊行业头像及名称规范要求
金融类帐号名称要求：
帐号名称不得涉及“股市内参”等可能涉及金融内幕资讯的内容
帐号名称不能涉及对收益有明示或暗示类描述
如：“牛股”、“妖股”、“黑马股”、 “3分钟涨停”、“股票涨停预报”
帐号名称不得冠以“公积金“或“公积金贷”
帐号名称不得涉及对信贷类借款结果的承诺
如：秒下钱、秒贷、成功到账、5万轻松到手等
金融类名称也需同时遵循
《金融行业文案审核规范》
的要求
摄影行业品牌客户投放广告时必须使用品牌名称，不得使用其他与品牌名称无关的名称
如：金夫人婚纱摄影机构的帐号名称内必须含有“金夫人婚纱摄影”字眼，不得使用“婚纱摄影精选”等不涉及品牌名的名称
电商类帐户不得使用以下名称：
具体折扣类：如 3 折大衣
具体价格类：“49 元大衣“ ”99 元女装“
功效承诺类：“xx显瘦”
电商类名称也需同时遵循
《直购电商行业文案审核规范》
的要求
帐号简介规范要求
帐号简介不得含有政治敏感、色情、暴力血腥、恐怖内容及国家法律法规禁止的其他违法内容
帐号简介需与广告推广内容有所关联，明确介绍所推广服务或内容，且不得使用“国家级”、“最高级”等广告法明令禁止的词汇或其他无关的内容

帐号简介也需同时遵循
《法律及平台规范》
的要求。
推广页规范
包括但不限于原生推广页、H5模版、自定义链接以及其他推广页
推广页平台要求
等待页面打开时间不能超过 2秒
不得直接连接到电子邮件、图片、公众帐号历史消息列表页、非腾讯所属的视频或直播页，或其他需用第三方软件打开的文件
不得在网址中包含非域名类的其他汉字或符号，不得在显示网址中插入广告宣传文字
品牌推广页面内容需与文案有一定的关联性，不得完全无关联；广告位涉及活动内容需要在广告推广页首页体现
推广页不得出现非完整页面，或者是页面结构凌乱，如：

广告汇总向用户收集信息需向用户告知规则、数据填写用途、使用范围、品牌等相关信息，帮助用户判断是否填写；不支持使用违规收集用户信息的内容： 
不得出现无品牌、无活动介绍、无设计的用户信息搜集页
不得收集非用户本人的信息内容、不得收集非推广业务本身的信息调研

如：请填写你父母/朋友的信息，你从哪里了解到XX广告的
不得收集银行卡、身份证号码等个人隐私的信息
需在落地页一跳页面展示用户信息保护协议（用户协议/隐私协议/个人信息说明），且不能为默认勾选状态，需用户自主确认勾选



推广页创意素材规范
不得在推广页中出现非广告主主体的公众帐号/无主体的个人公众帐号/个人微信号/个人名片信息，展现形式包括但不限于微信公众帐号二维码、微信公众帐号帐号 ID 及微信公众帐号帐号名称；
不得在原生推广页面使用二维码
不得在推广页中出现加微信群、QQ 群或其他社交群信息
公众号文章页中不得使用虚假利益诱导用户点击“阅读原文”

如：推广页中使用“点击阅读原文开大奖”“点击阅读原文有惊喜”的文案，但阅读原文链接中内容与文案描述不符合
广告内容中不可以出现转账付款信息的，比如支付宝、银行账户、微信付款二维码
不得投放诱导关注内容

诱导关注是以奖励或其他方式，强制或诱导用户关注公众号的行为，奖励的方式包括但不限于：实物奖品、虚拟奖品（积分、信息）等；活动主题或内容包括但不限于“关注即送100元大礼包”、“关注即可参与抽奖”、“关注后查看答案”等关注后活动，以下案例都属于诱导关注类型，不得使用：

不得投放诱导分享内容
强制用户分享：分享后才能继续下一步操作，包括但不限于分享后方可预定，分享后方可知道答案等
利诱用户分享：分享后对用户有奖励。奖励的方式包括但不限于：实物奖品、虚拟奖品（积分、信息）等。例如：邀请好友拆礼盒，集赞，分享可加一次抽奖机会

除上述规范要求外，若广告落地页为自定义链接，还须遵循微信公众平台
《外部链接内容管理规范》
要求
不得投放 H5 游戏、测试类内容

以游戏、测试等方式，吸引用户参与互动的，具体形式包括但不限于比手速、好友问答、性格测试、测试签、网页小游戏
推广页中若需通过按钮引导用户点击进行下一步操作（包括但不限于引导下载应用、领取优惠、线索收集登记），则按钮的引导文案需与实际的操作行为相符合（如：按钮文案为领取优惠，点击后跳转链接可直接领取优惠券，不得为线索收集登记），若按钮引导文案与实际操作不一致，则需在按钮下方（若使用多个下载按钮，则在首个按钮下方）备注操作步骤的相关描述（描述文字颜色不得与背景颜色过于相似，需清晰易识别）



使用原生页为推广页的广告，推广页中不得出现二维码或小程序码或条形码
除上述规范要求外，若广告落地页为自定义链接，还须遵循微信公众平台
《外部链接内容管理规范》
要求

公众号整体运营内容
运营内容不得涉及违反本审核规范及
《微信公众平台运营规范》
所规范内容。
 重点规范要求如下：
不得宣传或销售《法律禁投及微信广告暂不开放的商品及服务》禁止投放的内容。特别是对用户易产生损害的药品（卵巢保养、防衰老，缩阴药物等）、医疗器械、丰胸产品、减肥产品和增高产品。
公众帐号功能介绍文案不得使用广告法禁止使用的绝对化用语。

如：北京最受欢迎的店铺
自媒体行业广告历史消息文章数量不得少于4篇，其他行业广告主历史消息数量不得为 0 。
历史消息不得与公众帐号整体运营方向完全无关联。
不得利用社区或者外链来发布违规内容。
不得违反法律法规、规章制度以及社会道德要求。

如：历史消息标题、内容中出现国旗或国徽等元素，或出现涂鸦、恶搞本国或其他国家领导人的内容

如：历史文章内容为种族歧视内容

如：菜单栏链接内链接至色情网站
均不得有违反微信公众平台关于诱导关注、诱导分享的规定。

如：公众号介绍文案中，关注后送 100 元优惠券等

如：历史消息标题、图片文案中出现“转发到朋友圈有奖等内容”

如：功能介绍涉及箭头指引关注
不得推送与帐号无关的微信帐号。

如：添加个人微信号咨询购买商品等内容

如：在关注后自动下发消息内，或者菜单栏内推送与帐号无关的微信号集合列表

如：历史消息文章内容通过“阅读原文”，进行违规互推的行为

电商客户投放售卖类广告时，运营内容需满足以下要求：
含有在线商城链接，在公众号菜单入口展示；
售后客服联系方式真实有效，在公众号菜单入口展示；
订单详情及物流信息可以查询，在公众号菜单入口展示；
售后退货流程需在商城公示，支持质量问题商品无理由退换货。
公众号头像规范
头像不为空
不得涉及暴露、低俗、丑陋、色情，或者打擦边球，给人性暗示等 
如：露出乳沟，低胸，摆长腿下身若隐若现较容易引起误会等

如：使用与帐号无关的易引起误解的美女头像
知名人物头像需提供人物授权
不得未经授权使用国家机关标识或国旗、国徽、党徽等组织机构的标识、形象
不允许使用二维码做为头像

建议：头像名称与主营行业、企业主体名称、品牌需求、运营内容等有一定关联
头像图片不得使用纯文字图，图片内若有文字，则需符合文案及名称规范要求
头像设计不得模仿微信消息提醒样式
公众号名称规范
不得包含“微商”、“分销”、“段子”词语
不得涉嫌夸大、误导宣传，明显承诺性商品/服务内容

如：“马上瘦”、“轻松瘦”、“一定瘦”、“必瘦”、“教你N天瘦N斤”、“减到N斤”

如：3 分钟涨停、股票涨停预报、与贷款承诺相关用词（秒下钱、秒贷）等

如：大家都在玩
不能使用强调急迫性关键词,包括但不限于“求”、“求爱”、“求约”、“求聊”等
不能使用容易产生歧义的名称

如：游戏广告使用“爱吃鸡的小萌妹”存在歧义

如：情感类自媒体使用“约爱”“约夜”等
不得使用强调交友属性的关键字，包括但不限于 “约”字相关交友词汇及“邂逅”、“偶遇”、“搭讪”等词语
不得包含涉及暴力、色情，或暗示“性便利”等词语

如：午夜激情等、爆头党等
公众号名称不得使用品牌 LOGO 外的纯英文字母做为广告主帐号名：包括但不限于中文拼音、中文拼音首子母拼写名称、与品牌无关的英文单词或子母、数字与英文子母的组合

如：广告主名称为咖啡店，使用 KFD 的拼音首字母做为公众号名称,或者使用 kafeidian 拼音做为公众号名称
；
公众号名称不得添加无实质意义的字母、符号、数字等

如：麻麻我爱你X，X为无实质意义的字母
公众号名称不得借用或模仿领导人名称（包括但不限于包括公众熟识的昵称）
公众号名称中不得包含 URL 链接
公众号名称需与公众号经营内容相关联

如：经营女装信息的帐号不得使用母婴育儿行业相关名称“好妈妈育儿经”
金融类帐号名称要求：
不得涉及“股市内参”等可能涉及金融内幕资讯的名称
公众号名称不能涉及“X股”等对收益有暗示的描述

如“牛股”、“妖股”、“黑马股”
如投放朋友圈广告，则公众号名称不允许使用个人IP类命名（如：王某评股），推荐使用企业名或产品名
电商类客户不得使用以下名称：
具体折扣类：如 3 折大衣
哄抢促销类：”清仓”、”爆款”
具体价格类：“ 49 元大衣“ ” 99 元女装“
夸大词汇类：”超级好看XX” 、“超便宜”
季节类：“秋冬大衣”、“春天新款”、“过年大衣”等
功效承诺类：“xx显瘦”
摄影行业品牌客户投放广告时必须使用品牌名称，不得使用其他与品牌名称无关的名称

如：金夫人婚纱摄影机构的公众号名称内必须含有使用金夫人婚纱摄影，不得使用“婚纱摄影精选”等与品牌经营无关的名称
搜一搜超级品牌专区审核规范
物料审核规范
1. 关键词、创意、落地页关联性审核规范
1.1  关键词需与账户信息相关
【物料投放示意】：
【客户名称】：
浦林轮胎
【投放关键词】：
浦林电动车轮胎
浦林新能源轮胎
浦林prinx
【审核结果】：
 投放关键词与账户信息指向一致

【物料投放示意】：
【客户名称】：
六凌轮胎
【投放关键词】：
六凌汽车
六凌维修
六凌道路救援 
【审核结果】：
 投放关键词与账户信息不相关
1.2  关键词需与账户信息相关
【物料投放示意】：
【客户名称】：
资生堂
【投放关键词】：

御银座水乳
御银座套装
御银座洁面
【审核结果】：
物料中包含御银座+通用系列词内容，与投放词指向一致
【物料投放示意】：
【客户名称】：
娇兰
【投放关键词】：

娇兰双十一赠礼
娇兰双11
娇兰双十一
【审核结果】：
活动词符合双11活动的时效性，物料中包含品牌词+活动词与投放词指向一致
【物料投放示意】：
【客户名称】：
美岚
【投放关键词】：

美岚座银石广场
美岚开业
【审核结果】：
物料中未包含投放词内容，与投放词指向不一致

客户名称
投放关键词
审核结果
美岚
双11
双十一
错误示例：
不支持投放的活动词无品牌前缀
美岚
美岚618
美岚七夕
错误示例：
 不支持已过投放期的活动词，活动词需在时效范围内
1.3  关键词、创意需与所指向页面内容相关
相关性要点：

 1.3.1  关键词如仅包含一类内容的，需在专区有所体现
【物料投放示意】：
【客户名称】：
剑侠世界3
【投放关键词】：

剑侠世界3
剑侠世界3游戏
【审核结果】：
投放词剑侠世界3在物料专区有体现，符合审核规范
  1.3.2  关键词如包含多类内容的，需在物料中均有体现
【客户名称】：
肌肤之钥
【投放关键词】：

4D精雕眼霜
4D精雕面霜
4D紧致精华
4D抚纹精华
【审核结果】：
投放词包含多类内容均在物料中体现，符合审核规范
1.3.3  如物料仅包含品牌其中一类内容的，则不允许使用其他类内容关键词进行投放，建议一套物料对应一类内容的关键词
2. 品牌名称审核规范
2.1  需具备商标注册证
2.2  商标注册证需涵盖品牌方核心主营业务分类（如主营业务为服装，商标注册证的核定商品项目须包括服装）
2.3  国外品牌使用国内主体注册，提供国外授权文件核对后无误即可。比如：7喜归属百事（中国）有限公司
2.4  如品牌方商标涉及中文、英文或logo，请一并提供对应商标的商标证（如兰蔻、lancome及其logo）
2.5  如主体为分公司、代理、或区域性代理，则官方区名称需要作出明确区分，且配置词不能完全和主体品牌名一致。比如：云南联通、中国移动陕西10086
2.6  如申请人为商标被授权方，除提供商标注册证外，还需提供商标授权书

客户名称
投放关键词
物料投放示意
审核结果
黄蜂旅行
黄蜂旅行
黄蜂旅游
物料图请见下方案例1
错误示例：
品牌名称使用错误，未使用固定的品牌名称
同程旅行
同程旅行
同程旅游
物料图请见下方案例2
正确示例：
品牌名称使用的是固定品牌，符合品牌推广
【案例1】：

【案例2】：

3. 主体一致性审核规范
3.1  品专内所使用的公众账号、视频号账号、小程序账号主体需与广告主主体一致
3.2  如为不同主体，仅支持集团下同品牌的相关公司，在提供商标注册主体授权后进行品专区账号配置
4. 资质类审核规范
4.1  所在行业、所售卖商品及服务需符合AMS的行业及品类资质要求
4.2  使用第三方名称（含明星/IP/非自有品牌等），需提供授权证明
【物料投放示意】：
【客户名称】：
UGG
【投放关键词】：
UGG+明星词
UGG
【审核结果】：
物料包含品牌及代言人，支持品牌+明星词
5.创意审核规范
5.1  合规性审核规范：物料内容均不得涉政涉爆涉黄，需符合广告法要求
5.2  创意审核规范
创意审核规范需符合
微信广告创意审核规范
 重点规范如下：
5.2.1  文案审核规范
（1）语句内容完整，禁止出现语病性质的断句，或表达错误
（2）不能出现误导性带歧义的文案
5.2.2  图片审核规范
（1）内容清晰准确，图片物料中文字不能过小影响阅读
（2）不得使用高饱和度背景色和文字颜色，背景色与文字色差对比不能过大，或颜色过亮
（3）主视觉应包含品牌信息
（4）禁止大量空白，禁止不必要的描边效果
（5）图片上不得使用二维码
（6）不得出现联系方式或网站地址等信息
（7）不得使用引导或诱导关注、诱导分享类营销活动文案
5.2.3  视频审核规范
（1）口播内容清晰，视频清晰度高
（2）不得为GIF或PPT式的视频播放效果
（3）设计类其他规范与图片设计要求想同
5.2.4  推广页审核规范
（1）若广告落地页为自定义链接，须遵循微信公众平台
微信外部链接内容管理规范
（2）不得在推广页中出现非广告主主体的公众账号/无主体的个人公众账号/个人微信号/个人名片信息，展现形式包括但不限于微信公众账号二维码、微信公众账号ID及微信公众账号名称
（3）不得投放诱导关注内容
6.活动审核规范
6.1  遵循微信广告整体活动类审核规范要求
活动投放规则
6.2  活动如有人群或地域范围限制，需在外层图片进行描述说明
7.组件审核规范
（1）在线客服：仅支持使用企业微信，不支持使用个人微信号
（2）电话：需为可查询官方电话，不得使用私人电话号码
（3）门店地址需为品牌使用的相关门店地址，不得出现无品牌名称的门店内容，如有特殊情况，需通过销售接口人向审核进行反馈及说明
 常见审核案例示意：
 
【客户名称】：
OUIA
【投放关键词】：
xiaomi
xiaomi11
红米手机
小米K40
【审核结果】：
投放词与自身品牌不一致
客户名称
投放关键词
物料投放示意
审核结果
vivo
iqoo手机
vivo手机
物料图请见下方案例3
正确示例：
 投放词为自身品牌词
【案例3】：


【客户名称】：
拓驰汽车
【投放关键词】：
拓驰多少钱
拓驰有什么颜色
拓驰几缸发动机
拓驰SUV是不是电车
【审核结果】：
 
不支持使用品牌词+疑问语意的需求词

【客户名称】：
梅赛德斯-奔驰
【投放关键词】：
梅赛德斯-奔驰
奔驰汽车
奔驰轿车
【审核结果】：
投放词为品牌+行业词
【客户名称】：
安军证券
【投放关键词】：
安军集团
【审核结果】：
投放词为主品牌词，不支持子品牌使用主品牌为投放词
【客户名称】：
平安证券
【投放关键词】：
平安证券
平安证券投资助手
【审核结果】：
仅有与平安证券相关的物料内容，与投放词指向一致
【客户名称】：
星际光年
【投放关键词】：
星际广年
星际咣年
星际光粘 
【审核结果】：
 投放词不支持使用错别字
客户名称
投放关键词
物料投放示意
审核结果
美兰
MEILAN
MEIEILL
MEILLAN
meilan兰

错误示例：
投放词不支持使用语义不通顺/拼写不正确的此
美兰
MEILAN
香水
美兰眼霜
美兰粉底
美兰精华
物料请见下方案例4
图片素材未展示美兰品牌+通用系列相关信息
【案例4】：


【客户名称】：
兰蔻
【投放关键词】：
兰蔻官方
兰蔻
LANCOME
法国兰蔻
【审核结果】：
投放词为兰蔻品牌词符合投放要求
客户名称
投放关键词
审核结果
怡瘦
瘦吧减肥
瘦吧瘦身
瘦吧减脂
错误示例：
不支持普通食品投放词涉及功效描述
三生奶粉
羊奶粉
进口奶粉
国产奶粉
牛奶粉
错误示例：
不支持品类广义词
【客户名称】：
丝拉格
【投放关键词】：
box单肩包
canlini手提包
【审核结果】：
 
 支持品牌词+具体产品词
【客户名称】：
菲拉格慕
【投放关键词】：
Ferragamo男士包袋
Tirfolio女包
【审核结果】：
 投放词包含菲拉格慕品牌
视频号广告体验要求
素材审核规范
1. 创意质量审核规范
视频卡顿、中断、画质模糊、内容不完整、音画不相关、无声、视频画面内容拉伸变形、画面上下颠倒、视频黑边、扭曲或花屏、字幕不全等

物料投放示意
驳回问题详情
素材过审指引
【视频号拒绝案例】--音画不同步
驳回原因示例：
推广视频号内容创作，视频内容不得出现影响用户感官体验内容，如【音画不同步】，请修改
视频素材正确示例：
视频中音画同步
字幕完整清晰
符合审核规范
【视频号支持案例】--声画同步
【视频号拒绝案例】--视频字幕显示不全
驳回原因示例：
推广视频号内容创作，视频内容不得出现影响用户感官体验内容， 如【字幕不全：语音为”比直接买便宜好几倍呢，字幕显示只有“比直接买便宜”】，请修改
视频素材正确示例：
视频中音画同步
字幕完整清晰
符合审核规范
【视频号支持案例】-声画同步
采用轮播文字、大字覆盖、简单拼凑内容、或重复内容
单张图片或者多张图片ppt样式放映，没有背景音或者背景音只是播放图片文字，无故事性/可读性，文字多为无意义的鸡汤或者伪科学类文字
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，视频内容需设计丰富，不支持使用简陋内容形式进行创作推广，如【一段视频中出现两段相同内容】请修改
视频素材正确示例：
视频中素材内容丰富，展示场景顺畅，无违规内容，符合审审核规范
【视频号支持案例】-视频素材过审案例
物料投放示意
驳回原因示例
素材过审指引
【视频号被拒案例】--花屏、PPT形式视频
驳回原因示例：
推广视频号内容创作，视频内容需设计丰富，不支持使用简陋内容形式进行创作推广，如【ppt样式放映，无背景音，无故事/可读性】请修改
视频素材正确示例：
视频中素材内容丰富，展示场景顺畅，无违规内容，符合审审核规范
【视频号支持案例】--视频素材过审案例

广告素材不得使用引人不适，体验不佳人物形象及元素展示，如真人痘痘泛红成簇、斑点密集、皮肤皲裂、秃顶、皱纹老化、脱发脱毛形象等
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，请勿使用人物形象不佳，体验较差的素材设计，如【视频中展现干裂起皮、起屑场景】请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
视频中可支持光滑白嫩、轻微干裂纹理
 支持案例详见上方【视频号支持案例图】

【案例】：

    
驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，请勿使用人物形象不佳，体验较差的素材设计，如【视频中展现痘痘点形象泛红成簇、斑点密集场景】请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
视频中可支持皮肤光滑健康，有轻微滤镜修饰，斑点轻微不严重且无成簇成团展示
支持案例详见上方【视频号支持案例图】
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，请勿使用人物形象不佳，体验较差的素材设计，如【视频中展现秃顶、脱发脱毛形象】请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
视频中可支持人物形象正常，无不良感观的素材
支持案例详见上方【视频号支持案例图】
广告素材不得使用引人不适，体验不佳元素设计，如卡通昆虫蠕动、产卵形象
物料投放示意
驳回问题详情
素材过审指引
视频号案例-引人不适体验差
驳回原因示例：
请勿使用令人恶心不适元素及场景推广，如【视频中卡通昆虫产卵】请修改
视频素材正确示例：
视频正常展示游戏中动画场景，无引人不适场景出现
视频号案例-通过案例
推广商品/服务，视频内使用指向性图形如箭头、手指，指向方向需指向卡片组件位置范围且不得出现指向范围前后不一致或同时指向多个不同方向
物料投放示意
驳回问题详情
素材过审指引
视频号案例-箭头指向多方向
被拒案例详见下方【案例】-箭头指向多方向
驳回原因示例：
视频内使用指向性图形如箭头、手指等，指向方向需指向卡片组件展示区域,如【箭头同时指向右方和下方】请修改
视频素材正确示例：
视频内使用指向性图形箭头正确往下指向卡片组件展示区域【如图】
视频号案例-指向案例示意
 支持案例详见下方【案例】-指向案例示意图
【案例】：

2. 无授权审核规范
使用的视频内容中包含影视剪辑内容无授权
【案例】：


物料投放示意
驳回问题详情
素材过审指引
【视频号被拒案例】--混剪拼接名人声音
驳回原因示例：
视频中涉及第三方业务或品牌，如【使用知名人声音】请修改（需提供业务授权或品牌授权）
视频素材正确示例：
视频中可支持已有授权影视画面展现
【视频号被拒案例】--多个影视频段拼接
驳回原因示例：
涉及明星肖像或名义，请将对应明星的授权证明，上传至投放管理平台-账户中心-广告资质，并重新提交广告，如【多个影视频拼接】请修改
视频素材正确示例：
视频中可支持已有授权影视画面展现
支持案例详见上方【视频号支持案例图】
3. 无意义内容审核规范
内容与所推广的商品、服务及所在行业无关联，使用无创作主题/无结构/等无意义视频内容，包括但不限于：视频内容无主题/无配文/配音/BGM、美女图/风景图+文案
   【案例】：
     

物料投放示意
驳回问题详情
素材过审指引
【视频号拒绝案例】--无意义
驳回原因示例：
推广视频号内容创作，视频内容需设计丰富，不支持使用简陋内容形式进行创作推广，如【无创作主题、无视频情节，无主推产品】请修改
视频素材正确示例：
广告主推【壁挂炉】情节演绎围绕产品主题开展，符合审核规范
支持案例详见上方【视频号支持案例图】
4. 内容营销审核规范
虚假内容营销
夸大宣传并带有欺骗性的，如：宣传人体不可逆功效、疗效对比、承诺夸大描述，包括但不限于人体肤质变化（祛除皱纹、减小眼袋）、牙齿美白等

物料投放示意
驳回问题详情
素材过审指引
【视频号拒绝案例】--前后对比效果夸张虚假
驳回原因示例：
推广视频号内容创作，不支持使用虚假夸大内容进行推广，包括但不限于人体不可逆功效疗效对比描述，如【视频中出现祛除皱纹前后效果对比】请修改
视频素材正确示例：
视频中商品介绍无虚假夸大宣传，符合审核规范
【视频号支持案例】--无虚假夸大宣传
【视频号拒绝案例】--前后对比效果夸张虚假2
驳回原因示例：
推广视频号内容创作，不支持使用虚假夸大内容进行推广，包括但不限于人体不可逆功效疗效对比描述，如【视频中刷牙前后牙齿美白效果对比】请修改
视频素材正确示例：
视频中商品介绍无虚假夸大宣传，符合审核规范
【视频号支持案例】--无虚假夸大宣传
负向内容营销
通过虚构事实、编造故事发布“卖惨”内容，或扮丑，或猎奇内容，以实现吸引用户点赞、转发、关注或推广商品等目的，包括但不限于：
1）利用未成年人、残障人士骗取用户同情
2）“卖惨式”推广商品
3）利用疾病、贫穷等对用户进行道德绑架
4）刻意扮丑引起用户不适
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不支持使用负向内容进行推广，包括但不限于：【利用生病人士卖惨式推广商品】，卖惨博同情、刻意扮丑、猎奇内容，请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
视频中商品介绍无虚构事实、编造故事发布“卖惨”内容，或扮丑，或猎奇内容，符合审核规范
【视频号支持案例】--无负向内容营销
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不支持使用负向内容进行推广，包括但不限于：【利用未成年人骗取用户同情推广商品】，卖惨博同情、刻意扮丑、猎奇内容，请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
视频中商品介绍无虚构事实、编造故事发布“卖惨”内容，或扮丑，或猎奇内容，符合审核规范
【视频号支持案例】--无负向内容营销
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不支持使用负向内容进行推广，包括但不限于：【利用利用贫穷描述骗取用户同情推广商品】，卖惨博同情、刻意扮丑、猎奇内容，请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
视频中商品介绍无虚构事实、编造故事发布“卖惨”内容，或扮丑，或猎奇内容，符合审核规范
【视频号支持案例】--无负向内容营销
【案例】：

驳回原因详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不支持使用负向内容进行推广，包括但不限于：【刻意扮丑引起不适】，卖惨博同情、刻意扮丑、猎奇内容，请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
视频中商品介绍无虚构事实、编造故事发布“卖惨”内容，或扮丑，或猎奇内容，符合审核规范
【视频号支持案例】--无负向内容营销
5.警示语要求审核规范
视频号广告警示语需在视频内清晰可见，包含但不限于以下场景
1）竖版视频的相关警示语需在视频中间左右两侧不得在视频四周边距内（左右侧各48px，上侧160px，下侧100px），不得在易被遮挡区域展示警示语
2）警示语不得被广告中其他文字所遮挡或重叠且全程展示
3）警示语颜色与视频背景颜色需有明显区别，可供用户识别
补充：为了适配机型，警示语需在黑色区域范围进行展示

【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不得在视频四周边距内（左右侧各48px，上侧160px，下侧100px）放置警示语信息，不支持【警示语信息被遮挡展示不全】请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
 
下图为竖版视频，警示语全程展示且清晰可见无遮挡，符合审核规范
【视频号支持案例】--警示语过审案例
支持案例详见上方【视频号支持案例图】

物料投放示意
驳回问题详情
素材过审指引
【视频号被拒案例】--警示语展示位置不合规
驳回原因示例：
推广视频号内容创作，不得在视频四周边距内（左右侧各48px，上侧160px，下侧100px）放置警示语信息，不支持【警示语信息被遮挡展示不全】请修改
视频素材正确示例：
下图为竖版视频，警示语全程展示且清晰可见无遮挡，符合审核规范
【视频号支持案例】--警示语过审案例
支持案例详见上方【视频号支持案例图】
涉及护肤彩妆效果宣传，需添加“效果因人而异”等内容相似警示语
物料投放示意
驳回问题详情
素材过审指引
【视频号被拒案例】--视频全程无警示语
驳回原因示例：
推广视频号内容创作，涉及护肤彩妆效果宣传，需添加【警示语说明效果因人而异】，请修改
视频素材正确示例：
护肤彩妆内容描述全程添【使用效果因人而异】警示语且无遮挡
【视频号支持案例】--护肤视频警示语过审示例
6.  活动审核规范
超低价活动需在广告中清晰体现活动参与条件及概率，包括但不限于：
1）凡出现价格的，需在价格旁标注为 抢购价 或 新人价（避免误导为正常价格），且不允许出现抢购价格与原价对比的描述，如：“9.9元抢购 889 元沙发”
2）需通过警示语方式告知用户具体的抢购时间和具体数量
3）需明确告知抢购路径，如用户通过抢购路径无法顺利找到商品，则认为存在虚假宣传或路径不清晰的问题
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，涉及低价/低概率促销活动如【9块9，需在价格旁标注说明活动要求且不得出现价格对比】请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
下图出现9.9元并标注了【抢购价】，同时添加了警示语告知用户抢购时间和具体数量和抢够路径，符合审核规范
支持案例详见上方【视频号支持案例图】

电商交易（包含货到付款、APP引流）不得使用虚假营销活动进行广告宣传，包括但不限于以下场景限量数量在广告场景下明确为虚假营销行为，如限量200、最后一批
支持表述不带限量描述的售完即止、即将售罄【注：确保与实际情况一致的前提下可以使用】等营造紧张促销氛围的描述
【拒绝案例】：
1）全国限量100只，在电商营销场景下，明确存在虚假行为
2）描述限购一件，实际可买N件拒绝案例：宣传每人限购2件，实际销售中可以买多件，属于虚假宣传行为
3）无价格但描述限购等不符合电商售卖行为的活动
4）使用限时描述，但无倒计时组件，也无具体的限制时间描述，为虚假限时描述
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不得使用虚假营销活动进行广告宣传，如【全国限量100只，在电商营销场景下，明确存在虚假行为】请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
下图中广告内容不带限量描述，有【售完即止、即将售罄】确认与实际情况一致，营造紧张促销氛围的文字描述符合审核规范
支持案例详见上方【视频号支持案例图】
     【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不得使用虚假营销活动进行广告宣传，如【视频中无价格表示但描述限购一箱，不符合电商售卖行为的活动】请修改
被拒案例详见上方【视频号被拒案例图】
视频素材正确示例：
下图中广告内容不带限量描述，有【售完即止、即将售罄】确认与实际情况一致，营造紧张促销氛围的文字描述符合审核规范
支持案例详见上方【视频号支持案例图】
【案例】：

驳回问题详情
素材过审指引
驳回原因示例：
推广视频号内容创作，不得使用虚假营销活动进行广告宣传，如【描述限购2件，实际可买大于2件，属于虚假宣传行为】请修改
被拒案例详见上方【视频号被拒案例图1】和【视频号被拒案例图2】
视频素材正确示例：
下图使用限时描述，有倒计时组件且有限制时间描述，符合审核规范
支持案例详见上方【视频号支持案例图】
2022世界杯审核要点
一、基础规则
1. 未经授权的情况下，广告主生产、销售的商品、及广告营销活动中不得使用世界杯相关元素
【元素示例】：


2. 未经授权的情况下，任何主体不得使用世界杯元素作为商业名称、企业名称、公众号名称等
【元素示例】：


3. 未经授权的情况下，广告落地页不得使用世界杯相关元素及名义作为网站域名
【元素示例】：

4.  未经授权不得使用参赛运动员、教练员、训练员或官员的肖像、姓名、图片或运动成绩作为广告元素出现
【元素示例】：

5. 广告中不支持以世界杯门票作为奖品进行抽奖、促销等任何形式的促销、竞赛或抽奖奖品
【元素示例】：

6. 未经授权不得擅自宣传可直播转播世界杯赛事，需有国际足球联合会的授权
【元素示例】：

7. 广告中不支持变形或模仿世界杯相关元素，需要广告主提供明确的官方授权文件
【元素示例】：

8. 需国际足球联合会官方授权可使用的描述：为世界杯加油
【元素示例】：

9. FIFA权益人享有以广告或推广目的使用FIFA官方标志的排他性权利，除了官方授权的FIFA权益人，其他企业均不可以合作伙伴或赞助商的身份进行广告宣传
【元素示例】：

10. 任何与FIFA、比赛、仪式、主题曲等音视频、影视材料、文字材料等，未经FIFA授权不可使用
【元素示例】：

11. 其他使用世界杯元素进行隐性营销的，即故意或无意地与世界杯创造虚假的、引人误解的商业联系，误导公众，使公众认为其与世界杯、国际足球联合会 具有商业合作关系或与世界杯标志权利人之间有赞助或者其他支持关系的情况，均需要核实是否有授权或者合作关系
【元素示例】：

声明：本文中的素材仅为说明审核要点之目的，请勿做其他用途
二、世界杯元素
注：下列图片为
【世界杯官方元素，仅作为合规指引，非商业用途】
【2022卡塔尔世界杯口号】：

【2022卡塔尔世界杯举办时间】：
当地时间 2022年11月20日 至 2022年12月18日
【2022卡塔尔世界杯旗帜】：

【2022卡塔尔世界杯吉祥物”La'eeb“】：

【2022年吉祥物的官方名称（英语/阿拉伯语）】：

【2022卡塔尔世界杯官方海报】：

【2022卡塔尔世界杯用球“Al Rihla”】：

【2022卡塔尔世界杯纪念币、邮票】：

【世界杯】：

【主办机构：国际足球联合会FIFA，简称”国际足联“】：

【FIFA Plus 标志FIFA 推出了免费的流媒体服务，命名为 FIFA Plus】：

【FIFA Living Football 口号】：

【文字标记】：

【官方字体“QATAR 2022”】：

【历届世界杯标志、吉祥物、用球】：

【世界杯其他管控元素要点】：

【涉及世界杯中国负面言论、蹭热点管控】：

【酒店】：

【世界杯主题曲】：

视频号-效果对比
视频号效果对比规则

不支持使用虚假夸大内容进行推广，包括但不限于人体不可逆功效疗效对比描述（
如：祛除皱纹、缩小眼袋、牙齿美白
）
驳回具体原因
动图及视频演绎场景展示前后效果对比
夸大承诺描述或虚假场景
未添加警示语【使用效果因人而异】
过审技巧
避开上述违规点
除医疗机构外不支持使用医疗用语或者易使推销的商品与药品、医疗器械相混淆的用语
如：消炎、抗炎、活血、解毒、抗敏、防敏、脱敏、祛瘀、医疗、疗效、微整形、药妆、注射、基因技术、医学护肤、病邪、阴阳失调、治愈、疗程、生发、毛发再生、止脱

杜绝物理化学性能混用描述
如：遮瑕膏可使用“遮盖色斑”的描述，但不能使用“去除色斑”

顶级（极限）/绝对化描述
如：XX产品/成分修复能力达到巅峰（顶级词汇）
如：“最新创造”、“最新发明”、“创世级”（绝对化用语）

违规详情&过审案例指引
行业
素材投放示意
驳回问题详情
素材过审指引
护肤彩妆/一般化妆品
素材示例详见下方
【案例图1】
素材展示沐浴露洗前洗后一黑一白效果明显差异，不支持【效果对比】素材展示，建议修改
素材内容仅展示产品使用后画面，描述产品特性
视频号案例-（一般化妆品通过案例1）
护肤彩妆/一般化妆品
视频号案例-效果对比（手、额头皱纹）
素材展示手、额头使用产品后去除了皱纹，不支持【效果对比】素材展示，建议修改
素材内容展示使用前画面、产品使用中画面，未涉及效果对比
视频号案例-（一般化妆品通过案例2）
护肤彩妆/一般化妆品
视频号案例-效果对比（鼻子黑头）
素材视频鼻子黑头使用产品前后展示差异，不支持【效果对比】素材展示，建议修改
素材内容展示产品使用画面，适用人群等描述
视频号案例-（一般化妆品通过案例）
【案例图1】：

行业
素材投放示意
驳回问题详情
素材过审指引
护肤彩妆/特殊用途化妆品
视频号案例-效果对比（缩小眼袋）
素材展示使用产品前后缩小眼袋差异，不支持【效果对比】素材展示，建议修改
素材内容展示产品介绍、描述产品特性
视频号案例-特殊用途化妆品通过案例1
护肤彩妆/特殊用途化妆品
视频号案例-效果对比、恶心（手臂祛斑）
素材展示使用产品前后手臂斑点消失，不支持【效果对比】素材展示，建议修改
素材内容展示产品，描述产品配方、特性
素材示例详见下方
【案例图2】

护肤彩妆/特殊用途化妆品
视频号案例-效果对比（写字去除展示效果）
素材展示化学类产品手上写字然后用产品后消掉的过程，不支持【效果对比】素材展示，建议修改
素材内容展示使用产品后画面、使用感受，手上写的字也是产品本身
视频号案例-特殊用途化妆品通过案例

【案例图2】：

行业
素材投放示意
驳回问题详情
素材过审指引
数码家电/美容电子仪器
视频号案例-效果对比（仪器改变脸部）
驳回素材展示仪器对脸部使用后，右脸部变小效果，不支持【效果对比】素材展示，建议修改
素材内容展示产品，使用人群感受
视频号案例-美容电子仪器通过案例
家居日用/个人洗护
视频号案例-效果对比（脚部裂纹）
素材展示产品使用皲裂多，涂抹后变光滑的效果，不支持【效果对比】素材展示，建议修改
素材内容展示产品，描述产品配方、特性
视频号案例-个人洗护通过案例
家居日用/口腔护理
视频号案例-效果对比（牙齿美白）
素材展示刷牙前后牙齿亮白对比，不支持使用【效果对比】素材展示，建议修改
素材内容展示产品使用过程，特写画面，未涉及效果对比
视频号案例-口腔护理通过案例`,
  249: `朋友圈广告外层文案规范
文字链规范
“文字链” 引导用户访问 “链接推广页”， 文字链文案须与推广页内容相关联
朋友圈广告进行品牌活动以及本地推广时可使用“了解更多”、“领取优惠”及“预约活动”三个文案，若推广页内容非“领取优惠”模版或不可直接领取优惠或无法通过预约登记到线下门店领取优惠，则外层文字链不得使用“领取优惠”，需修改为“了解更多”；若推广页内容非“预约活动”模版或无预约活动入口，外层文字链不得使用“预约活动”，需修改为“了解更多”
朋友圈广告外层图规范
广告素材设计不得利用功能性操作按钮/图标的样式误导用户，诱骗用户点击广告。
功能性操作按钮/图标包括但不限于：播放、暂停、关闭、点赞、评论、loading等

朋友圈广告视频规范  
视频广告需要遵守广告文案和视频规范，详情可参考 
创意规范

公众号底部广告、公众号互选广告、公众号文中广告审核规范
广告图片重要文字部分（比如产品或服务名称，或商品价格信息等）不得与系统右下角自带水印重叠（右下角水印尺寸为158px *
 
42px）

不得使用无文字图片，无法让用户了解所推广商品或服务；若投放关注卡片广告和互选广告，允许使用纯图片形式

公众号广告外层图片使用宫格/拼接/相似元素数量请勿超过6个；若使用多单图组合样式，所有单图的宫格/拼接/相似元素总数目不得超过6个

公众号文章视频贴片广告须遵循
《视频创意规范》
小程序广告位审核规范
广告图片重要文字部分（比如产品或服务名称，或商品价格信息等）不得与系统左上角“广告”水印及右下角自带水印重叠 

不得使用无文字图片，无法让用户了解所推广商品或服务；若投放关注卡片广告允许使用纯图片形式

小程序广告外层图片可使用宫格图，宫格数量不得超过6宫格；若使用多单图组合样式，所有单图的宫格/拼接/相似元素总数目不得超过6个

小游戏激励视频广告  
小游戏激励视频广告须遵循
《视频创意规范》`,
  67: `1. 不得使用“国家级”、“最高级”、“最佳”等绝对化用语。
广告中禁止使用“国家级”、“最高级”、“最佳”、“顶级”、“第一品牌”、“极品”、“至尊”、“最受欢迎”、“极致”等绝对化用语。

如：广告中声称自己的游戏是”2015年度最受欢迎的游戏“
2. 不得投放虚假或者引人误解的广告。
所推广商品或服务需真实、有效，不得欺骗、误导消费者。不得对商品的性能、功能、产地、用途、质量、成分、价格、生产者、有效期限、允诺等，或者对服务的内容、提供者、形式、质量、价格、允诺等做虚假宣传。
不得在广告中出现“央视上榜品牌”、“央视网合作伙伴”等央视称号描述。 《
央视关于从未颁发“央视上榜品牌”称号声明
》 、《关于颁发或者授权使用“
CCTV.COM 央视网合作伙伴
”等称号情况的严正声明》
不得有任何虚构原价、虚假折扣等价格欺诈以及虚假营销的行为。
对商品的描述应当有合理有效的证明资料支持，不可捏造或夸大内容，不可使用违背事实认知或逻辑的描述。

如：游戏广告中使用“这把刀能卖30万”、 “装备全靠打”等不符合游戏经营事实的文案

如：无严谨证据使用“领先”等不符合品牌及商品行业地位的文案
不得投放与市场价格差异过大，价格超低或明显造假的商品。

如：知名品牌商品价格远低于正品的市场价，iphone6s 399、苹果手机一折、LV1000元等

如：销售仿名牌、山寨、假冒伪劣商品，或A货、高仿、同款、外贸原单等商品
不得对产品或服务的效果做保证性承诺的表述。

如：禁止含“必须”类描述，妈妈必备、小孩必学；5天瘦10斤等
3. 广告使用数据、统计资料、调查结果、文摘、引用语等引证内容，应真实、准确，并表明出处。
引证内容有适用范围和有效期限的，应当明确表示适用范围和有效期限。
引用历史数据（比如在线人数、下载量、销售量、排名、通过率、成功率等），应当注明“历史数据，仅供参考”等提示说明。

如：广告中含有评奖、评比或排名等信息（如“销量第XX”、“市场占有率X%”、“获得XX年XX单位评选的XX奖”等），需要广告主提供有效的相关证明资料后方可发布广告
4. 不得在广告中涉及虚假专利产品或者专利方法。
在广告中使用专利产品或专利方法，应当标明专利号和专利种类。
未取得专利权的，不得在广告中谎称取得专利权。
禁止使用未授予专利权的专利申请和已经终止、撤销、无效的专利作广告。
5. 不得使用易引人误解的广告创意，故意欺骗、误导消费者：
广告应当具有可识别性，能够使消费者辨明其为广告。
大众传播媒介不得以新闻报道形式变相发布广告，不得使消费者产生误解。

如：以“XX新闻”的视频形式推广某类产品，使消费者误以为是电视台新闻在介绍该产品
广告素材上不得利用图标或按钮的操作功能误导用户，诱骗用户点击广告。图标或按钮，包括但不限于虚假播放、关闭、暂停按钮、手势图案、假分页、翻页图标、点赞、评论、loading 等。

如：外层图片上放置了关闭按钮，用户点击后实际进入广告页，而非关闭广告，属于欺骗、诱导用户点击



广告素材不得模仿系统或网站发出的消息或通知，使消费者误以为是系统行为。

如：告警、对话框、错误消息，“恭喜你获得一个礼包”、“祝贺你获得免费领取的资格”等


广告文案不得使用模拟好友关系链的文案，使消费者误以为是自己好友在进行邀请。

如：“亲爱的XXX，你的好友XX邀请你进行一起进行活动”等
广告页面不得仿照知名品牌网站链接或者知名品牌网站设计，以诱导用户点击或购买。
6. 不得贬低其他生产经营者的商品或者服务：
广告素材不得有直接或间接对比行为，如声称自己的产品、服务的质量、价格等比其他的商品、服务具有优势，从而直接或间接贬低其他商品或贬低竞争对手的产品、服务
（1）不支持将自己的产品与其他品牌产品价格进行对比
如：XX品牌精华一半的价格就能买到一瓶安瓶精华
*
（2）不支持将自己的产品与其他品牌产品效果进行对比

   （3）广告素材不得将自己的产品与不同品类商品的价格、使用效果进行对比，涉嫌虚假夸大
          如：迷你暖风机宣传其比空调还好用，迷你冷风机宣传比空调还凉快
          如：描述 4S 店洗车洗不干净，引导消费者使用自身产品（伸缩软管水枪)，暗示比 4S 店洗车更干净


7. 不得在广告中出现“驰名商标”字样
（《中华人民共和国商标法》第十五条）
。
8. 不得出现“国家免检产品”等涉及质量免检的内容。
9. 不得使用未经授权的第三方形象或标识：
广告素材或落地页使用他人名义或者形象的，应当事先取得其书面同意；使用无民事行为能力、限制民事行为能力人的名义或形象的，应当事先取得其监护人的书面同意。
广告中使用未成年人作为代言人的，则首先需要核查实该未成年人是否已经年满十周岁（未满十周岁禁止广告代言），其次，需要核查实该未成年人及其法定监护人的授权书。
广告素材或落地页涉及第三方logo、名称、产品、服务，包括但不限于时尚品牌、知名动漫、游戏素材、知名剧照、军事图片等，应当事先取得其授权证明，否则，需删除。

如：销售LV的商家，需提供LV品牌授权书，需明确提及授权范围及授权时间

如：游戏广告中使用“当年在帝国时代里一起盖的房子”的文案，暗喻与经典知名游戏的关联性，需提供授权
未经授权不得使用腾讯相关标识。

如：使用“腾讯投资”、“腾讯合作”、“微信合作”等文案，需事先征求腾讯书面协议同意
10. 不得损害国家、民族、社会的形象、利益及安全。
禁止使用或者变相使用中华人民共和国的国旗、国歌、国徽，军旗、军歌、军徽。 即：不得直接使用国旗、国徽、军旗、军徽本身作为广告素材，或使用国歌、军歌的歌词或音乐作为素材，如以国旗作为广告背景。
禁止使用或者变相使用国家机关、国家机关工作人员的名义或者形象。
禁止使用党和政府、人大、政协、审判机关、检察机关、军队、武警、其他国家机关及国家机关工作人员的形象做推荐或者广告素材，如将国家领导肖像作为广告素材。
禁止使用“专（特）供XX国家机关”、“XX（国家机关）专用”、“XXX省（市）指定专用产品”、“军队特工”、“军队特需”等国家机关名义或类似内容。
禁止利用与国家机关有密切关联的特定地点名称（如中南海）或者标志性建筑物的名称（如大会堂），以及利用国宴、国宾等内容宣传“特供”、“专供”、“专用”或类似内容。
禁止损害国家的尊严或者利益，泄露国家秘密。

如：广告中将代表中华民族的元素予以贬低，或散播辱华言论

如：军工企业在广告中泄漏其所知悉设备类型、生产数据等

如：广告中随意使用变形地图或者违法编制出版的地图，或擅自改变国家界限、行政区域界限以及漏绘重要岛屿
禁止妨碍社会安定，损害社会公共利益。 广告应当维护社会的安定，维护公共利益，不能利用时政事件进行商品或品牌宣传。

如：为推销某类保健品，夸大某种疾病的社会危害，可能引起公众恐慌等

如：为推销抗震产品，错误宣传地震的逃生方法或预计地震周期等

如：广告中利用利用水灾等天灾人祸进行品牌形象的宣传（免费赞助等内容）

如：游戏类广告利用战争热点，进行过度宣传
禁止含有民族、种族、宗教、性别歧视的内容。

如：广告素材中贬低某一民族、种族，或含有宣扬男尊女卑的内容
禁止妨碍环境、自然资源或者文化遗产保护。

如：宣扬浪费自然资源、毁坏文化遗产
11. 不得违背社会精神文明建设要求，不得违背社会风尚良俗。
禁止妨碍社会公共秩序或者违背社会良好风尚。广告应当维护社会秩序，维护社会公序良俗，正面宣传推广产品或服务。

如：出现低俗流行语、脏话，痞话及相关文案、图片，如求包养、屌丝、小秘、二奶、推倒、傻逼、SB、艳遇、草泥马等

如：出现违背职业道德的场景：上班瞒着老板偷偷玩游戏
禁止含有淫秽、色情、赌博、迷信、恐怖、暴力的内容。

如：使用过分裸露的形象，包括真人和卡通

如：在广告中宣扬邪教、封建迷信等内容
广告不得损害未成年人和残疾人的身心健康。

如：广告中宣传如果父母不给孩子买某类商品，那就是父母不爱孩子

如：广告中侮辱、歧视残疾人，贬低残疾人等
12. 不得违反广告代言规则。
广告代言人，是指广告主以外的，在广告中以自己的名义或者形象对商品、服务作推荐、证明的自然人、法人或者其他组织。广告中使用代言人需要遵循以下规则：
广告代言人在广告中对商品、服务作推荐、证明，应当依据事实，符合本法和有关法律、行政法规规定，并不得为其未使用过的商品或者未接受过的服务作推荐、证明。
任何商品、服务均不得利用不满十周岁的未成年人作为广告代言人。
招商等有投资回报预期的商品或者服务、教育、培训广告不得利用科研单位、学术机构、教育机构、行业协会、专业人士、受益者的名义或者形象作推荐、证明。
医疗、药品、医疗器械、保健食品广告不得利用广告代言人作推荐、证明。
农药、兽药、饲料、饲料添加剂、农作物种子、林木种子、草种子、种畜禽、水产苗种和种养殖广告不得利用科研单位、学术机构、技术推广机构、行业协会或者专业人士、用户的名义或者形象作推荐、证明。
对在虚假广告中作推荐、证明受到行政处罚未满三年的自然人、法人或者其他组织，不得利用其作为广告代言人。
1. 微信广告限制投放活动类型
限制投放促销活动类型：包括但不限于线上“0 元购”、“1元购”、“1元秒杀”、“免费试用”、“预付充值、押金”、“虚构原价折扣促销”、“免费或低于市场价格的超低价拼团（如：0.01 分拼团）”、“免费抽高额奖品”、“以旧换新”等具有强诱导性、风险较高的促销活动。仅对京东等知名电商商家或小米等大型品牌商家投放开放；
暂不限制在线教育进行免费试听等不涉及实物商品购买的活动，但如需相关条件免费试听的，请在文案或详情页内容里进行描述；
线下（在商家门店）进行的1元抢购、免费试用、充值等内容可支持投放
其他限制投放活动类型：包括但不限于代言人选拔、模特演员选拔等。
2. 微信广告禁止投放活动类型：包括但不限于众筹、1 元夺宝等。
3. 微信广告促销活动投放内容基本要求： 广告中的活动内容描述需清晰，有较详细的活动规则，必须包含：
活动时间

如：XX年XX月XX日-XX日或截止时间为XX月XX日
活动主题

如：满 2000 元抽奖送“礼”
活动奖品

如：礼品包含价值 500 元XX
获赠条件和限制

如：“名额有限，先到先得”、“仅限新注册用户参与”、“下载 App 后领取”
活动参与门槛

如：购买满 200 元可参与
电商平台通过“推广我的应用”推广外层内容为商品单品类广告，且在广告文案或图片上标注具体价格，需在推广页按钮下方（若使用多个下载按钮，则需在首个按钮下方）有单品商品购买路径指引。
电商平台通过“推广我的应用”推广外层内容为电商活动类广告，外层活动规则需与推广页规则一致。
电商平台通过“推广我的应用”推广外层内容为限时限量抢购类商品广告，必须符合以下条件：
外层文字链需使用“下载应用”文字链或者在外层文案或图片标注“下载后方可参加”（在外层图片进行标注，文字需清晰可见，手机预览能正常查看）；
限量抢购的数量标注要求：

若限量数量低于 100 件，则需在广告外层图片或文案注明抢购商品数量。若限量数量高于 100 件，则需在推广页引导抢购的按钮下方中清晰描述；

抢购数量的数字不得使用繁体数字，仅允许使用阿拉伯数字或中文简体数字，如：可使用“限量三件”或“限量 3 件”,不得使用“限量叁件”；
限时抢购的时间标注要求：

若使用“限时抢购”活动进行长期 App 下载推广，需要在外层文案或图片中标注具体抢购时间；
凡广告外层文案或图片出现价格的：

外层素材上价格需明确标明为抢购价或拼团价（避免误导为正常价格），且不允许出现抢购价格与原价对比的描述，如：“9.9元抢购 889 元沙发”；

不支持数量低于 100 件商品使用“特价”描述；
外层素材不得使用“立即抢购”等诱导文案描述，避免用户以为点击后可直达抢购商品页；
若在推广页中使用按钮引导 App 下载，需在按钮下方（若使用多个下载按钮，则需在首个按钮下方）进行下载抢购操作相关描述（描述文字颜色不得与背景颜色过于相似，需清晰易识别）：
抢购路径（即引导用户在 App 中如何进行抢购，如：下载 App 后搜索 9 块 9 包邮等）
若下载按钮使用“点击抢购”等与下载操作不一致的文案，则需将按钮文案修改为“下载抢购”相关，或在抢购路径里明确表明“需下载 App 享受抢购优惠”）
抢购时间（要求抢购时间需与投放时间一致）、抢购数量或其他抢购条件等。
4. 抽奖式有奖销售活动。
根据《中国人民共和国反不正当竞争法》中《关于
禁止有奖销售活动中不正当竞争行为
的若干规定》要求，抽奖式有奖销售活动需遵守以下规定：
抽奖式有奖销售，活动奖品最高奖不得超过50000元。

如：买 A 商品有机会获得B礼品，属于抽奖式有奖销售
若以特定物品的使用权为奖品的，奖品金额以该特定物品自身的价格为评估标准，而不是看该使用权的价格。

如：以汽车 1 个月的使用权作为奖品的，要看汽车本身的价格，而不是租车 1 个月的价格
5. 附赠有奖销售活动
广告中表明推销的商品或者服务附带赠送的，应当明示所附带赠送商品或者服务的品种、规格、数量、期限和方式。

如：“买一送一”，需要明确“送一”送的是什么
附赠奖品价值需与描述一致。

如：广告中声称“赠送高级礼品”，实际上赠送的只是普通廉价的牙膏牙刷等，则奖品价值与描述不一致
6. 赠送红包优惠券类活动
不得出现歧义文案。

如：广告素材或落地页若描述为红包，必须发放为现金；若发放的为优惠券，描述需为优惠券
不得出现赠送内容与实际不符的情况。

如：红包素材内容为现金，但实际领取为优惠券
不得利用抢红包活动进行诱导分享、诱导关注快速获得粉丝以及谋取不当利益。

如：欺诈用户等恶意行为
7. 其他：活动内容中，不得出现类似“本活动由XXX享有解释权”的格式条款
《零售商促销行为管理办法》
第六条、
《合同违法行为监督处理办法》
第十一条
1. 广告所推广产品、品牌需与开户认证主体及账户内容一致，不允许代投放行为
如：A店铺帮助隔壁的B店铺推广广告的行为

如：A代理商开通广告主账号帮助多品牌客户推广广告

如：A品牌使用无关联的B公司主体认证，开通广告主投放`,
  66: `资质审核内容
我们将根据你的微信公众帐号内容（包括但不限于功能介绍、自定义菜单内容、历史消息内容等）、你所提供的网站或者APP内容、你实际经营业务等确认行业类别，并按照该类别相应的法律法规或政策规定对你提供的营业执照经营范围、行业资质等资质材料进行核对。
为了快速通过审核，建议先完善公众帐号运营内容，介绍、说明并展示你真实的经营内容。
资质审核要点
应提供与微信广告服务要求一致的齐全、完整的资质材料等内容，充分证明你具备提供相关行业商品或服务的相关资质。
所有资质需合法并真实有效，资质材料等清晰、可辨认。
资质材料的主体需和公众帐号认证主体一致，若公众帐号认证主体与资质主体不一致，需注意以下事项：
若公众帐号认证主体与资质主体之间存在关联企业关系，可提供关联证明及授权投放协议：

关联企业关系是指两个主体之间存在直接或间接控制关系、直接或间接受控于同一公司主体。需提供双方主体在全国企业信用信息公示系统的股东及出资信息截图证明或其他能证明双方关联关系的有效证明； 授权投放协议可参考《
（范例）授权书
》。

金融行业暂不支持此类授权
，若有异议，可咨询微信公众号“微信广告助手”。
若公众帐号认证主体与资质主体之间存在业务合作关系，则可提供合法正规合作协议、采购协议、结算协议、开发协议及品牌商标授权等证明。业务合作关系包括但不限于品牌商与经销商的经销关系、进口经销商与物流提供商的合作关系、应用所有者与应用外包开发商之间的合作关系等。
暂不支持无关联的主体之间进行代理投放。

如：广告主名称为品牌商，但代理公司为公众帐号认证主体；或广告代理开通帐号为多个品牌或广告主进行代投。
广告代理商或服务商可在腾讯社交平台开通服务商帐号，在服务商系统中为广告主进行投放操作。
广告主需提供清晰的原件扫描件或经加盖公章确认的复印件扫描件，供腾讯存档备案。
广告主提交的资质材料上明确标明“仅用于某某地方”、“某某事情不做其他用途的情况”，若未注明可以用作腾讯社交广告或微信广告开户申请，则将被驳回。
资质材料需在有效期内。
`,
  65: `1. 偷逃税款产品
未履行正常进口手续的商品，比如"水货"、”欧水”、"港水"等类似产品
2. 国家保护野生动植物
野生动物：国家有关规定中的，野生动物、世界或国家保护类动物、濒危动物活体、内脏、任何肢体、皮毛、标本或其他制成品均不能发布，比如象牙和玳瑁类制品
野生植物：被列入世界或国家保护类植物清单的、法律禁止不得销售的植物，或植物产品
3. 涉毒类
包括各类毒品、易制毒化学品、毒品原料、制毒的书籍
4. 博彩类
博彩工具：如老虎机等
博彩产品：指违法博彩产品，如六合彩、天线宝宝等中国大陆地区未允许销售的彩种
博彩技术：禁止刊载介绍赌博技术的广告，如赌术、千术等类
作弊工具：透视眼镜、变牌器、老千工具等
5. 妨害交通安全秩序的产品
如汽车反雷达测速仪、电子狗、汽车隐性喷雾、卷帘式车牌架、雷达干扰器、牌照遮盖设备、交通信号灯变换器等相关产品
6. 枪支、弹药及其他武器类
包括各类枪支、弹药及相关器材，如枪械、枪械仿制品（如仿真枪）、子（炮）弹、消音器、火药、说明书、包装盒等
其他武器：弓弩、弹弓、钢珠、铅珠、真机、真弹等
7. 安防、警用和军用设备
安防设备指包括但不限于电击、强光、催泪等保安防卫器械
警用、军用设备指包括但不限于警服、警徽、手铐、警灯、警笛、电击器等警用和军用器械
8. 侵犯他人知识产权的产品
侵犯商标、专利的商品：各种假冒、山寨产品等
侵犯版权的商品：侵权影视剧、综艺节目、软件程序、网站等
私服外挂：私服是指未经权利人授权，非法获得服务器端安装程序之后设立网络服务器 
外挂是指利用电脑技术针对一个或多个网络游戏，通过改变软件的部分程序制作而成的作弊程序
其他：如未经授权销售其他厂商游戏装备、冒充其他游戏官网等，设立钓鱼网站等
9. 侵犯他人隐私的器材
窃听器、偷拍机、针孔摄像、信息拦截（传真拦截、短信拦截、电话拦截）等可能侵犯他人隐私的违规器材
侵犯他人个人信息的产品，包括但不限于直接提供他人手机号码、电子邮箱地址等个人信息，以及提供用于收集、盗取他人信息的软件、产品等（比如钓鱼网站）
10. 票据类
包括各类发票、财务票据等
包括代开、出售真假发票
11. 假证、假章
提供办理虚假证件、私刻公章等非法服务
12. 代考、代写论文服务
顶替参加考试、代写论文等
13. 非法套现
代理提取公积金、社保以及信用卡套现等业务
14. 非法网络公关
非法的网络水军、网络推手、灌水公司、删帖公司、软文营销等
15. 烟草制品
香烟、烟盒、烟标等
16. 非法接入信号产品
电视棒、信号接收器等非法电视信号接收设备
17. 文物、文献作品
有相应合法资质的文物商店、经营文物拍卖的拍卖企业除外
18. 违法集邮票品
合法的邮票（包括普通邮票和纪特邮票）交换和买卖可以进行
不得从事《集邮市场管理办法》第二十五条规定的下列活动：
经营伪造、变造的邮资凭证
经营国家禁止流通的集邮票品
经营1949年10月1日以后台湾地区发行的集邮票品
经营未注明发行单位信息的集邮品
经营不符合国家规定的仿印仿制邮票图案的集邮品
经营明显具有虚假信息的集邮品
经营擅自进口的集邮票品
冒用他人名义制作或者销售集邮票品
其他违反国家有关规定的经营活动
19. 违法书刊、影视剧类
违法书籍、影视剧类，包括但不限于：
淫秽、色情类书刊、影视剧等，包括但不限于低俗、色情写真、视频、AV等
妨害社会安定、损害国家统一、破坏民族团结的书刊、影视剧等
含有种族或者宗教歧视或其他违法违规内容的出版物、文件、资料等
20. 流通人民币
正在流通的人民币
21. 特殊药品
包括麻醉药品、精神药品、放射性药品，临床试用、迷幻药、试生产的药品和所有处方药品
包括上述特殊药品的说明书、包装盒等相关产品
22. 政府文件
政府颁布的各种证件、文件，如身份证、档案、各类许可证等
23. 危险物品
易燃、易爆品及制造原料
有毒、有腐蚀性的化学品及制造原料
烟花爆竹和烟花爆竹燃放装置
制造爆炸物的书刊、视频资料等
24. 管制刀具
违反国家管制刀具认定标准的刀具，如匕首、三棱刀（包括机械加工用的三棱刮刀）、带有自锁装置的弹簧刀（跳刀）以及其他类似的单刃、双刃、三棱尖刀等
25. 非法所得物
如走私、盗窃或抢劫所得物品
26. 侵犯他人财产权益的产品
偷电、非法节电等产品
蹭网卡、蹭网器、拨号器等
存在扣费项目不明确、恶意扣费、暗设扣费程序等任何损害用户权益的情况，或含有盗号、窃取密码等恶意程序的产品
其他：诈骗网站
27. 特殊疾病
不得宣传国家要求暂停发布医疗广告的疾病：尖锐湿疣、梅毒、淋病、软下疳、牛皮癣（或银屑病）、艾滋病、癌症（或恶性肿瘤）、癫痫、乙型肝炎、白癜风、红斑狼疮
广告中也不得出现上述疾病的专业性术语，如乙型肝炎的专业术语，包括HBV、大三阳、小三阳转阴、两对半等
28. 非法性用品
如非法催情用品等
29. 其他违法违规的产品、服务
代孕、试药、胎儿性别鉴定服务
人体器官、遗体
介绍汽车解码器、万能钥匙、麻醉专用药等各种可用于犯罪技术的广告
其他违法违规的产品、服务
以下暂不对外开放的商品及服务适用于所有行业，可留意微信广告后续的开放策略变化。
1. 综合电商
个人代购买手服务
分销（所有行业均不支持分销模式）
返利平台
一元购电商平台
名称里含“分销”、“微商”两个词语
二手售卖平台、二手回收平台
2. 服饰鞋包
野生动物皮草
医疗器械范畴的口罩用品
3. 护肤彩妆
特殊用途化妆品中含祛痘、育发、脱毛、美乳、健美、除臭、祛斑、去疤功能的化妆品
4. 教育培训
致富，成功学培训机构
无法颁发学历证书的培训机构不支持投放MBA（工商管理硕士）、IMBA（国际工商管理硕士）、MSF（金融学硕士）等硕士及以上学历教育广告
暂不支持记忆力、智力、情商等心理培训类
5. 金融
无明确许可的金融衍生品
买卖银行账户（银行卡）
POS机销售、利用POS机套现、返利
集资、众筹平台
虚拟货币交易：如比特币、莱特币、元宝币等
债券、股权交换交易
债券转让
现货交易（包括原油及原油衍生品交易、贵金属交易）、担保
校园贷、学生贷、P2P网贷平台、金融综合理财平台
投资咨询：风投平台、找投资项目相关
证券股票咨询
私募基金、私募型金融产品
代还信用卡：宣传申请信用卡来还另一张信用卡欠款
信用卡套现
股票配资
6. 汽车
平行进口车销售
抵押车销售
电子狗、反雷达测速仪、隐形喷雾、卷帘式车牌架、雷达干扰器等
7. 房地产
海外房产投资及租赁
8. 日用家居
成人用品
女性护理用品
香烟相关：烟草、戒烟产品、烟嘴、烟袋、烟具、电子香烟等
殡葬用品
9. 软件应用
IM类社交通信软件
网络语音电话类，包括但不限于以纯语音、视频+语音等任何方式的网络电话
宣传能免费打电话的产品
应用分发和应用集成
10. 生活服务
星座宗教：涉及宗教或者迷信类的广告文案，如：开光、治病祛灾、升官发财等
海外月子机构或中心
电子烟
医疗美容机构：如水光针等医疗美容项目
彩票
手机维修：邮寄维修类
涉桑拿会所、按摩会所、养生会所、足疗、电玩城等
纹身服务
殡葬服务
卡券消费
宠物医疗，如宠物医院等
11. 商务服务
票据业务、私家侦探
代发论文
代办业务：包含但不限于代办户口、公积金、社保、积分入户、证件挂靠、公积金提取等
违章代缴：涉及帮商户办理消除扣分代办业务的
移民中介：海外产子（香港产子等）移民禁止、海外投资移民禁止
营销机构：主营业务为专业网络营销（微博营销、搜索引擎营销、微信营销）、广告平台、电商刷单、网络水军、网络推手公司、删帖公司、软文营销等
广告交易平台、财务、税务
调查：提供调查服务的主体和业务，如：市场调查、社会调查、企业调查、个人信息调查等
布展会展：暂不支持非正规商业性质的军事展览或军事模型展览（可支持政府机构主办或联合主办的）、暂不支持禁止行业的会展宣传（如：医疗器械、医疗美容、微商、营销投资会议等等）
对外劳务
提供公关服务的主体和业务，如：礼仪、接待、公关、模特、商务活动的服务人员（如晚会服务人员、会展促销员等）等
网络兼职招聘、刷单员招聘
催债、催收、黄牛
12. 食品
海参、鱼翅、花胶四类高价海味干货销售
活禽销售，如：农村散养走地鸡
烟草
13. 数码家电
电视棒
不受官方认可有争议的数码配置或服务，如：iphone双卡、苹果手机内存升级等
迷你摄像头、隐藏摄像头、窃听器
护眼仪（属于医疗器械）
带祛斑或淡斑功能的按摩仪（属于医疗器械）
14. 网站门户
包括但不限于两性情感、医疗美容、众筹、贵金属、P2P资讯等禁投产品内容资讯
15. 文化娱乐
盗版类书籍影音
反动类书籍影音
艺术品经营、收藏、拍卖
视频交友类直播平台
16. 自媒体
两性类：两性类低俗文章等
迷信类：星座宗教风水等
时政类：反动言论类等
医疗类：医疗、药品信息、医疗美容、整形美容信息发布等
养生类：保健调养、饮食营养，养生资讯等
段子类：搞笑段子，荤黄段子，恶搞段子，搞笑视频等
娱乐八卦类：娱乐新闻，明星隐私等
金融类中，若内容涉及金融相关业务，需要从金融行业下对应子行业准入，并提供相应资质才能准入
科教文化类中，若内容涉及以微信经营资讯为主要内容，则不准入；若内容涉及美女图集，美拍类，则不准入
17. 虚拟服务
游戏衍生服务：包括但不限于游戏代练、装备帐号交易、游戏币或点卡充值
手机充值：非官方渠道充值或非知名手机充值平台
18. 钟表首饰
赌石
19. 安全安保
涉及隐私的定位类产品，GPS等
窃听器、偷拍机、针孔摄像、信息拦截（传真拦截、短信拦截、电话拦截）等专用间谍器材和业务
20. 工农业
兽药、农药
21. 节能环保
二手商品售卖
22. 交通运输
涉及军用飞机的航空交易平台
23. 招商加盟
招商加盟平台
朋友圈广告不支持投放招商加盟类型广告`,
  64: `1. 偷逃税款产品
未履行正常进口手续的商品，比如"水货"、”欧水”、"港水"等类似产品
2. 国家保护野生动植物
野生动物：国家有关规定中的，野生动物、世界或国家保护类动物、濒危动物活体、内脏、任何肢体、皮毛、标本或其他制成品均不能发布，比如象牙和玳瑁类制品
野生植物：被列入世界或国家保护类植物清单的、法律禁止不得销售的植物，或植物产品
3. 涉毒类
包括各类毒品、易制毒化学品、毒品原料、制毒的书籍
4. 博彩类
博彩工具：如老虎机等
博彩产品：指违法博彩产品，如六合彩、天线宝宝等中国大陆地区未允许销售的彩种
博彩技术：禁止刊载介绍赌博技术的广告，如赌术、千术等类
作弊工具：透视眼镜、变牌器、老千工具等
5. 妨害交通安全秩序的产品
如汽车反雷达测速仪、电子狗、汽车隐性喷雾、卷帘式车牌架、雷达干扰器、牌照遮盖设备、交通信号灯变换器等相关产品
6. 枪支、弹药及其他武器类
包括各类枪支、弹药及相关器材，如枪械、枪械仿制品（如仿真枪）、子（炮）弹、消音器、火药、说明书、包装盒等
其他武器：弓弩、弹弓、钢珠、铅珠、真机、真弹等
7. 安防、警用和军用设备
安防设备指包括但不限于电击、强光、催泪等保安防卫器械
警用、军用设备指包括但不限于警服、警徽、手铐、警灯、警笛、电击器等警用和军用器械
8. 侵犯他人知识产权的产品
侵犯商标、专利的商品：各种假冒、山寨产品等
侵犯版权的商品：侵权影视剧、综艺节目、软件程序、网站等
私服外挂：私服是指未经权利人授权，非法获得服务器端安装程序之后设立网络服务器 
外挂是指利用电脑技术针对一个或多个网络游戏，通过改变软件的部分程序制作而成的作弊程序
其他：如未经授权销售其他厂商游戏装备、冒充其他游戏官网等，设立钓鱼网站等
9. 侵犯他人隐私的器材
窃听器、偷拍机、针孔摄像、信息拦截（传真拦截、短信拦截、电话拦截）等可能侵犯他人隐私的违规器材
侵犯他人个人信息的产品，包括但不限于直接提供他人手机号码、电子邮箱地址等个人信息，以及提供用于收集、盗取他人信息的软件、产品等（比如钓鱼网站）
10. 票据类
包括各类发票、财务票据等
包括代开、出售真假发票
11. 假证、假章
提供办理虚假证件、私刻公章等非法服务
12. 代考、代写论文服务
顶替参加考试、代写论文等
13. 非法套现
代理提取公积金、社保以及信用卡套现等业务
14. 非法网络公关
非法的网络水军、网络推手、灌水公司、删帖公司、软文营销等
15. 烟草制品
香烟、烟盒、烟标等
16. 非法接入信号产品
电视棒、信号接收器等非法电视信号接收设备
17. 文物、文献作品
有相应合法资质的文物商店、经营文物拍卖的拍卖企业除外
18. 违法集邮票品
合法的邮票（包括普通邮票和纪特邮票）交换和买卖可以进行
不得从事《集邮市场管理办法》第二十五条规定的下列活动：
经营伪造、变造的邮资凭证
经营国家禁止流通的集邮票品
经营1949年10月1日以后台湾地区发行的集邮票品
经营未注明发行单位信息的集邮品
经营不符合国家规定的仿印仿制邮票图案的集邮品
经营明显具有虚假信息的集邮品
经营擅自进口的集邮票品
冒用他人名义制作或者销售集邮票品
其他违反国家有关规定的经营活动
19. 违法书刊、影视剧类
违法书籍、影视剧类，包括但不限于：
淫秽、色情类书刊、影视剧等，包括但不限于低俗、色情写真、视频、AV等
妨害社会安定、损害国家统一、破坏民族团结的书刊、影视剧等
含有种族或者宗教歧视或其他违法违规内容的出版物、文件、资料等
20. 流通人民币
正在流通的人民币
21. 特殊药品
包括麻醉药品、精神药品、放射性药品，临床试用、迷幻药、试生产的药品和所有处方药品
包括上述特殊药品的说明书、包装盒等相关产品
22. 政府文件
政府颁布的各种证件、文件，如身份证、档案、各类许可证等
23. 危险物品
易燃、易爆品及制造原料
有毒、有腐蚀性的化学品及制造原料
烟花爆竹和烟花爆竹燃放装置
制造爆炸物的书刊、视频资料等
24. 管制刀具
违反国家管制刀具认定标准的刀具，如匕首、三棱刀（包括机械加工用的三棱刮刀）、带有自锁装置的弹簧刀（跳刀）以及其他类似的单刃、双刃、三棱尖刀等
25. 非法所得物
如走私、盗窃或抢劫所得物品
26. 侵犯他人财产权益的产品
偷电、非法节电等产品
蹭网卡、蹭网器、拨号器等
存在扣费项目不明确、恶意扣费、暗设扣费程序等任何损害用户权益的情况，或含有盗号、窃取密码等恶意程序的产品
其他：诈骗网站
27. 特殊疾病
不得宣传国家要求暂停发布医疗广告的疾病：尖锐湿疣、梅毒、淋病、软下疳、牛皮癣（或银屑病）、艾滋病、癌症（或恶性肿瘤）、癫痫、乙型肝炎、白癜风、红斑狼疮
广告中也不得出现上述疾病的专业性术语，如乙型肝炎的专业术语，包括HBV、大三阳、小三阳转阴、两对半等
28. 非法性用品
如非法催情用品等
29. 其他违法违规的产品、服务
代孕、试药、胎儿性别鉴定服务
人体器官、遗体
介绍汽车解码器、万能钥匙、麻醉专用药等各种可用于犯罪技术的广告
其他违法违规的产品、服务
以下暂不对外开放的商品及服务适用于所有行业，可留意微信广告后续的开放策略变化。
1. 综合电商
个人代购买手服务
分销（所有行业均不支持分销模式）
返利平台
一元购电商平台
名称里含“分销”、“微商”两个词语
二手售卖平台、二手回收平台
2. 服饰鞋包
野生动物皮草
医疗器械范畴的口罩用品
3. 护肤彩妆
特殊用途化妆品中含祛痘、育发、脱毛、美乳、健美、除臭、祛斑、去疤功能的化妆品
4. 教育培训
致富，成功学培训机构
无法颁发学历证书的培训机构不支持投放MBA（工商管理硕士）、IMBA（国际工商管理硕士）、MSF（金融学硕士）等硕士及以上学历教育广告
暂不支持记忆力、智力、情商等心理培训类
5. 金融
无明确许可的金融衍生品
买卖银行账户（银行卡）
POS机销售、利用POS机套现、返利
集资、众筹平台
虚拟货币交易：如比特币、莱特币、元宝币等
债券、股权交换交易
债券转让
现货交易（包括原油及原油衍生品交易、贵金属交易）、担保
校园贷、学生贷、P2P网贷平台、金融综合理财平台
投资咨询：风投平台、找投资项目相关
证券股票咨询
私募基金、私募型金融产品
代还信用卡：宣传申请信用卡来还另一张信用卡欠款
信用卡套现
股票配资
6. 汽车
平行进口车销售
抵押车销售
电子狗、反雷达测速仪、隐形喷雾、卷帘式车牌架、雷达干扰器等
7. 房地产
海外房产投资及租赁
8. 日用家居
成人用品
女性护理用品
香烟相关：烟草、戒烟产品、烟嘴、烟袋、烟具、电子香烟等
殡葬用品
9. 软件应用
IM类社交通信软件
网络语音电话类，包括但不限于以纯语音、视频+语音等任何方式的网络电话
宣传能免费打电话的产品
应用分发和应用集成
10. 生活服务
星座宗教：涉及宗教或者迷信类的广告文案，如：开光、治病祛灾、升官发财等
海外月子机构或中心
电子烟
医疗美容机构：如水光针等医疗美容项目
彩票
手机维修：邮寄维修类
涉桑拿会所、按摩会所、养生会所、足疗、电玩城等
纹身服务
殡葬服务
卡券消费
宠物医疗，如宠物医院等
11. 商务服务
票据业务、私家侦探
代发论文
代办业务：包含但不限于代办户口、公积金、社保、积分入户、证件挂靠、公积金提取等
违章代缴：涉及帮商户办理消除扣分代办业务的
移民中介：海外产子（香港产子等）移民禁止、海外投资移民禁止
营销机构：主营业务为专业网络营销（微博营销、搜索引擎营销、微信营销）、广告平台、电商刷单、网络水军、网络推手公司、删帖公司、软文营销等
广告交易平台、财务、税务
调查：提供调查服务的主体和业务，如：市场调查、社会调查、企业调查、个人信息调查等
布展会展：暂不支持非正规商业性质的军事展览或军事模型展览（可支持政府机构主办或联合主办的）、暂不支持禁止行业的会展宣传（如：医疗器械、医疗美容、微商、营销投资会议等等）
对外劳务
提供公关服务的主体和业务，如：礼仪、接待、公关、模特、商务活动的服务人员（如晚会服务人员、会展促销员等）等
网络兼职招聘、刷单员招聘
催债、催收、黄牛
12. 食品
海参、鱼翅、花胶四类高价海味干货销售
活禽销售，如：农村散养走地鸡
烟草
13. 数码家电
电视棒
不受官方认可有争议的数码配置或服务，如：iphone双卡、苹果手机内存升级等
迷你摄像头、隐藏摄像头、窃听器
护眼仪（属于医疗器械）
带祛斑或淡斑功能的按摩仪（属于医疗器械）
14. 网站门户
包括但不限于两性情感、医疗美容、众筹、贵金属、P2P资讯等禁投产品内容资讯
15. 文化娱乐
盗版类书籍影音
反动类书籍影音
艺术品经营、收藏、拍卖
视频交友类直播平台
16. 自媒体
两性类：两性类低俗文章等
迷信类：星座宗教风水等
时政类：反动言论类等
医疗类：医疗、药品信息、医疗美容、整形美容信息发布等
养生类：保健调养、饮食营养，养生资讯等
段子类：搞笑段子，荤黄段子，恶搞段子，搞笑视频等
娱乐八卦类：娱乐新闻，明星隐私等
金融类中，若内容涉及金融相关业务，需要从金融行业下对应子行业准入，并提供相应资质才能准入
科教文化类中，若内容涉及以微信经营资讯为主要内容，则不准入；若内容涉及美女图集，美拍类，则不准入
17. 虚拟服务
游戏衍生服务：包括但不限于游戏代练、装备帐号交易、游戏币或点卡充值
手机充值：非官方渠道充值或非知名手机充值平台
18. 钟表首饰
赌石
19. 安全安保
涉及隐私的定位类产品，GPS等
窃听器、偷拍机、针孔摄像、信息拦截（传真拦截、短信拦截、电话拦截）等专用间谍器材和业务
20. 工农业
兽药、农药
21. 节能环保
二手商品售卖
22. 交通运输
涉及军用飞机的航空交易平台
23. 招商加盟
招商加盟平台
朋友圈广告不支持投放招商加盟类型广告`,
}
